اے ہمالہ! اے فصيل کشور ہندوستاں
چومتا ہے تيري پيشاني کو جھک کر آسماں
تجھ ميں کچھ پيدا نہيں ديرينہ روزي کے نشاں
تو جواں ہے گردش شام و سحر کے درمياں
ايک جلوہ تھا کليم طور سينا کے ليے
تو تجلي ہے سراپا چشم بينا کے ليے
امتحان ديدئہ ظاہر ميں کوہستاں ہے تو
پاسباں اپنا ہے تو ، ديوار ہندستاں ہے تو
مطلع اول فلک جس کا ہو وہ ديواں ہے تو
سوئے خلوت گاہ دل دامن کش انساں ہے تو
برف نے باندھي ہے دستار فضيلت تيرے سر
خندہ زن ہے جو کلاہ مہر عالم تاب پر
تيري عمر رفتہ کي اک آن ہے عہد کہن
واديوں ميں ہيں تري کالي گھٹائيں خيمہ زن
چوٹياں تيري ثريا سے ہيں سرگرم سخن
تو زميں پر اور پہنائے فلک تيرا وطن
چشمہ دامن ترا ئنہ سےال ہے
دامن موج ہوا جس کے ليے رومال ہے
ابر کے ہاتھوں ميں رہوار ہوا کے واسطے
تازيانہ دے ديا برق سر کہسار نے
اے ہمالہ کوئي بازي گاہ ہے تو بھي ، جسے
دست قدرت نے بنايا ہے عناصر کے ليے
ہائے کيا فرط طرب ميں جھومتا جاتا ہے ابر
فيل بے زنجير کي صورت اڑا جاتا ہے ابر
جنبش موج نسيم صبح گہوارہ بني
جھومتي ہے نشہ ہستي ميں ہر گل کي کلي
يوں زبان برگ سے گويا ہے اس کي خامشي
دست گلچيں کي جھٹک ميں نے نہيں ديکھي کبھي
کہہ رہي ہے ميري خاموشي ہي افسانہ مرا
کنج خلوت خانہ قدرت ہے کاشانہ مرا
آتي ہے ندي فراز کوہ سے گاتي ہوئي
کوثر و تسنيم کي موجوں کي شرماتي ہوئي
آئنہ سا شاہد قدرت کو دکھلاتي ہوئي
سنگ رہ سے گاہ بچتي ، گاہ ٹکراتي ہوئي
چھيڑتي جا اس عراق دل نشيں کے ساز کو
اے مسافر دل سمجھتا ہے تري آواز کو
ليلي شب کھولتي ہے آ کے جب زلف رسا
دامن دل کھينچتي ہے آبشاروں کي صدا
وہ خموشي شام کي جس پر تکلم ہو فدا
وہ درختوں پر تفکر کا سماں چھايا ہوا
کانپتا پھرتا ہے کيا رنگ شفق کہسار پر
خوشنما لگتا ہے يہ غازہ ترے رخسار پر
اے ہمالہ! داستاں اس وقت کي کوئي سنا
مسکن آبائے انساں جب بنا دامن ترا
کچھ بتا اس سيدھي سادي زندگي کا ماجرا
داغ جس پر غازئہ رنگ تکلف کا نہ تھا
ہاں دکھا دے اے تصور پھر وہ صبح و شام تو
دوڑ پيچھے کي طرف اے گردش ايام تو
تو شناسائے خراش عقدئہ مشکل نہيں
اے گل رنگيں ترے پہلو ميں شايد دل نہيں
زيب محفل ہے ، شريک شورش محفل نہيں
يہ فراغت بزم ہستي ميں مجھے حاصل نہيں
اس چمن ميں ميں سراپا سوز و ساز آرزو
اور تيري زندگاني بے گداز آرزو
توڑ لينا شاخ سے تجھ کو مرا آئيں نہيں
يہ نظر غير از نگاہ چشم صورت بيں نہيں
آہ! يہ دست جفاجو اے گل رنگيں نہيں
کس طرح تجھ کو يہ سمجھائوں کہ ميں گلچيں نہيں
کام مجھ کو ديدئہ حکمت کے الجھيڑوں سے کيا
ديدئہ بلبل سے ميں کرتا ہوں نظارہ ترا
سو زبانوں پر بھي خاموشي تجھے منظور ہے
راز وہ کيا ہے ترے سينے ميں جو مستور ہے
ميري صورت تو بھي اک برگ رياض طور ہے
ميں چمن سے دور ہوں تو بھي چمن سے دور ہے
مطمئن ہے تو ، پريشاں مثل بو رہتا ہوں ميں
زخمي شمشير ذوق جستجو رہتا ہوں ميں
يہ پريشاني مري سامان جمعيت نہ ہو
يہ جگر سوزي چراغ خانہ حکمت نہ ہو
ناتواني ہي مري سرمايہ قوت نہ ہو
رشک جام جم مرا آ ينہ حيرت نہ ہو
يہ تلاش متصل شمع جہاں افروز ہے
توسن ادراک انساں کو خرام آموز ہے
تھے ديار نو زمين و آسماں ميرے ليے
وسعت آغوش مادر اک جہاں ميرے ليے
تھي ہر اک جنبش نشان لطف جاں ميرے ليے
حرف بے مطلب تھي خود ميري زباں ميرے ليے
درد ، طفلي ميں اگر کوئي رلاتا تھا مجھے
شورش زنجير در ميں لطف آتا تھا مجھے
تکتے رہنا ہائے! وہ پہروں تلک سوئے قمر
وہ پھٹے بادل ميں بے آواز پا اس کا سفر
پوچھنا رہ رہ کے اس کے کوہ و صحرا کي خبر
اور وہ حيرت دروغ مصلحت آميز پر
آنکھ وقف ديد تھي ، لب مائل گفتار تھا
دل نہ تھا ميرا ، سراپا ذوق استفسار تھا
فکر انساں پر تري ہستي سے يہ روشن ہوا
ہے پر مرغ تخيل کي رسائي تا کجا
تھا سراپا روح تو ، بزم سخن پيکر ترا
زيب محفل بھي رہا محفل سے پنہاں بھي رہا
ديد تيري آنکھ کو اس حسن کي منظور ہے
بن کے سوز زندگي ہر شے ميں جو مستور ہے
محفل ہستي تري بربط سے ہے سرمايہ دار
جس طرح ندي کے نغموں سے سکوت کوہسار
تيرے فردوس تخيل سے ہے قدرت کي بہار
تيري کشت فکر سے اگتے ہيں عالم سبزہ وار
زندگي مضمر ہے تيري شوخي تحرير ميں
تاب گويائي سے جنبش ہے لب تصوير ميں
نطق کو سو ناز ہيں تيرے لب اعجاز پر
محو حيرت ہے ثريا رفعت پرواز پر
شاہد مضموں تصدق ہے ترے انداز پر
خندہ زن ہے غنچہ دلي گل شيراز پر
آہ! تو اجڑي ہوئي دلي ميں آراميدہ ہے
گلشن ويمر ميں تيرا ہم نوا خوابيدہ ہے
لطف گويائي ميں تيري ہمسري ممکن نہيں
ہو تخيل کا نہ جب تک فکر کامل ہم نشيں
ہائے! اب کيا ہو گئي ہندوستاں کي سر زميں
آہ! اے نظارہ آموز نگاہ نکتہ بيں
گيسوئے اردو ابھي منت پذير شانہ ہے
شمع يہ سودائي دل سوزي پروانہ ہے
اے جہان آباد ، اے گہوارہ علم و ہنر
ہيں سراپا نالہ خاموش تيرے بام و در
ذرے ذرے ميں ترے خوابيدہ ہيں شمں و قمر
يوں تو پوشيدہ ہيں تيري خاک ميں لاکھوں گہر
دفن تجھ ميں کوئي فخر روزگار ايسا بھي ہے؟
تجھ ميں پنہاں کوئي موتي آبدار ايسا بھي ہے؟
ہے بلندي سے فلک بوس نشيمن ميرا
ابر کہسار ہوں گل پاش ہے دامن ميرا
کبھي صحرا ، کبھي گلزار ہے مسکن ميرا
شہر و ويرانہ مرا ، بحر مرا ، بن ميرا
کسي وادي ميں جو منظور ہو سونا مجھ کو
سبزہ کوہ ہے مخمل کا بچھونا مجھ کو
مجھ کو قدرت نے سکھايا ہے درافشاں ہونا
ناقہ شاہد رحمت کا حدي خواں ہونا
غم زدائے دل افسردہ دہقاں ہونا
رونق بزم جوانان گلستاں ہونا
بن کے گيسو رخ ہستي پہ بکھر جاتا ہوں
شانہ موجہ صرصر سے سنور جاتا ہوں
دور سے ديدہ اميد کو ترساتا ہوں
کسي بستي سے جو خاموش گزر جاتا ہوں
سير کرتا ہوا جس دم لب جو آتا ہوں
بالياں نہر کو گرداب کي پہناتا ہوں
سبزہ مزرع نوخيز کي اميد ہوں ميں
زادہ بحر ہوں پروردہ خورشيد ہوں ميں
چشمہ کوہ کو دي شورش قلزم ميں نے
اور پرندوں کو کيا محو ترنم ميں نے
سر پہ سبزے کے کھڑے ہو کے کہا قم ميں نے
غنچہ گل کو ديا ذوق تبسم ميں نے
فيض سے ميرے نمونے ہيں شبستانوں کے
جھونپڑے دامن کہسار ميں دہقانوں کے
اک دن کسي مکھي سے يہ کہنے لگا مکڑا
اس راہ سے ہوتا ہے گزر روز تمھارا
ليکن مري کٹيا کي نہ جاگي کبھي قسمت
بھولے سے کبھي تم نے يہاں پائوں نہ رکھا
غيروں سے نہ مليے تو کوئي بات نہيں ہے
اپنوں سے مگر چاہيے يوں کھنچ کے نہ رہنا
آئو جو مرے گھر ميں تو عزت ہے يہ ميري
وہ سامنے سيڑھي ہے جو منظور ہو آنا
مکھي نے سني بات جو مکڑے کي تو بولي
حضرت! کسي نادان کو ديجے گا يہ دھوکا
اس جال ميں مکھي کبھي آنے کي نہيں ہے
جو آپ کي سيڑھي پہ چڑھا ، پھر نہيں اترا
مکڑے نے کہا واہ! فريبي مجھے سمجھے
تم سا کوئي نادان زمانے ميں نہ ہو گا
منظور تمھاري مجھے خاطر تھي وگرنہ
کچھ فائدہ اپنا تو مرا اس ميں نہيں تھا
اڑتي ہوئي آئي ہو خدا جانے کہاں سے
!ٹھہرو جو مرے گھر ميں تو ہے اس ميں برا کيا
اس گھر ميں کئي تم کو دکھانے کي ہيں چيزيں
باہر سے نظر آتا ہے چھوٹي سي يہ کٹيا
لٹکے ہوئے دروازوں پہ باريک ہيں پردے
ديواروں کو آئينوں سے ہے ميں نے سجايا
مہمانوں کے آرام کو حاضر ہيں بچھونے
ہر شخص کو ساماں يہ ميسر نہيں ہوتا
مکھي نے کہا خير ، يہ سب ٹھيک ہے ليکن
ميں آپ کے گھر آئوں ، يہ اميد نہ رکھنا
ان نرم بچھونوں سے خدا مجھ کو بچائے
سو جائے کوئي ان پہ تو پھر اٹھ نہيں سکتا
مکڑے نے کہا دل ميں سني بات جو اس کي
پھانسوں اسے کس طرح يہ کم بخت ہے دانا
سو کام خوشامد سے نکلتے ہيں جہاں ميں
ديکھو جسے دنيا ميں خوشامد کا ہے بندا
!يہ سوچ کے مکھي سے کہا اس نے بڑي بي
اللہ نے بخشا ہے بڑا آپ کو رتبا
ہوتي ہے اسے آپ کي صورت سے محبت
ہو جس نے کبھي ايک نظر آپ کو ديکھا
آنکھيں ہيں کہ ہيرے کي چمکتي ہوئي کنياں
سر آپ کا اللہ نے کلغي سے سجايا
يہ حسن ، يہ پوشاک ، يہ خوبي ، يہ صفائي
پھر اس پہ قيامت ہے يہ اڑتے ہوئے گانا
مکھي نے سني جب يہ خوشامد تو پسيجي
بولي کہ نہيں آپ سے مجھ کو کوئي کھٹکا
انکار کي عادت کو سمجھتي ہوں برا ميں
سچ يہ ہے کہ دل توڑنا اچھا نہيں ہوتا
يہ بات کہي اور اڑي اپني جگہ سے
پاس آئي تو مکڑے نے اچھل کر اسے پکڑا
بھوکا تھا کئي روز سے اب ہاتھ جو آئي
آرام سے گھر بيٹھ کے مکھي کو اڑايا
کوئي پہاڑ يہ کہتا تھا اک گلہري سے
تجھے ہو شرم تو پاني ميں جا کے ڈوب مرے
ذرا سي چيز ہے ، اس پر غرور ، کيا کہنا
!يہ عقل اور يہ سمجھ ، يہ شعور ، کيا کہنا
خدا کي شان ہے ناچيز چيز بن بيٹھيں
جو بے شعور ہوں يوں باتميز بن بيٹھيں
تري بساط ہے کيا ميري شان کے آگے
زميں ہے پست مري آن بان کے آگے
جو بات مجھ ميں ہے ، تجھ کو وہ ہے نصيب کہاں
!بھلا پہاڑ کہاں جانور غريب کہاں
کہا يہ سن کے گلہري نے ، منہ سنبھال ذرا
يہ کچي باتيں ہيں دل سے انھيں نکال ذرا
جو ميں بڑي نہيں تيري طرح تو کيا پروا
نہيں ہے تو بھي تو آخر مري طرح چھوٹا
ہر ايک چيز سے پيدا خدا کي قدرت ہے
کوئي بڑا ، کوئي چھوٹا ، يہ اس کي حکمت ہے
بڑا جہان ميں تجھ کو بنا ديا اس نے
مجھے درخت پہ چڑھنا سکھا ديا اس نے
قدم اٹھانے کي طاقت نہيں ذرا تجھ ميں
نري بڑائي ہے ، خوبي ہے اور کيا تجھ ميں
جو تو بڑا ہے تو مجھ سا ہنر دکھا مجھ کو
يہ چھاليا ہي ذرا توڑ کر دکھا مجھ کو
نہيں ہے چيز نکمي کوئي زمانے ميں
کوئي برا نہيں قدرت کے کارخانے ميں
اک چراگہ ہري بھري تھي کہيں
تھي سراپا بہار جس کي زميں
کيا سماں اس بہار کا ہو بياں
ہر طرف صاف ندياں تھيں رواں
تھے اناروں کے بے شمار درخت
اور پيپل کے سايہ دار درخت
ٹھنڈي ٹھنڈي ہوائيں آتي تھيں
طائروں کي صدائيں آتي تھيں
کسي ندي کے پاس اک بکري
چرتے چرتے کہيں سے آ نکلي
جب ٹھہر کر ادھر ادھر ديکھا
پاس اک گائے کو کھڑے پايا
پہلے جھک کر اسے سلام کيا
پھر سليقے سے يوں کلام کيا
کيوں بڑي بي! مزاج کيسے ہيں
گائے بولي کہ خير اچھے ہيں
کٹ رہي ہے بري بھلي اپني
ہے مصيبت ميں زندگي اپني
جان پر آ بني ہے ، کيا کہيے
اپني قسمت بري ہے ، کيا کہيے
ديکھتي ہوں خدا کي شان کو ميں
رو رہي ہوں بروں کي جان کو ميں
زور چلتا نہيں غريبوں کا
پيش آيا لکھا نصيبوں کا
آدمي سے کوئي بھلا نہ کرے
اس سے پالا پڑے ، خدا نہ کرے
دودھ کم دوں تو بڑبڑاتا ہے
ہوں جو دبلي تو بيچ کھاتا ہے
ہتھکنڈوں سے غلام کرتا ہے
کن فريبوں سے رام کرتا ہے
اس کے بچوں کو پالتي ہوں ميں
دودھ سے جان ڈالتي ہوں ميں
بدلے نيکي کے يہ برائي ہے
ميرے اللہ! تري دہائي ہے
سن کے بکري يہ ماجرا سارا
بولي ، ايسا گلہ نہيں اچھا
بات سچي ہے بے مزا لگتي
ميں کہوں گي مگر خدا لگتي
يہ چراگہ ، يہ ٹھنڈي ٹھنڈي ہوا
يہ ہري گھاس اور يہ سايا
ايسي خوشياں ہميں نصيب کہاں
!يہ کہاں ، بے زباں غريب کہاں
يہ مزے آدمي کے دم سے ہيں
لطف سارے اسي کے دم سے ہيں
اس کے دم سے ہے اپني آبادي
!قيد ہم کو بھلي ، کہ آزادي
سو طرح کا بنوں ميں ہے کھٹکا
واں کي گزران سے بچائے خدا
ہم پہ احسان ہے بڑا اس کا
ہم کو زيبا نہيں گلا اس کا
قدر آرام کي اگر سمجھو
آدمي کا کبھي گلہ نہ کرو
گائے سن کر يہ بات شرمائي
آدمي کے گلے سے پچھتائي
دل ميں پرکھا بھلا برا اس نے
اور کچھ سوچ کر کہا اس نے
يوں تو چھوٹي ہے ذات بکري کي
دل کو لگتي ہے بات بکري کي
لب پہ آتي ہے دعا بن کے تمنا ميري
زندگي شمع کي صورت ہو خدايا ميري
دور دنيا کا مرے دم سے اندھيرا ہو جائے
ہر جگہ ميرے چمکنے سے اجالا ہو جائے
ہو مرے دم سے يونہي ميرے وطن کي زينت
جس طرح پھول سے ہوتي ہے چمن کي زينت
زندگي ہو مري پروانے کي صورت يا رب
علم کي شمع سے ہو مجھ کو محبت يا رب
ہو مرا کام غريبوں کي حمايت کرنا
دردمندوں سے ضعيفوں سے محبت کرنا
مرے اللہ! برائي سے بچانا مجھ کو
نيک جو راہ ہو اس رہ پہ چلانا مجھ کو
ٹہني پہ کسي شجر کي تنہا
بلبل تھا کوئي اداس بيٹھا
کہتا تھا کہ رات سر پہ آئي
اڑنے چگنے ميں دن گزارا
پہنچوں کس طرح آشياں تک
ہر چيز پہ چھا گيا اندھيرا
سن کر بلبل کي آہ و زاري
جگنو کوئي پاس ہي سے بولا
حاضر ہوں مدد کو جان و دل سے
کيڑا ہوں اگرچہ ميں ذرا سا
کيا غم ہے جو رات ہے اندھيري
ميں راہ ميں روشني کروں گا
اللہ نے دي ہے مجھ کو مشعل
چمکا کے مجھے ديا بنايا
ہيں لوگ وہي جہاں ميں اچھے
آتے ہيں جو کام دوسرں کے
ميں سوئي جو اک شب تو ديکھا يہ خواب
بڑھا اور جس سے مرا اضطراب
يہ ديکھا کہ ميں جا رہي ہوں کہيں
اندھيرا ہے اور راہ ملتي نہيں
لرزتا تھا ڈر سے مرا بال بال
قدم کا تھا دہشت سے اٹھنا محال
جو کچھ حوصلہ پا کے آگے بڑھي
تو ديکھا قطار ايک لڑکوں کي تھي
زمرد سي پوشاک پہنے ہوئے
ديے سب کے ہاتھوں ميں جلتے ہوئے
وہ چپ چاپ تھے آگے پيچھے رواں
خدا جانے جانا تھا ان کو کہاں
اسي سوچ ميں تھي کہ ميرا پسر
مجھے اس جماعت ميں آيا نظر
وہ پيچھے تھا اور تيز چلتا نہ تھا
ديا اس کے ہاتھوں ميں جلتا نہ تھا
!کہا ميں نے پہچان کر ، ميري جاں
!مجھے چھوڑ کر آ گئے تم کہاں
جدائي ميں رہتي ہوں ميں بے قرار
پروتي ہوں ہر روز اشکوں کے ہار
نہ پروا ہماري ذرا تم نے کي
گئے چھوڑ ، اچھي وفا تم نے کي
جو بچے نے ديکھا مرا پيچ و تاب
ديا اس نے منہ پھير کر يوں جواب
رلاتي ہے تجھ کو جدائي مري
نہيں اس ميں کچھ بھي بھلائي مري
يہ کہہ کر وہ کچھ دير تک چپ رہا
ديا پھر دکھا کر يہ کہنے لگا
سمجھتي ہے تو ہو گيا کيا اسے؟
ترے آنسوئوں نے بجھايا اسے
آتا ہے ياد مجھ کو گزرا ہوا زمانا
وہ باغ کي بہاريں وہ سب کا چہچہانا
آزادياں کہاں وہ اب اپنے گھونسلے کي
اپني خوشي سے آنا اپني خوشي سے جانا
لگتي ہے چوٹ دل پر ، آتا ہے ياد جس دم
شبنم کے آنسوئوں پر کليوں کا مسکرانا
وہ پياري پياري صورت ، وہ کامني سي مورت
آباد جس کے دم سے تھا ميرا آشيانا
آتي نہيں صدائيں اس کي مرے قفس ميں
!ہوتي مري رہائي اے کاش ميرے بس ميں
کيا بد نصيب ہوں ميں گھر کو ترس رہا ہوں
ساتھي تو ہيں وطن ميں ، ميں قيد ميں پڑا ہوں
آئي بہار کلياں پھولوں کي ہنس رہي ہيں
ميں اس اندھيرے گھر ميں قسمت کو رو رہا ہوں
اس قيد کا الہي! دکھڑا کسے سنائوں
ڈر ہے يہيں قفسں ميں ميں غم سے مر نہ جائوں
جب سے چمن چھٹا ہے ، يہ حال ہو گيا ہے
دل غم کو کھا رہا ہے ، غم دل کو کھا رہا ہے
گانا اسے سمجھ کر خوش ہوں نہ سننے والے
دکھے ہوئے دلوں کي فرياد يہ صدا ہے
!آزاد مجھ کو کر دے ، او قيد کرنے والے
ميں بے زباں ہوں قيدي ، تو چھوڑ کر دعا لے
مہر روشن چھپ گيا ، اٹھي نقاب روئے شام
شانہ ہستي پہ ہے بکھرا ہوا گيسوئے شام
يہ سيہ پوشي کي تياري کس کے غم ميں ہے
محفل قدرت مگر خورشيد کے ماتم ميں ہے
کر رہا ہے آسماں جادو لب گفتار پر
ساحر شب کي نظر ہے ديدہ بيدار پر
غوطہ زن درياے خاموشي ميں ہے موج ہوا
ہاں ، مگر اک دور سے آتي ہے آواز درا
دل کہ ہے بے تابي الفت ميں دنيا سے نفور
کھنچ لايا ہے مجھے ہنگامہ عالم سے دور
منظر حرماں نصيبي کا تماشائي ہوں ميں
ہم نشين خفتگان کنج تنہائي ہوں ميں
تھم ذرا بے تابي دل! بيٹھ جانے دے مجھے
اور اس بستي پہ چار آ نسو گرانے دے مجھے
اے مے غفلت کے سر مستو ، کہاں رہتے ہو تم
کچھ کہو اس ديس کي آ خر ، جہاں رہتے ہو تم
وہ بھي حيرت خانہ امروز و فردا ہے کوئي؟
اور پيکار عناصر کا تماشا ہے کوئي؟
آدمي واں بھي حصار غم ميں ہے محصور کيا؟
اس ولا يت ميں بھي ہے انساں کا دل مجبور کيا؟
واں بھي جل مرتا ہے سوز شمع پر پروانہ کيا؟
اس چمن ميں بھي گل و بلبل کا ہے افسانہ کيا؟
ياں تو اک مصرع ميں پہلو سے نکل جاتا ہے دل
شعر کي گر مي سے کيا واں بھي پگل جاتاہے دل؟
رشتہ و پيوند ياں کے جان کا آزار ہيں
اس گلستاں ميں بھي کيا ايسے نکيلے خار ہيں؟
اس جہاں ميں اک معيشت اور سو افتاد ہے
روح کيا اس ديس ميں اس فکر سے آزاد ہے؟
کيا وہاں بجلي بھي ہے ، دہقاں بھي ہے ، خرمن بھي ہے؟
قافلے والے بھي ہيں ، انديشہ رہزن بھي ہے؟
تنکے چنتے ہيں و ہاں بھي آ شياں کے واسطے؟
خشت و گل کي فکر ہوتي ہے مکاں کے واسطے؟
واں بھي انساں اپني اصليت سے بيگانے ہيں کيا؟
امتياز ملت و آئيں کے ديوانے ہيں کيا؟
واں بھي کيا فرياد بلبل پر چمن روتا نہيں؟
اس جہاں کي طرح واں بھي درد دل ہوتا نہيں؟
باغ ہے فردوس يا اک منزل آرام ہے؟
يا رخ بے پردہ حسن ازل کا نام ہے؟
کيا جہنم معصيت سوزي کي اک ترکيب ہے؟
آگ کے شعلوں ميں پنہاں مقصد تاويب ہے؟
کيا عوض رفتار کے اس ديس ميں پرواز ہے؟
موت کہتے ہيں جسے اہل زميں ، کيا راز ہے ؟
اضطراب دل کا ساماں ياں کي ہست و بود ہے
علم انساں اس ولايت ميں بھي کيا محدود ہے؟
ديد سے تسکين پاتا ہے دل مہجور بھي؟
'لن تراني' کہہ رہے ہيں يا وہاں کے طور بھي؟
جستجو ميں ہے وہاں بھي روح کو آرام کيا؟
واں بھي انساں ہے قتيل ذوق استفہام کيا؟
آہ! وہ کشور بھي تاريکي سے کيا معمور ہے؟
يا محبت کي تجلي سے سراپا نور ہے؟
تم بتا دو راز جو اس گنبد گرداں ميں ہے
موت اک چبھتا ہوا کانٹا دل انساں ميں ہے
پروانہ تجھ سے کرتا ہے اے شمع پيار کيوں
يہ جان بے قرار ہے تجھ پر نثار کيوں
سيماب وار رکھتي ہے تيري ادا اسے
آداب عشق تو نے سکھائے ہيں کيا اسے؟
کرتا ہے يہ طواف تري جلوہ گاہ کا
پھونکا ہوا ہے کيا تري برق نگاہ کا؟
آزار موت ميں اسے آرام جاں ہے کيا؟
شعلے ميں تيرے زندگي جاوداں ہے کيا؟
غم خانہ جہاں ميں جو تيري ضيا نہ ہو
اس تفتہ دل کا نخل تمنا ہرا نہ ہو
گرنا ترے حضور ميں اس کي نماز ہے
ننھے سے دل ميں لذت سوز و گداز ہے
کچھ اس ميں جوش عاشق حسن قديم ہے
چھوٹا سا طور تو يہ ذرا سا کليم ہے
پروانہ ، اور ذوق تماشائے روشني
!کيڑا ذرا سا ، اور تمنائے روشني
عقل نے ايک دن يہ دل سے کہا
بھولے بھٹکے کي رہنما ہوں ميں
ہوں زميں پر ، گزر فلک پہ مرا
ديکھ تو کس قدر رسا ہوں ميں
کام دنيا ميں رہبري ہے مرا
مثل خضر خجستہ پا ہوں ميں
ہوں مفسر کتاب ہستي کي
مظہر شان کبريا ہوں ميں
بوند اک خون کي ہے تو ليکن
غيرت لعل بے بہا ہوں ميں
دل نے سن کر کہا يہ سب سچ ہے
پر مجھے بھي تو ديکھ ، کيا ہوں ميں
راز ہستي کو تو سمجھتي ہے
اور آنکھوں سے ديکھتا ہوں ميں
ہے تجھے واسطہ مظاہر سے
اور باطن سے آشنا ہوں ميں
علم تجھ سے تو معرفت مجھ سے
تو خدا جو ، خدا نما ہوں ميں
علم کي انتہا ہے بے تابي
اس مرض کي مگر دوا ہوں ميں
شمع تو محفل صداقت کي
حسن کي بزم کا ديا ہوں ميں
تو زمان و مکاں سے رشتہ بپا
طائر سدرہ آشنا ہوں ميں
کس بلندي پہ ہے مقام مرا
!عرش رب جليل کا ہوں ميں
جل رہا ہوں کل نہيں پڑتي کسي پہلو مجھے
ہاں ڈبو دے اے محيط آب گنگا تو مجھے
سرزميں اپني قيامت کي نفاق انگيز ہے
وصل کيسا ، ياں تو اک قرب فراق انگيز ہے
بدلے يک رنگي کے يہ نا آشنائي ہے غضب
ايک ہي خرمن کے دانوں ميں جدائي ہے غضب
جس کے پھولوں ميں اخوت کي ہوا آئي نہيں
اس چمن ميں کوئي لطف نغمہ پيرائي نہيں
لذت قرب حقيقي پر مٹا جاتا ہوں ميں
اختلاط موجہ و ساحل سے گھبراتا ہوں ميں
دانہ خرمن نما ہے شاعر معجز بياں
ہو نہ خرمن ہي تو اس دانے کي ہستي پھر کہاں
حسن ہو کيا خود نما جب کوئي مائل ہي نہ ہو
شمع کو جلنے سے کيا مطلب جو محفل ہي نہ ہو
ذوق گويائي خموشي سے بدلتا کيوں نہيں
ميرے آئينے سے يہ جوہر نکلتا کيوں نہيں
!کب زباں کھولي ہماري لذت گفتار نے
پھونک ڈالا جب چمن کو آتش پيکار نے
اے آفتاب! روح و روان جہاں ہے تو
شيرازہ بند دفتر کون و مکاں ہے تو
باعث ہے تو وجود و عدم کي نمود کا
ہے سبز تيرے دم سے چمن ہست و بود کا
قائم يہ عنصروں کا تماشا تجھي سے ہے
ہر شے ميں زندگي کا تقاضا تجھي سے ہے ہر
شے کو تيري جلوہ گري سے ثبات ہے
تيرا يہ سوز و ساز سراپا حيات ہے
وہ آفتاب جس سے زمانے ميں نور ہے
دل ہے ، خرد ہے ، روح رواں ہے ، شعور ہے
اے آفتاب ، ہم کو ضيائے شعور دے
چشم خرد کو اپني تجلي سے نور دے
ہے محفل وجود کا ساماں طراز تو
يزدان ساکنان نشيب و فراز تو
تيرا کمال ہستي ہر جاندار ميں
تيري نمود سلسلہ کوہسار ميں
ہر چيز کي حيات کا پروردگار تو
زائيدگان نور کا ہے تاجدار تو
نے ابتدا کوئي نہ کوئي انتہا تري
آزاد قيد اول و آخر ضيا تري
بزم جہاں ميں ميں بھي ہوں اے شمع! دردمند
فرياد در گرہ صفت دانہ سپند
دي عشق نے حرارت سوز دروں تجھے
اور گل فروش اشک شفق گوں کيا مجھے
ہو شمع بزم عيش کہ شمع مزار تو
ہر حال اشک غم سے رہي ہمکنار تو
يک بيں تري نظر صفت عاشقان راز
ميري نگاہ مايہ آشوب امتياز
کعبے ميں ، بت کدے ميں ہے يکساں تري ضيا
ميں امتياز دير و حرم ميں پھنسا ہوا
ہے شان آہ کي ترے دود سياہ ميں
پوشيدہ کوئي دل ہے تري جلوہ گاہ ميں؟
جلتي ہے تو کہ برق تجلي سے دور ہے
بے درد تيرے سوز کو سمجھے کہ نور ہے
تو جل رہي ہے اور تجھے کچھ خبر نہيں
بينا ہے اور سوز دروں پر نظر نہيں
ميں جوش اضطراب سے سيماب وار بھي
آگاہ اضطراب دل بے قرار بھي
تھا يہ بھي کوئي ناز کسي بے نياز کا
احساس دے ديا مجھے اپنے گداز کا
يہ آگہي مري مجھے رکھتي ہے بے قرار
خوابيدہ اس شرر ميں ہيں آتش کدے ہزار
يہ امتياز رفعت و پستي اسي سے ہے
گل ميں مہک ، شراب ميں مستي اسي سے ہے
بستان و بلبل و گل و بو ہے يہ آگہي
اصل کشاکش من و تو ہے يہ آگہي
صبح ازل جو حسن ہوا دلستان عشق
آواز 'کن' ہوئي تپش آموز جان عشق
يہ حکم تھا کہ گلشن 'کن' کي بہار ديکھ
ايک آنکھ لے کے خواب پريشاں ہزار ديکھ
مجھ سے خبر نہ پوچھ حجاب وجود کي
شام فراق صبح تھي ميري نمود کي
وہ دن گئے کہ قيد سے ميں آشنا نہ تھا
زيب درخت طور مرا آشيانہ تھا
قيدي ہوں اور قفس کو چمن جانتا ہوں ميں
غربت کے غم کدے کو وطن جانتا ہوں ميں
ياد دطن فسردگي بے سبب بني
شوق نظر کبھي ، کبھي ذوق طلب بني
اے شمع! انتہائے فريب خيال ديکھ
مسجود ساکنان فلک کا مآل ديکھ
مضموں فراق کا ہوں ، ثريا نشاں ہوں ميں
آہنگ طبع ناظم کون و مکاں ہوں ميں
باندھا مجھے جو اس نے تو چاہي مري نمود
تحرير کر ديا سر ديوان ہست و بود
گوہر کو مشت خاک ميں رہنا پسند ہے
بندش اگرچہ سست ہے ، مضموں بلند ہے
چشم غلط نگر کا يہ سارا قصور ہے
عالم ظہور جلوہ ذوق شعور ہے
يہ سلسلہ زمان و مکاں کا ، کمند ہے
طوق گلوئے حسن تماشا پسند ہے
منزل کا اشتياق ہے ، گم کردہ راہ ہوں
اے شمع ! ميں اسير فريب نگاہ ہوں
صياد آپ ، حلقہ دام ستم بھي آپ
!بام حرم بھي ، طائر بام حرم بھي آپ
ميں حسن ہوں کہ عشق سراپا گداز ہوں
کھلتا نہيں کہ ناز ہوں ميں يا نياز ہوں
ہاں ، آشنائے لب ہو نہ راز کہن کہيں
پھر چھڑ نہ جائے قصہ دار و رسن کہيں
دنيا کي محفلوں سے اکتا گيا ہوں يا رب
کيا لطف انجمن کا جب دل ہي بجھ گيا ہو
شورش سے بھاگتا ہوں ، دل ڈھونڈتا ہے ميرا
ايسا سکوت جس پر تقرير بھي فدا ہو
مرتا ہوں خامشي پر ، يہ آرزو ہے ميري
دامن ميں کوہ کے اک چھوٹا سا جھونپڑا ہو
آزاد فکر سے ہوں ، عزلت ميں دن گزاروں
دنيا کے غم کا دل سے کانٹا نکل گيا ہو
لذت سرود کي ہو چڑيوں کے چہچہوں ميں
چشمے کي شورشوں ميں باجا سا بج رہا ہو
گل کي کلي چٹک کر پيغام دے کسي کا
ساغر ذرا سا گويا مجھ کو جہاں نما ہو
ہو ہاتھ کا سرھانا سبزے کا ہو بچھونا
شرمائے جس سے جلوت ، خلوت ميں وہ ادا ہو
مانوس اس قدر ہو صورت سے ميري بلبل
ننھے سے دل ميں اس کے کھٹکا نہ کچھ مرا ہو
صف باندھے دونوں جانب بوٹے ہرے ہرے ہوں
ندي کا صاف پاني تصوير لے رہا ہو
ہو دل فريب ايسا کہسار کا نظارہ
پاني بھي موج بن کر اٹھ اٹھ کے ديکھتا ہو
آغوش ميں زميں کي سويا ہوا ہو سبزہ
پھر پھر کے جھاڑيوں ميں پاني چمک رہا ہو
پاني کو چھو رہي ہو جھک جھک کے گل کي ٹہني
جيسے حسين کوئي آئينہ ديکھتا ہو
مہندي لگائے سورج جب شام کي دلھن کو
سرخي ليے سنہري ہر پھول کي قبا ہو
راتوں کو چلنے والے رہ جائيں تھک کے جس دم
اميد ان کي ميرا ٹوٹا ہوا ديا ہو
بجلي چمک کے ان کو کٹيا مري دکھا دے
جب آسماں پہ ہر سو بادل گھرا ہوا ہو
پچھلے پہر کي کوئل ، وہ صبح کي مؤذن
ميں اس کا ہم نوا ہوں ، وہ ميري ہم نوا ہو
کانوں پہ ہو نہ ميرے دير وحرم کا احساں
روزن ہي جھونپڑي کا مجھ کو سحر نما ہو
پھولوں کو آئے جس دم شبنم وضو کرانے
رونا مرا وضو ہو ، نالہ مري دعا ہو
اس خامشي ميں جائيں اتنے بلند نالے
تاروں کے قافلے کو ميري صدا درا ہو
ہر دردمند دل کو رونا مرا رلا دے
بے ہوش جو پڑے ہيں ، شايد انھيں جگا دے
شورش ميخانہ انساں سے بالاتر ہے تو
زينت بزم فلک ہو جس سے وہ ساغر ہے تو
ہو در گوش عروس صبح وہ گوہر ہے تو
جس پہ سيمائے افق نازاں ہو وہ زيور ہے تو
صفحہ ايام سے داغ مداد شب مٹا
آسماں سے نقش باطل کي طرح کوکب مٹا
حسن تيرا جب ہوا بام فلک سے جلوہ گر
آنکھ سے اڑتا ہے يک دم خواب کي مے کا اثر
نور سے معمور ہو جاتا ہے دامان نظر
کھولتي ہے چشم ظاہر کو ضيا تيري مگر
ڈھونڈتي ہيں جس کو آنکھيں وہ تماشا چاہيے
چشم باطن جس سے کھل جائے وہ جلوا چاہيے
شوق آزادي کے دنيا ميں نہ نکلے حوصلے
زندگي بھر قيد زنجير تعلق ميں رہے
زير و بالا ايک ہيں تيري نگاہوں کے ليے
آرزو ہے کچھ اسي چشم تماشا کي مجھے
آنکھ ميري اور کے غم ميں سرشک آباد ہو
امتياز ملت و آئيں سے دل آزاد ہو
بستہ رنگ خصوصيت نہ ہو ميري زباں
نوع انساں قوم ہو ميري ، وطن ميرا جہاں
ديدہ باطن پہ راز نظم قدرت ہو عياں
ہو شناسائے فلک شمع تخيل کا دھواں
عقدہ اضداد کي کاوش نہ تڑپائے مجھے
حسن عشق انگيز ہر شے ميں نظر آئے مجھے
صدمہ آ جائے ہوا سے گل کي پتي کو اگر
اشک بن کر ميري آنکھوں سے ٹپک جائے اثر
دل ميں ہو سوز محبت کا وہ چھوٹا سا شرر
نور سے جس کے ملے راز حقيقت کي خبر
شاہد قدرت کا آئينہ ہو ، دل ميرا نہ ہو
سر ميں جز ہمدردي انساں کوئي سودا نہ ہو
تو اگر زحمت کش ہنگامہ عالم نہيں
يہ فضيلت کا نشاں اے نير اعظم نہيں
اپنے حسن عالم آرا سے جو تو محرم نہيں
ہمسر يک ذرہ خاک در آدم نہيں
نور مسجود ملک گرم تماشا ہي رہا
اور تو منت پذير صبح فردا ہي رہا
آرزو نور حقيقت کي ہمارے دل ميں ہے
ليلي ذوق طلب کا گھر اسي محمل ميں ہے
کس قدر لذت کشود عقدہ مشکل ميں ہے
لطف صد حاصل ہماري سعي بے حاصل ميں ہے
درد استفہام سے واقف ترا پہلو نہيں
جستجوئے راز قدرت کا شناسا تو نہيں
اے درد عشق! ہے گہر آب دار تو
نامحرموں ميں ديکھ نہ ہو آشکار تو
پنہاں تہ نقاب تري جلوہ گاہ ہے
ظاہر پرست محفل نو کي نگاہ ہے
آئي نئي ہوا چمن ہست و بود ميں
اے درد عشق! اب نہيں لذت نمود ميں
ہاں خود نمائيوں کي تجھے جستجو نہ ہو
!منت پذير نالہء بلبل کا تو نہ ہو
خالي شراب عشق سے لالے کا جام ہو
پاني کي بوند گريہء شبنم کا نام ہو
پنہاں درون سينہ کہيں راز ہو ترا
اشک جگر گداز نہ غماز ہو ترا
گويا زبان شاعر رنگيں بياں نہ ہو
آواز نے ميں شکوہ فرقت نہاں نہ ہو
يہ دور نکتہ چيں ہے ، کہيں چھپ کے بيٹھ رہ
جس دل ميں تو مکيں ہے، وہيں چھپ کے بيٹھ رہ
!غافل ہے تجھ سے حيرت علم آفريدہ ديکھ
جويا نہيں تري نگہ نارسيدہ ديکھ
رہنے دے جستجو ميں خيال بلند کو
حيرت ميں چھوڑ ديدہء حکمت پسند کو
جس کي بہار تو ہو يہ ايسا چمن نہيں
قابل تري نمود کے يہ انجمن نہيں
يہ انجمن ہے کشتہء نظارہء مجاز
مقصد تري نگاہ کا خلوت سرائے راز
ہر دل مے خيال کي مستي سے چور ہے
کچھ اور آجکل کے کليموں کا طور ہے
کس زباں سے اے گل پژمردہ تجھ کو گل کہوں
کس طرح تجھ کو تمنائے دل بلبل کہوں
تھي کبھي موج صبا گہوارہء جنباں ترا
نام تھا صحن گلستاں ميں گل خنداں ترا
تيرے احساں کا نسيم صبح کو اقرار تھا
باغ تيرے دم سے گويا طبلہء عطار تھا
تجھ پہ برساتا ہے شبنم ديدہء گرياں مرا
ہے نہاں تيري اداسي ميں دل ويراں مرا
ميري بربادي کي ہے چھوٹي سي اک تصوير تو
خوا ب ميري زندگي تھي جس کي ہے تعبير تو
ہمچو نے از نيستان خود حکايت مي کنم
بشنو اے گل! از جدائي ہا شکايت مي کنم
اے کہ تيرا مرغ جاں تار نفس ميں ہے اسير
اے کہ تيري روح کا طائر قفس ميں ہے اسير
اس چمن کے نغمہ پيرائوں کي آزادي تو ديکھ
شہر جو اجڑا ہوا تھا اس کي آبادي تو ديکھ
فکر رہتي تھي مجھے جس کي وہ محفل ہے يہي
صبر و استقلال کي کھيتي کا حاصل ہے يہي
سنگ تربت ہے مرا گرويدہ تقرير ديکھ
چشم باطن سے ذرا اس لوح کي تحرير ديکھ
مدعا تيرا اگر دنيا ميں ہے تعليم ديں
ترک دنيا قوم کو اپني نہ سکھلانا کہيں
وا نہ کرنا فرقہ بندي کے ليے اپني زباں
چھپ کے ہے بيٹھا ہوا ہنگامہ محشر يہاں
وصل کے اسباب پيدا ہوں تري تحرير سے
ديکھ کوئي دل نہ دکھ جائے تري تقرير سے
محفل نو ميں پراني داستانوں کو نہ چھيڑ
رنگ پر جو اب نہ آئيں ان فسانوں کو نہ چھيڑ
تو اگر کوئي مدبر ہے تو سن ميري صدا
ہے دليري دست ارباب سياست کا عصا
عرض مطلب سے جھجک جانا نہيں زيبا تجھے
نيک ہے نيت اگر تيري تو کيا پروا تجھے
بندہ مومن کا دل بيم و ريا سے پاک ہے
قوت فرماں روا کے سامنے بے باک ہے
ہو اگر ہاتھوں ميں تيرے خامہء معجز رقم
شيشہ دل ہو اگر تيرا مثال جام جم
پاک رکھ اپني زباں ، تلميذ رحماني ہے تو
!ہو نہ جائے ديکھنا تيري صدا بے آبرو
سونے والوں کو جگا دے شعر کے اعجاز سے
خرمن باطل جلا دے شعلہ آواز سے
ٹوٹ کر خورشيد کي کشتي ہوئي غرقاب نيل
ايک ٹکڑا تيرتا پھرتا ہے روئے آب نيل
طشت گردوں ميں ٹپکتا ہے شفق کا خون ناب
نشتر قدرت نے کيا کھولي ہے فصد آفتاب
چرخ نے بالي چرا لي ہے عروس شام کي
نيل کے پاني ميں يا مچھلي ہے سيم خام کي
قافلہ تيرا رواں بے منت بانگ درا
گوش انساں سن نہيں سکتا تري آواز پا
گھٹنے بڑھنے کا سماں آنکھوں کو دکھلاتا ہے تو
ہے وطن تيرا کدھر ، کس ديس کو جاتا ہے تو
ساتھ اے سيارہء ثابت نما لے چل مجھے
خار حسرت کي خلش رکھتي ہے اب بے کل مجھے
نور کا طالب ہوں ، گھبراتا ہوں اس بستي ميں ميں
طفلک سيماب پا ہوں مکتب ہستي ميں ميں
صبح خورشيد درخشاں کو جو ديکھا ميں نے
بزم معمورہ ہستي سے يہ پوچھا ميں نے
پر تو مہر کے دم سے ہے اجالا تيرا
سيم سيال ہے پاني ترے دريائوں کا
مہر نے نور کا زيور تجھے پہنايا ہے
تيري محفل کو اسي شمع نے چمکايا ہے
گل و گلزار ترے خلد کي تصويريں ہيں
يہ سبھي سورہء 'والشمس' کي تفسيريں ہيں
سرخ پوشاک ہے پھولوں کي ، درختوں کي ہري
تيري محفل ميں کوئي سبز ، کوئي لال پري
ہے ترے خيمہء گردوں کي طلائي جھالر
بدلياں لال سي آتي ہيں افق پر جو نظر
کيا بھلي لگتي ہے آنکھوں کو شفق کي لالي
مے گلرنگ خم شام ميں تو نے ڈالي
رتبہ تيرا ہے بڑا ، شان بڑي ہے تيري
پردہ نور ميں مستور ہے ہر شے تيري
صبح اک گيت سراپا ہے تري سطوت کا
زير خورشيد نشاں تک بھي نہيں ظلمت کا
ميں بھي آباد ہوں اس نور کي بستي ميں مگر
جل گيا پھر مري تقدير کا اختر کيونکر؟
نور سے دور ہوں ظلمت ميں گرفتار ہوں ميں
کيوں سيہ روز ، سيہ بخت ، سيہ کار ہوں ميں؟
ميں يہ کہتا تھا کہ آواز کہيں سے آئي
بام گردوں سے وہ يا صحن زميں سے آئي
ہے ترے نور سے وابستہ مري بود و نبود
باغباں ہے تري ہستي پے گلزار وجود
انجمن حسن کي ہے تو ، تري تصوير ہوں ميں
عشق کا تو ہے صحيفہ ، تري تفسير ہوں ميں
ميرے بگڑے ہوئے کاموں کو بنايا تو نے
بار جو مجھ سے نہ اٹھا وہ اٹھايا تو نے
نور خورشيد کي محتاج ہے ہستي ميري
اور بے منت خورشيد چمک ہے تري
ہو نہ خورشيد تو ويراں ہو گلستاں ميرا
منزل عيش کي جا نام ہو زنداں ميرا
!آہ اے راز عياں کے نہ سمجھے والے
حلقہ ، دام تمنا ميں الجھنے والے
ہائے غفلت کہ تري آنکھ ہے پابند مجاز
ناز زيبا تھا تجھے ، تو ہے مگر گرم نياز
تو اگر اپني حقيقت سے خبردار رہے
نہ سيہ روز رہے پھر نہ سيہ کار رہے
اجالا جب ہوا رخصت جبين شب کي افشاں کا
نسيم زندگي پيغام لائي صبح خنداں کا
جگايا بلبل رنگيں نوا کو آشيانے ميں
کنارے کھيت کے شانہ ہلايا اس نے دہقاں کا
طلسم ظلمت شب سورہء والنور سے توڑا
اندھيرے ميں اڑايا تاج زر شمع شبستاں کا
پڑھا خوابيدگان دير پر افسون بيداري
برہمن کو ديا پيغام خورشيد درخشاں کا
ہوئي بام حرم پر آ کے يوں گويا مؤذن سے
نہيں کھٹکا ترے دل ميں نمود مہر تاباں کا؟
پکاري اس طرح ديوار گلشن پر کھڑے ہو کر
چٹک او غنچہ گل! تو مؤذن ہے گلستاں کا
!ديا يہ حکم صحرا ميں چلو اے قافلے والو
چمکنے کو ہے جگنو بن کے ہر ذرہ بياباں کا
سوئے گور غريباں جب گئي زندوں کي بستي سے
تو يوں بولي نظارا ديکھ کر شہر خموشاں کا
ابھي آرام سے ليٹے رہو ، ميں پھر بھي آئوں گي
سلادوں گي جہاں کو خواب سے تم کو جگائوں گي
سہاني نمود جہاں کي گھڑي تھي
تبسم فشاں زندگي کي کلي تھي
کہيں مہر کو تاج زر مل رہا تھا
عطا چاند کو چاندني ہو رہي تھي
سيہ پيرہن شام کو دے رہے تھے
ستاروں کو تعليم تابندگي تھي
کہيں شاخ ہستي کو لگتے تھے پتے
کہيں زندگي کي کلي پھوٹتي تھي
فرشتے سکھاتے تھے شبنم کو رونا
ہنسي گل کو پہلے پہل آ رہي تھي
عطا درد ہوتا تھا شاعر کے دل کو
خودي تشنہ کام مے بے خودي تھي
اٹھي اول اول گھٹا کالي کالي
کوئي حور چوٹي کو کھولے کھڑي تھي
زميں کو تھا دعوي کہ ميں آسماں ہوں
مکاں کہہ رہا تھا کہ ميں لا مکاں ہوں
غرض اس قدر يہ نظارہ تھا پيارا
کہ نظارگي ہو سراپا نظارا
ملک آزماتے تھے پرواز اپني
جبينوں سے نور ازل آشکارا
فرشتہ تھا اک ، عشق تھا نام جس کا
کہ تھي رہبري اس کي سب کا سہارا
فرشتہ کہ پتلا تھا بے تابيوں کا
ملک کا ملک اور پارے کا پارا
پے سير فردوس کو جا رہا تھا
قضا سے ملا راہ ميں وہ قضا را
يہ پوچھا ترا نام کيا ، کام کيا ہے
نہيں آنکھ کو ديد تيري گوارا
ہوا سن کے گويا قضا کا فرشتہ
اجل ہوں ، مرا کام ہے آشکارا
اڑاتي ہوں ميں رخت ہستي کے پرزے
بجھاتي ہوں ميں زندگي کا شرارا
مري آنکھ ميں جادوئے نيستي ہے
پيام فنا ہے اسي کا اشارا
مگر ايک ہستي ہے دنيا ميں ايسي
وہ آتش ہے ميں سامنے اس کے پارا
شرر بن کے رہتي ہے انساں کے دل ميں
وہ ہے نور مطلق کي آنکھوں کا تارا
ٹپکتي ہے آنکھوں سے بن بن کے آنسو
وہ آنسو کہ ہو جن کي تلخي گوارا
سني عشق نے گفتگو جب قضا کي
ہنسي اس کے لب پر ہوئي آشکارا
گري اس تبسم کي بجلي اجل پر
!اندھيرے کا ہو نور ميں کيا گزارا
بقا کو جو ديکھا فنا ہو گئي وہ
قضا تھي شکار قضا ہو گئي وہ
اک مولوي صاحب کي سناتا ہوں کہاني
تيزي نہيں منظور طبيعت کي دکھاني
شہرہ تھا بہت آپ کي صوفي منشي کا
کرتے تھے ادب ان کا اعالي و اداني
کہتے تھے کہ پنہاں ہے تصوف ميں شريعت
جس طرح کہ الفاظ ميں مضمر ہوں معاني
لبريز مےء زہد سے تھي دل کي صراحي
تھي تہ ميں کہيں درد خيال ہمہ داني
کرتے تھے بياں آپ کرامات کا اپني
منظور تھي تعداد مريدوں کي بڑھاني
مدت سے رہا کرتے تھے ہمسائے ميں ميرے
تھي رند سے زاہد کي ملاقات پراني
حضرت نے مرے ايک شناسا سے يہ پوچھا
اقبال ، کہ ہے قمري شمشاد معاني
پابندي احکام شريعت ميں ہے کيسا؟
گو شعر ميں ہے رشک کليم ہمداني
سنتا ہوں کہ کافر نہيں ہندو کو سمجھتا
ہے ايسا عقيدہ اثر فلسفہ داني
ہے اس کي طبيعت ميں تشيع بھي ذرا سا
تفضيل علي ہم نے سني اس کي زباني
سمجھا ہے کہ ہے راگ عبادات ميں داخل
مقصود ہے مذہب کي مگر خاک اڑاني
کچھ عار اسے حسن فروشوں سے نہيں ہے
عادت يہ ہمارے شعرا کي ہے پراني
گانا جو ہے شب کو تو سحر کو ہے تلاوت
اس رمز کے اب تک نہ کھلے ہم پہ معاني
ليکن يہ سنا اپنے مريدوں سے ہے ميں نے
بے داغ ہے مانند سحر اس کي جواني
مجموعہ اضداد ہے ، اقبال نہيں ہے
دل دفتر حکمت ہے ، طبيعت خفقاني
رندي سے بھي آگاہ شريعت سے بھي واقف
پوچھو جو تصوف کي تو منصور کا ثاني
اس شخص کي ہم پر تو حقيقت نہيں کھلتي
ہو گا يہ کسي اور ہي اسلام کا باني
القصہ بہت طول ديا وعظ کو اپنے
تا دير رہي آپ کي يہ نغز بياني
اس شہر ميں جو بات ہو اڑ جاتي ہے سب ميں
ميں نے بھي سني اپنے احبا کي زباني
اک دن جو سر راہ ملے حضرت زاہد
پھر چھڑ گئي باتوں ميں وہي بات پراني
فرمايا ، شکايت وہ محبت کے سبب تھي
تھا فرض مرا راہ شريعت کي دکھاني
ميں نے يہ کہا کوئي گلہ مجھ کو نہيں ہے
يہ آپ کا حق تھا ز رہ قرب مکاني
خم ہے سر تسليم مرا آپ کے آگے
پيري ہے تواضع کے سبب ميري جواني
گر آپ کو معلوم نہيں ميري حقيقت
پيدا نہيں کچھ اس سے قصور ہمہ داني
ميں خود بھي نہيں اپني حقيقت کا شناسا
گہرا ہے مرے بحر خيالات کا پاني
مجھ کو بھي تمنا ہے کہ 'اقبال' کو ديکھوں
کي اس کي جدائي ميں بہت اشک فشاني
اقبال بھي 'اقبال' سے آگاہ نہيں ہے
کچھ اس ميں تمسخر نہيں ، واللہ نہيں ہے
قوم گويا جسم ہے ، افراد ہيں اعضائے قوم
منزل صنعت کے رہ پيما ہيں دست و پائے قوم
محفل نظم حکومت ، چہرہء زيبائے قوم
شاعر رنگيں نوا ہے ديدہ بينائے قوم
مبتلائے درد کوئي عضو ہو روتي ہے آنکھ
کس قدر ہمدرد سارے جسم کي ہوتي ہے آنکھ
قصہ دار و رسن بازي طفلانہ دل
التجائے 'ارني' سرخي افسانہء دل
يا رب اس ساغر لبريز کي مے کيا ہو گي
جاوہ ملک بقا ہے خط پيمانہ دل
!ابر رحمت تھا کہ تھي عشق کي بجلي يا رب
جل گئي مزرع ہستي تو اگا دانہء دل
حسن کا گنج گراں مايہ تجھے مل جاتا
!تو نے فرہاد! نہ کھودا کبھي ويرانہ دل
عرش کا ہے کبھي کعبے کا ہے دھوکا اس پر
کس کي منزل ہے الہي! مرا کاشانہ دل
اس کو اپنا ہے جنوں اور مجھے سودا اپنا
دل کسي اور کا ديوانہ ، ميں ديوانہء دل
تو سمجھتا نہيں اے زاہد ناداں اس کو
رشک صد سجدہ ہے اک لغزش مستانہء دل
خاک کے ڈھير کو اکسير بنا ديتي ہے
وہ اثر رکھتي ہے خاکستر پروانہ دل
عشق کے دام ميں پھنس کر يہ رہا ہوتا ہے
برق گرتي ہے تو يہ نخل ہرا ہوتا ہے
مضطرب رکھتا ہے ميرا دل بے تاب مجھے
عين ہستي ہے تڑپ صورت سيماب مجھے
موج ہے نام مرا ، بحر ہے پاياب مجھے
ہو نہ زنجير کبھي حلقہء گرداب مجھے
آب ميں مثل ہوا جاتا ہے توسن ميرا
خار ماہي سے نہ اٹکا کبھي دامن ميرا
ميں اچھلتي ہوں کبھي جذب مہ کامل سے
جوش ميں سر کو پٹکتي ہوں کبھي ساحل سے
ہوں وہ رہرو کہ محبت ہے مجھے منزل سے
کيوں تڑپتي ہوں ، يہ پوچھے کوئي ميرے دل سے
زحمت تنگي دريا سے گريزاں ہوں ميں
وسعت بحر کي فرقت ميں پريشاں ہوں ميں
رخصت اے بزم جہاں! سوئے وطن جاتا ہوں ميں
آہ! اس آباد ويرانے ميں گھبراتا ہوں ميں
بسکہ ميں افسردہ دل ہوں ، درخور محفل نہيں
تو مرے قابل نہيں ہے ، ميں ترے قابل نہيں
قيد ہے ، دربار سلطان و شبستان وزير
توڑ کر نکلے گا زنجير طلائي کا اسير
گو بڑي لذت تري ہنگامہ آرائي ميں ہے
اجنبيت سي مگر تيري شناسائي ميں ہے
مدتوں تيرے خود آرائوں سے ہم صحبت رہا
مدتوں بے تاب موج بحر کي صورت رہا
مدتوں بيٹھا ترے ہنگامہ عشرت ميں ميں
روشني کي جستجو کرتا رہا ظلمت ميں ميں
مدتوں ڈھونڈا کيا نظارئہ گل خار ميں
آہ ، وہ يوسف نہ ہاتھ آيا ترے بازار ميں
چشم حيراں ڈھونڈتي اب اور نظارے کو ہے
آرزو ساحل کي مجھ طوفان کے مارے کو ہے
چھوڑ کر مانند بو تيرا چمن جاتا ہوں ميں
رخصت اے بزم جہاں! سوئے وطن جاتا ہوں ميں
گھر بنايا ہے سکوت دامن کہسار ميں
آہ! يہ لذت کہاں موسيقي گفتار ميں
ہم نشين نرگس شہلا ، رفيق گل ہوں ميں
ہے چمن ميرا وطن ، ہمسايہء بلبل ہوں ميں
شام کو آواز چشموں کي سلاتي ہے مجھے
صبح فرش سبز سے کوئل جگاتي ہے مجھے
بزم ہستي ميں ہے سب کو محفل آرائي پسند
ہے دل شاعر کو ليکن کنج تنہائي پسند
ہے جنوں مجھ کو کہ گھبراتا ہوں آبادي ميں ميں
ڈھونڈتا پھرتا ہوں کس کو کوہ کي وادي ميں ميں ؟
شوق کس کا سبزہ زاروں ميں پھراتا ہے مجھے
اور چشموں کے کنارے پر سلاتا ہے مجھے؟
طعنہ زن ہے تو کہ شيدا کنج عزلت کا ہوں ميں
ديکھ اے غافل! پيامي بزم قدرت کا ہوں ميں
ہم وطن شمشاد کا ، قمري کا ميں ہم راز ہوں
اس چمن کي خامشي ميں گوش بر آواز ہوں
کچھ جو سنتا ہوں تو اوروں کو سنانے کے ليے
ديکھتا ہوں کچھ تو اوروں کو دکھانے کے ليے
عاشق عزلت ہے دل ، نازاں ہوں اپنے گھر پہ ميں
خندہ زن ہوں مسند دارا و اسکندر پہ ميں
ليٹنا زير شجر رکھتا ہے جادو کا اثر
شام کے تارے پہ جب پڑتي ہو رہ رہ کر نظر
!علم کے حيرت کدے ميں ہے کہاں اس کي نمود
گل کي پتي ميں نظر آتا ہے راز ہست و بود
ميں نے چاقو تجھ سے چھينا ہے تو چلاتا ہے تو
مہرباں ہوں ميں ، مجھے نا مہرباں سمجھا ہے تو
پھر پڑا روئے گا اے نووارد اقليم غم
چبھ نہ جائے ديکھنا! ، باريک ہے نوک قلم
آہ! کيوں دکھ دينے والي شے سے تجھ کو پيار ہے
کھيل اس کاغذ کے ٹکڑے سے ، يہ بے آزار ہے
گيند ہے تيري کہاں ، چيني کي بلي ہے کد ھر؟
وہ ذرا سا جانور ٹوٹا ہوا ہے جس کا سر
تيرا آئينہ تھا آزاد غبار آرزو
آنکھ کھلتے ہي چمک اٹھا شرار آرزو
ہاتھ کي جنبش ميں ، طرز ديد ميں پوشيدہ ہے
تيري صورت آرزو بھي تيري نوزائيدہ ہے
زندگاني ہے تري آزاد قيد امتياز
تيري آنکھوں پر ہويدا ہے مگر قدرت کا راز
جب کسي شے پر بگڑ کر مجھ سے ، چلاتا ہے تو
کيا تماشا ہے ردي کاغذ سے من جاتا ہے تو
آہ! اس عادت ميں ہم آہنگ ہوں ميں بھي ترا
تو تلون آشنا ، ميں بھي تلون آشنا
عارضي لذت کا شيدائي ہوں ، چلاتا ہوں ميں
جلد آ جاتا ہے غصہ ، جلد من جاتا ہوں ميں
ميري آنکھوں کو لبھا ليتا ہے حسن ظاہري
کم نہيں کچھ تيري ناداني سے ناداني مري
تيري صورت گاہ گرياں گاہ خنداں ميں بھي ہوں
ديکھنے کو نوجواں ہوں ، طفل ناداں ميں بھي ہوں
نہيں منت کش تاب شنيدن داستاں ميري
خموشي گفتگو ہے بے زباني ہے زباں ميري
يہ دستور زباں بندي ہے کيسا تيري محفل ميں
يہاں تو بات کرنے کو ترستي ہے زباں ميري
اٹھائے کچھ ورق لالے نے ، کچھ نرگس نے ، کچھ گل نے
چمن ميں ہر طرف بکھري ہوئي ہے داستاں ميري
اڑالي قمريوں نے ، طوطيوں نے ، عندلبوں نے
چمن والوں نے مل کر لوٹ لي طرز فغاں ميري
ٹپک اے شمع آنسو بن کے پروانے کي آنکھوں سے
سراپا درد ہوں حسرت بھري ہے داستاں ميري
الہي! پھر مزا کيا ہے يہاں دنيا ميں رہنے کا
!حيات جاوداں ميري ، نہ مرگ ناگہاں ميري
مرا رونا نہيں ، رونا ہے يہ سارے گلستاں کا
وہ گل ہوں ميں ، خزاں ہر گل کي ہے گويا خزاں ميري
دريں حسرت سرا عمريست افسون جرس دارم ''
''ز فيض دل تپيدنہا خروش بے نفس دارم
رياض دہر ميں نا آشنائے بزم عشرت ہوں
خوشي روتي ہے جس کو ، ميں وہ محروم مسرت ہوں
مري بگڑي ہوئي تقدير کو روتي ہے گويائي
ميں حرف زير لب ، شرمندہء گوش سماعت ہوں
پريشاں ہوں ميں مشت خاک ، ليکن کچھ نہيں کھلتا
سکندر ہوں کہ آئينہ ہوں يا گرد کدورت ہوں
يہ سب کچھ ہے مگر ہستي مري مقصد ہے قدرت کا
سراپا نور ہو جس کي حقيقت ، ميں وہ ظلمت ہوں
خزينہ ہوں ، چھپايا مجھ کو مشت خاک صحرا نے
!کسي کيا خبر ہے ميں کہاں ہوں کس کي دولت ہوں
نظر ميري نہيں ممنون سير عرصہء ہستي
ميں وہ چھوٹي سي دنيا ہوں کہ آپ اپني ولايت ہوں
نہ صہاہوں نہ ساقي ہوں نہ مستي ہوں نہ پيمانہ
ميں اس ميخا نہء ہستي ميں ہر شے کي حقيقت ہوں
مجھے راز دو عالم دل کا آئينہ دکھاتا ہے
وہي کہتا ہوں جو کچھ سامنے آنکھوں کے آتا ہے
عطا ايسا بياں مجھ کو ہوا رنگيں بيانوں ميں
کہ بام عرش کے طائر ہيں ميرے ہم زبانوں ميں
اثر يہ بھي ہے اک ميرے جنون فتنہ ساماں کا
مرا آ ئينہ دل ہے قضا کے راز دانوں ميں
رلاتا ہے ترا نظارہ اے ہندوستاں! مجھ کو
کہ عبرت خيز ہے تيرا فسانہ سب فسانوں ميں
ديا رونا مجھے ايسا کہ سب کچھ دے ديا گويا
لکھا کلک ازل نے مجھ کو تيرے نوحہ خوانوں ميں
!نشان برگ گل تک بھي نہ چھوڑ اس باغ ميں گلچيں
تري قسمت سے رزم آرائياں ہيں باغبانوں ميں
چھپاکر آستيں ميں بجلياں رکھي ہيں گردوں نے
عنادل باغ کے غافل نہ بيٹھيں آشيانوں ميں
سن اے غافل صدا ميري، يہ ايسي چيز ہے جس کو
وظيفہ جان کر پڑھتے ہيں طائر بوستانوں ميں
وطن کي فکر کر ناداں مصيبت آنے والي ہے
تري برباديوں کے مشورے ہيں آسمانوں ميں
ذرا ديکھ اس کو جو کچھ ہو رہا ہے، ہونے والا ہے
دھرا کيا ہے بھلا عہد کہن کي داستانوں ميں
يہ خاموشي کہاں تک؟ لذت فرياد پيدا کر
زميں پر تو ہو اور تيري صدا ہو آسمانوں ميں
!نہ سمجھو گے تو مٹ جائو گے اے ہندوستاں والو
تمھاري داستاں تک بھي نہ ہو گي داستانوں ميں
يہي آئين قدرت ہے، يہي اسلوب فطرت ہے
جو ہے راہ عمل ميں گام زن، محبوب فطرت ہے
ہويدا آج اپنے زخم پنہاں کر کے چھوڑوں گا
لہو رو رو کے محفل کو گلستاں کر کے چھوڑوں گا
جلانا ہے مجھے ہر شمع دل کو سوز پنہاں سے
تري تاريک راتوں ميں چراغاں کر کے چھوڑں گا
مگر غنچوں کي صورت ہوں دل درد آشنا پيدا
چمن ميں مشت خاک اپني پريشاں کر کے چھوڑں گا
پرونا ايک ہي تسبيح ميں ان بکھرے دانوں کو
جو مشکل ہے، تو اس مشکل کو آساں کر کے چھوڑوں گا
مجھے اے ہم نشيں رہنے دے شغل سينہ کاوي ميں
کہ ميں داغ محبت کو نماياں کر کے چھوڑوں گا
دکھا دوں گا جہاں کو جو مر ي آنکھوں نے ديکھا ہے
تجھے بھي صورت آئينہ حيراں کر کے چھوڑوں گا
جو ہے پردوں ميں پنہاں، چشم بينا ديکھ ليتي ہے
زمانے کي طبيعت کا تقاضا ديکھ ليتي ہے
کيا رفعت کي لذت سے نہ دل کو آشنا تو نے
گزاري عمر پستي ميں مثال نقش پا تو نے
رہا دل بستہء محفل، مگر اپني نگاہوں کو
کيا بيرون محفل سے نہ حيرت آشنا تو نے
فدا کرتا رہا دل کو حسنيوں کي ادائوں پر
مگر ديکھي نہ اس آئينے ميں اپني ادا تو نے
تعصب چھوڑ ناداں! دہر کے آئينہ خانے ميں
يہ تصويريں ہيں تيري جن کو سمجھا ہے برا تو نے
سراپا نالہ بيداد سوز زندگي ہو جا
سپند آسا گرہ ميں باندھ رکھي ہے صدا تو نے
صفائے دل کو کيا آرائش رنگ تعلق سے
کف آئينہ پر باندھي ہے او ناداں حنا تو نے
زميں کيا آسماں بھي تيري کج بيني پہ روتا ہے
غضب ہے سطر قرآں کو چليپا کر ديا تو نے
!زباں سے گر کيا توحيد کا دعوي تو کيا حاصل
بنايا ہے بت پندار کو اپنا خدا تو نے
کنويں ميں تو نے يوسف کو جو ديکھا بھي تو کيا ديکھا
ارے غافل! جو مطلق تھا مقيد کر ديا تو نے
ہوس بالائے منبر ہے تجھے رنگيں بياني کي
نصيحت بھي تري صورت ہے اک افسانہ خواني کي
دکھا وہ حسن عالم سوز اپني چشم پرنم کو
جو تڑپاتا ہے پروانے کو، رلواتا ہے شبنم کو
نرا نظارہ ہي اے بوالہوس مقصد نہيں اس کا
بنايا ہے کسي نے کچھ سمجھ کر چشم آدم کو
اگر ديکھا بھي اس نے سارے عالم کو تو کيا ديکھا
نظر آئي نہ کچھ اپني حقيقت جام سے جم کو
شجر ہے فرقہ آرائي، تعصب ہے ثمر اس کا
يہ وہ پھل ہے کہ جنت سے نکلواتا ہے آدم کو
نہ اٹھا جذبہء خورشيد سے اک بر گ گل تک بھي
يہ رفعت کي تمنا ہے کہ لے اڑتي ہے شبنم کو
پھرا کرتے نہيں مجروح الفت فکر درماں ميں
يہ زخمي آپ کر ليتے ہيں پيدا اپنے مرہم کو
محبت کے شرر سے دل سراپا نور ہوتا ہے
ذرا سے بيج سے پيدا رياض طور ہوتا ہے
دوا ہر دکھ کي ہے مجروح تيغ آرزو رہنا
علاج زخم ہے آزاد احسان رفو رہنا
شراب بے خودي سے تا فلک پرواز ہے ميري
شکت رنگ سے سيکھا ہے ميں نے بن کے بو رہنا
تھمے کيا ديدئہ گرياں وطن کي نوحہ خواني ميں
عبادت چشم شاعر کي ہے ہر دم با وضو رہنا
بنائيں کيا سمجھ کر شاخ گل پر آشياں اپنا
چمن ميں آہ! کيا رہنا جو ہو بے آبرو رہنا
جو تو سمجھے تو آزادي ہے پوشيدہ محبت ميں
غلامي ہے اسير امتياز ماو تو رہنا
يہ استغنا ہے ، پاني ميں نگوں رکھتا ہے ساغر کو
تجھے بھي چاہيے مثل حباب آبجو رہنا
نہ رہ اپنوں سے بے پروا ، اسي ميں خير ہے تيري
اگر منظور ہے دنيا ميں او بيگانہ خو رہنا
شراب روح پرور ہے محبت نوع انساں کي
سکھايا اس نے مجھ کو مست بے جام و سبو رہنا
محبت ہي سے پائي ہے شفا بيمار قوموں نے
کيا ہے اپنے بخت خفتہ کو بيدار قوموں نے
بيابان محبت دشت غربت بھي ، وطن بھي ہے
يہ ويرانہ قفس بھي، آشيانہ بھي ، چمن بھي ہے
محبت ہي وہ منزل ہے کہ منزل بھي ہے ، صحرا بھي
جرس بھي، کارواں بھي، راہبر بھي، راہزن بھي ہے
مرض کہتے ہيں سب اس کو، يہ ہے ليکن مرض ايسا
چھپا جس ميں علاج گردش چرخ کہن بھي ہے
جلانا دل کا ہے گويا سراپا نور ہو جانا
يہ پروانہ جو سوزاں ہو تو شمع انجمن بھي ہے
وہي اک حسن ہے، ليکن نظر آتا ہے ہر شے ميں
يہ شيريں بھي ہے گويا بيستوں بھي ، کوہکن بھي ہے
اجاڑا ہے تميز ملت و آئيں نے قوموں کو
مرے اہل وطن کے دل ميں کچھ فکر وطن بھي ہے؟
سکوت آموز طول داستان درد ہے ورنہ
زباں بھي ہے ہمارے منہ ميں اور تاب سخن بھي ہے
نميگرديد کوتہ رشتہء معني رہا کر دم
حکايت بود بے پاياں، بخاموشي ادا کر دم
جا بسا مغرب ميں آخر اے مکاں تيرا مکيں
آہ! مشرق کي پسند آئي نہ اس کو سر زميں
آ گيا آج اس صداقت کا مرے دل کو يقيں
ظلمت شب سے ضيائے روز فرقت کم نہيں
تا ز آغوش وداعش داغ حيرت چيدہ است ''
''ہمچو شمع کشتہ در چشم نگہ خوابيدہ است
کشتہ عزلت ہوں، آبادي ميں گھبراتا ہوں ميں
شہر سے سودا کي شدت ميں نکل جاتا ہوں ميں
ياد ايام سلف سے دل کو تڑپاتا ہوں ميں
بہر تسکيں تيري جانب دوڑتا آتا ہوں ميں
آنکھ گو مانوس ہے تيرے در و ديوار سے
اجنبيت ہے مگر پيدا مري رفتار سے
ذرہ ميرے دل کا خورشيد آشنا ہونے کو تھا
آئنہ ٹوٹا ہوا عالم نما ہونے کو تھا
نخل ميري آرزوئوں کا ہرا ہونے کو تھا
آہ! کيا جانے کوئي ميں کيا سے کيا ہونے کو تھا
ابر رحمت دامن از گلزار من برچيد و رفت
اند کے بر غنچہ ہائے آرزو باريد و رفت
تو کہاں ہے اے کليم ذروئہ سينائے علم
تھي تري موج نفس باد نشاط افزائے علم
اب کہاں وہ شوق رہ پيمائي صحرائے علم
تيرے دم سے تھا ہمارے سر ميں بھي سودائے علم
شور ليلي کو کہ باز آرايش سودا کند ''
''خاک مجنوں را غبار خاطر صحرا کند
کھول دے گا دشت وحشت عقدئہ تقدير کو
توڑ کر پہنچوں گا ميں پنجاب کي زنجير کو
ديکھتا ہے ديدئہ حيراں تري تصوير کو
کيا تسلي ہو مگر گرويدہء تقرير کو
تاب گويائي نہيں رکھتا دہن تصوير کا ''
''خامشي کہتے ہيں جس کو، ہے سخن تصوير کا
ميرے ويرانے سے کوسوں دور ہے تيرا وطن
ہے مگر دريائے دل تيري کشش سے موجزن
قصد کس محفل کا ہے؟ آتا ہے کس محفل سے تو؟
زرد رو شايد ہوا رنج رہ منزل سے تو
آفرنيش ميں سراپا نور ، ظلمت ہوں ميں
اس سيہ روزي پہ ليکن تيرا ہم قسمت ہوں ميں
آہ ، ميں جلتا ہوں سوز اشتياق ديد سے
تو سراپا سوز داغ منت خورشيد سے
ايک حلقے پر اگر قائم تري رفتار ہے
ميري گردش بھي مثال گردش پرکار ہے
زندگي کي رہ ميں سرگرداں ہے تو، حيراں ہوں ميں
تو فروزاں محفل ہستي ميں ہے ، سوزاں ہوں ميں
ميں رہ منزل ميں ہوں، تو بھي رہ منزل ميں ہے
تيري محفل ميں جو خاموشي ہے ، ميرے دل ميں ہے
تو طلب خو ہے تو ميرا بھي يہي دستور ہے
چاندني ہے نور تيرا، عشق ميرا نور ہے
انجمن ہے ايک ميري بھي جہاں رہتا ہوں ميں
بزم ميں اپني اگر يکتا ہے تو، تنہا ہوں ميں
مہر کا پرتو ترے حق ميں ہے پيغام اجل
محو کر ديتا ہے مجھ کو جلوئہ حسن ازل
پھر بھي اے ماہ مبيں! ميں اور ہوں تو اور ہے
درد جس پہلو ميں اٹھتا ہو وہ پہلو اور ہے
گرچہ ميں ظلمت سراپا ہوں، سراپا نور تو
سينکڑوں منزل ہے ذوق آگہي سے دور تو
جو مري ہستي کا مقصد ہے ، مجھے معلوم ہے
يہ چمک وہ ہے، جبيں جس سے تري محروم ہے
چمک اٹھا جو ستارہ ترے مقدر کا
حبش سے تجھ کو اٹھا کر حجاز ميں لايا
ہوئي اسي سے ترے غم کدے کي آبادي
تري غلامي کے صدقے ہزار آزادي
وہ آستاں نہ چھٹا تجھ سے ايک دم کے ليے
کسي کے شوق ميں تو نے مزے ستم کے ليے
جفا جو عشق ميں ہوتي ہے وہ جفا ہي نہيں
ستم نہ ہو تو محبت ميں کچھ مزا ہي نہيں
نظر تھي صورت سلماں ادا شناس تري
شراب ديد سے بڑھتي تھي اور پياس تري
تجھے نظارے کا مثل کليم سودا تھا
اويس طاقت ديدار کو ترستا تھا
مدينہ تيري نگاہوں کا نور تھا گويا
ترے ليے تو يہ صحرا ہي طور تھا گويا
تري نظر کو رہي ديد ميں بھي حسرت ديد
خنک دلے کہ تپيد و دمے نيا سائيد
گري وہ برق تري جان ناشکيبا پر
کہ خندہ زن تري ظلمت تھي دست موسي پر
تپش ز شعلہ گر فتند و بر دل تو زدند
چہ برق جلوہ بخاشاک حاصل تو زدند
ادائے ديد سراپا نياز تھي تيري
کسي کو ديکھتے رہنا نماز تھي تيري
اذاں ازل سے ترے عشق کا ترانہ بني
نماز اس کے نظارے کا اک بہانہ بني
خوشا وہ وقت کہ يثرب مقام تھا اس کا
خوشا وہ دور کہ ديدار عام تھا اس کا
سنے کوئي مري غربت کي داستاں مجھ سے
بھلايا قصہ پيمان اوليں ميں نے
لگي نہ ميري طبيعت رياض جنت ميں
پيا شعور کا جب جام آتشيں ميں نے
رہي حقيقت عالم کي جستجو مجھ کو
دکھايا اوج خيال فلک نشيں ميں نے
ملا مزاج تغير پسند کچھ ايسا
کيا قرار نہ زير فلک کہيں ميں نے
نکالا کعبے سے پتھر کي مورتوں کو کبھي
کبھي بتوں کو بنايا حرم نشيں ميں نے
کبھي ميں ذوق تکلم ميں طور پر پہنچا
چھپايا نور ازل زير آستيں ميں نے
کبھي صليب پہ اپنوں نے مجھ کو لٹکايا
کيا فلک کو سفر، چھوڑ کر زميں ميں نے
کبھي ميں غار حرا ميں چھپا رہا برسوں
ديا جہاں کو کبھي جام آخريں ميں نے
سنايا ہند ميں آ کر سرود رباني
پسند کي کبھي يوناں کي سر زميں ميں نے
ديار ہند نے جس دم مري صدا نہ سني
بسايا خطہء جاپان و ملک چيں ميں نے
بنايا ذروں کي ترکيب سے کبھي عالم
خلاف معني تعليم اہل ديں ميں نے
لہو سے لال کيا سينکڑوں زمينوں کو
جہاں ميں چھيڑ کے پيکار عقل و ديں ميں نے
سمجھ ميں آئي حقيقت نہ جب ستاروں کي
اسي خيال ميں راتيں گزار ديں ميں نے
ڈرا سکيں نہ کليسا کي مجھ کو تلواريں
سکھايا مسئلہ گردش زميں ميں نے
کشش کا راز ہويدا کيا زمانے پر
لگا کے آئنہ عقل دور بيں ميں نے
کيا اسير شعاعوں کو ، برق مضطر کو
بنادي غيرت جنت يہ سر زميں ميں نے
مگر خبر نہ ملي آہ! راز ہستي کي
کيا خرد سے جہاں کو تہ نگيں ميں نے
ہوئي جو چشم مظاہر پرست وا آخر
تو پايا خانہء دل ميں اسے مکيں ميں نے
سارے جہاں سے اچھا ہندوستاں ہمارا
ہم بلبليں ہيں اس کي، يہ گلستاں ہمارا
غربت ميں ہوں اگر ہم، رہتا ہے دل وطن ميں
سمجھو وہيں ہميں بھي، دل ہو جہاں ہمارا
پربت وہ سب سے اونچا، ہمسايہ آسماں کا
وہ سنتري ہمارا، وہ پاسباں ہمارا
گودي ميں کھيلتي ہيں اس کي ہزاروں ندياں
گلشن ہے جن کے دم سے رشک جناں ہمارا
اے آب رود گنگا، وہ دن ہيں ياد تجھ کو؟
اترا ترے کنارے جب کارواں ہمارا
مذہب نہيں سکھاتا آپس ميں بير رکھنا
ہندي ہيں ہم وطن ہے ہندوستاں ہمارا
يونان و مصر و روما سب مٹ گئے جہاں سے
اب تک مگر ہے باقي نام و نشاں ہمارا
کچھ بات ہے کہ ہستي مٹتي نہيں ہماري
صديوں رہا ہے دشمن دور زماں ہمارا
اقبال! کوئي محرم اپنا نہيں جہاں ميں
معلوم کيا کسي کو درد نہاں ہمارا
جگنو کي روشني ہے کاشانہء چمن ميں
يا شمع جل رہي ہے پھولوں کي انجمن ميں
آيا ہے آسماں سے اڑ کر کوئي ستارہ
يا جان پڑ گئي ہے مہتاب کي کرن ميں
يا شب کي سلطنت ميں دن کا سفير آيا
غربت ميں آ کے چمکا، گمنام تھا وطن ميں
تکمہ کوئي گرا ہے مہتاب کي قبا کا
ذرہ ہے يا نماياں سورج کے پيرہن ميں
حسن قديم کي يہ پوشيدہ اک جھلک تھي
لے آئي جس کو قدرت خلوت سے انجمن ميں
چھوٹے سے چاند ميں ہے ظلمت بھي روشني بھي
نکلا کبھي گہن سے، آيا کبھي گہن ميں
پروانہ اک پتنگا، جگنو بھي اک پتنگا
وہ روشني کا طالب، يہ روشني سراپا
ہر چيز کو جہاں ميں قدرت نے دلبري دي
پروانے کو تپش دي، جگنو کو روشني دي
رنگيں نوا بنايا مرغان بے زباں کو
گل کو زبان دے کر تعليم خامشي دي
نظارئہ شفق کي خوبي زوال ميں تھي
چمکا کے اس پري کو تھوڑي سي زندگي دي
رنگيں کيا سحر کو، بانکي دلھن کي صورت
پہنا کے لال جوڑا شبنم کي آرسي دي
سايہ ديا شجر کو، پرواز دي ہوا کو
پاني کو دي رواني، موجوں کو بے کلي دي
يہ امتياز ليکن اک بات ہے ہماري
جگنو کا دن وہي ہے جو رات ہے ہماري
حسن ازل کي پيدا ہر چيز ميں جھلک ہے
انساں ميں وہ سخن ہے، غنچے ميں وہ چٹک ہے
يہ چاند آسماں کا شاعر کا دل ہے گويا
واں چاندني ہے جو کچھ، ياں درد کي کسک ہے
انداز گفتگو نے دھوکے ديے ہيں ورنہ
نغمہ ہے بوئے بلبل، بو پھول کي چہک ہے
کثرت ميں ہو گيا ہے وحدت کا راز مخفي
جگنو ميں جو چمک ہے وہ پھول ميں مہک ہے
يہ اختلاف پھر کيوں ہنگاموں کا محل ہو
ہر شے ميں جبکہ پنہاں خاموشي ازل ہو
لطف ہمسايگي شمس و قمر کو چھوڑوں
اور اس خدمت پيغام سحر کو چھوڑوں
ميرے حق ميں تو نہيں تاروں کي بستي اچھي
اس بلندي سے زميں والوں کي پستي اچھي
آسماں کيا ، عدم آباد وطن ہے ميرا
صبح کا دامن صد چاک کفن ہے ميرا
ميري قسمت ميں ہے ہر روز کا مرنا جينا
ساقي موت کے ہاتھوں سے صبوحي پينا
نہ يہ خدمت، نہ يہ عزت، نہ يہ رفعت اچھي
اس گھڑي بھر کے چمکنے سے تو ظلمت اچھي
ميري قدرت ميں جو ہوتا، تو نہ اختر بنتا
قعر دريا ميں چمکتا ہوا گوہر بنتا
واں بھي موجوں کي کشاکش سے جو دل گھبراتا
چھوڑ کر بحر کہيں زيب گلو ہو جاتا
ہے چمکنے ميں مزا حسن کا زيور بن کر
زينت تاج سر بانوئے قيصر بن کر
ايک پتھر کے جو ٹکڑے کا نصيبا جاگا
خاتم دست سليماں کا نگيں بن کے رہا
ايسي چنروں کا مگر دہر ميں ہے کام شکست
ہے گہر ہائے گراں مايہ کا انجام شکست
زندگي وہ ہے کہ جو ہو نہ شناسائے اجل
کيا وہ جينا ہے کہ ہو جس ميں تقاضائے اجل
ہے يہ انجام اگر زينت عالم ہو کر
!کيوں نہ گر جائو ں کسي پھول پہ شبنم ہو کر
کسي پيشاني کے افشاں کے ستاروں ميں رہوں
کس مظلوم کي آہوں کے شراروں ميں رہوں
اشک بن کر سرمژگاں سے اٹک جائوں ميں
کيوں نہ اس بيوي کي آنکھوں سے ٹپک جائوں ميں
جس کا شوہر ہو رواں، ہو کے زرہ ميں مستور
سوئے ميدان وغا ، حب وطن سے مجبور
ياس و اميد کا نظارہ جو دکھلاتي ہو
جس کي خاموشي سے تقرير بھي شرماتي ہو
جس کو شوہر کي رضا تاب شکيبائي دے
اور نگاہوں کو حيا طاقت گويائي دے
زرد ، رخصت کي گھڑي ، عارض گلگوں ہو جائے
کشش حسن غم ہجر سے افزوں ہو جائے
لاکھ وہ ضبط کرے پر ميں ٹپک ہي جائوں
ساغر ديدئہ پرنم سے چھلک ہي جائوں
خاک ميں مل کے حيات ابدي پا جائوں
عشق کا سوز زمانے کو دکھاتا جائوں
چشتي نے جس زميں ميں پيغام حق سنايا
نانک نے جس چمن ميں وحدت کا گيت گايا
تاتاريوں نے جس کو اپنا وطن بنايا
جس نے حجازيوں سے دشت عرب چھڑايا
ميرا وطن وہي ہے ، ميرا وطن وہي ہے
يونانيوں کو جس نے حيران کر ديا تھا
سارے جہاں کو جس نے علم و ہنر ديا تھا
مٹي کو جس کي حق نے زر کا اثر ديا تھا
ترکوں کا جس نے دامن ہيروں سے بھر ديا تھا
ميرا وطن وہي ہے، ميرا وطن وہي ہے
ٹوٹے تھے جو ستارے فارس کے آسماں سے
پھر تاب دے کے جس نے چمکائے کہکشاں سے
وحدت کي لے سني تھي دنيا نے جس مکاں سے
مير عرب کو آئي ٹھنڈي ہوا جہاں سے
ميرا وطن وہي ہے، ميرا وطن وہي ہے
بندے کليم جس کے ، پربت جہاں کے سينا
نوح نبي کا آ کر ٹھہرا جہاں سفينا
رفعت ہے جس زميں کي بام فلک کا زينا
جنت کي زندگي ہے جس کي فضا ميں جينا
ميرا وطن وہي ہے، ميرا وطن وہي ہے
سچ کہہ دوں اے برہمن! گر تو برا نہ مانے
تيرے صنم کدوں کے بت ہو گئے پرانے
اپنوں سے بير رکھنا تو نے بتوں سے سيکھا
جنگ و جدل سکھايا واعظ کو بھي خدا نے
تنگ آ کے ميں نے آخر دير و حرم کو چھوڑا
واعظ کا وعظ چھوڑا، چھوڑے ترے فسانے
پتھر کي مورتوں ميں سمجھا ہے تو خدا ہے
خاک وطن کا مجھ کو ہر ذرہ ديوتا ہے
آ ، غيريت کے پردے اک بار پھر اٹھا ديں
بچھڑوں کو پھر ملا ديں نقش دوئي مٹا ديں
سوني پڑي ہوئي ہے مدت سے دل کي بستي
آ ، اک نيا شوالا اس ديس ميں بنا ديں
دنيا کے تيرتھوں سے اونچا ہو اپنا تيرتھ
دامان آسماں سے اس کا کلس ملا ديں
ہر صبح اٹھ کے گائيں منتر وہ مٹيھے مٹيھے
سارے پجاريوں کو مے پيت کي پلا ديں
شکتي بھي شانتي بھي بھگتوں کے گيت ميں ہے
دھرتي کے باسيوں کي مکتي پريت ميں ہے
عظمت غالب ہے اک مدت سے پيوند زميں
مہدي مجروح ہے شہر خموشاں کا مکيں
توڑ ڈالي موت نے غربت ميں مينائے امير
چشم محفل ميں ہے اب تک کيف صہبائے امير
آج ليکن ہمنوا! سارا چمن ماتم ميں ہے
شمع روشن بجھ گئي، بزم سخن ماتم ميں ہے
بلبل دلي نے باندھا اس چمن ميں آشياں
ہم نوا ہيں سب عنادل باغ ہستي کے جہاں
چل بسا داغ آہ! ميت اس کي زيب دوش ہے
آخري شاعر جہان آباد کا خاموش ہے
اب کہاں وہ بانکپن، وہ شوخي طرز بياں
آگ تھي کافور پيري ميں جواني کي نہاں
تھي زبان داغ پر جو آرزو ہر دل ميں ہے
ليلي معني وہاں بے پردہ، ياں محمل ميں ہے
اب صبا سے کون پوچھے گا سکوت گل کا راز
کون سمجھے گا چمن ميں نالہ بلبل کا راز
تھي حقيقت سے نہ غفلت فکر کي پرواز ميں
آنکھ طائر کي نشيمن پر رہي پرواز ميں
اور دکھلائيں گے مضموں کي ہميں باريکياں
اپنے فکر نکتہ آرا کي فلک پيمائياں
تلخي دوراں کے نقشے کھينچ کر رلوائيں گے
يا تخيل کي نئي دنيا ہميں دکھلائيں گے
اس چمن ميں ہوں گے پيدا بلبل شيراز بھي
سينکڑوں ساحر بھي ہوں گے، صاحب اعجاز بھي
اٹھيں گے آزر ہزاروں شعر کے بت خانے سے
مے پلائيں گے نئے ساقي نئے پيمانے سے
لکھي جائيں گي کتاب دل کي تفسيريں بہت
ہوں گي اے خواب جواني! تيري تعبيريں بہت
ہوبہو کھينچے گا ليکن عشق کي تصوير کون ؟
اٹھ گيا ناوک فگن، مارے گا دل پر تير کون ؟
اشک کے دانے زمين شعر ميں بوتا ہوں ميں
تو بھي رو اے خاک دلي! داغ کو روتا ہوں ميں
اے جہان آباد، اے سرمايہ بزم سخن
ہوگيا پھر آج پامال خزاں تيرا چمن
وہ گل رنگيں ترا رخصت مثال بو ہوا
آہ! خالي داغ سے کاشانہ و اردو ہوا
تھي نہ شايد کچھ کشش ايسي وطن کي خاک ميں
وہ مہ کامل ہوا پنہاں دکن کي خاک ميں
اٹھ گئے ساقي جو تھے، ميخانہ خالي رہ گيا
يادگار بزم دہلي ايک حالي رہ گيا
آرزو کو خون رلواتي ہے بيداد اجل
مارتا ہے تير تاريکي ميں صياد اجل
کھل نہيں سکتي شکايت کے ليے ليکن زباں
ہے خزاں کا رنگ بھي وجہ قيام گلستاں
ايک ہي قانون عالم گير کے ہيں سب اثر
بوے گل کا باغ سے، گلچيں کا دنيا سے سفر
ٹھي پھر آج وہ پورب سے کالي کالي گھٹا
سياہ پوش ہوا پھر پہاڑ سربن کا
نہاں ہوا جو رخ مہر زير دامن ابر
ہوائے سرد بھي آئي سوار توسن ابر
گرج کا شور نہيں ہے ، خموش ہے يہ گھٹا
عجيب مے کدئہ بے خروش ہے يہ گھٹا
چمن ميں حکم نشاط مدام لائي ہے
قبائے گل ميں گہر ٹانکنے کو آئي ہے
جو پھول مہر کي گرمي سے سو چلے تھے ، اٹھے
زميں کي گود ميں جو پڑ کے سو رہے تھے ، اٹھے
ہوا کے زور سے ابھرا، بڑھا، اڑا بادل
اٹھي وہ اور گھٹا، لو! برس پڑا بادل
عجيب خيمہ ہے کہسار کے نہالوں کا
يہيں قيام ہو وادي ميں پھرنے والوں کا
سر شام ايک مرغ نغمہ پيرا
کسي ٹہني پہ بيٹھا گا رہا تھا
چمکتي چيز اک ديکھي زميں پر
اڑا طائر اسے جگنو سمجھ کر
!کہا جگنو نے او مرغ نواريز
نہ کر بے کس پہ منقار ہوس تيز
تجھے جس نے چہک ، گل کو مہک دي
اسي اللہ نے مجھ کو چمک دي
لباس نور ميں مستور ہوں ميں
پتنگوں کے جہاں کا طور ہوں ميں
چہک تيري بہشت گوش اگر ہے
چمک ميري بھي فردوس نظر ہے
پروں کو ميرے قدرت نے ضيا دي
تجھے اس نے صدائے دل ربا دي
تري منقار کو گانا سکھايا
مجھے گلزار کي مشعل بنايا
چمک بخشي مجھے، آواز تجھ کو
ديا ہے سوز مجھ کو، ساز تجھ کو
مخالف ساز کا ہوتا نہيں سوز
جہاں ميں ساز کا ہے ہم نشيں سوز
قيام بزم ہستي ہے انھي سے
ظہور اوج و پستي ہے انھي سے
ہم آہنگي سے ہے محفل جہاں کي
اسي سے ہے بہار اس بوستاں کي
!کيسي حيراني ہے يہ اے طفلک پروانہ خو
شمع کے شعلوں کو گھڑيوں ديکھتا رہتا ہے تو
يہ مري آغوش ميں بيٹھے ہوئے جنبش ہے کيا
روشني سے کيا بغل گيري ہے تيرا مدعا؟
اس نظارے سے ترا ننھا سا دل حيران ہے
يہ کسي ديکھي ہوئي شے کي مگر پہچان ہے
شمع اک شعلہ ہے ليکن تو سراپا نور ہے
آہ! اس محفل ميں يہ عرياں ہے تو مستور ہے
!دست قدرت نے اسے کيا جانے کيوں عرياں کيا
تجھ کو خاک تيرہ کے فانوس ميں پنہاں کيا
نور تيرا چھپ گيا زير نقاب آگہي
ہے غبار ديدہء بينا حجاب آگہي
زندگاني جس کو کہتے ہيں فراموشي ہے يہ
خواب ہے، غفلت ہے، سرمستي ہے، بے ہوشي ہے يہ
محفل قدرت ہے اک دريائے بے پايان حسن
آنکھ اگر ديکھے تو ہر قطرے ميں ہے طوفان حسن
حسن ، کوہستاں کي ہيبت ناک خاموشي ميں ہے
مہر کي ضوگستري، شب کي سيہ پوشي ميں ہے
آسمان صبح کي آئينہ پوشي ميں ہے يہ
شام کي ظلمت، شفق کي گل فرو شي ميں ہے يہ
عظمت ديرينہ کے مٹتے ہوئے آثار ميں
طفلک ناآشنا کي کوشش گفتار ميں
ساکنان صحن گلشن کي ہم آوازي ميں ہے
ننھے ننھے طائروں کي آشياں سازي ميں ہے
چشمہ کہسار ميں ، دريا کي آزادي ميں حسن
شہر ميں، صحرا ميں، ويرانے ميں، آبادي ميں حسن
روح کو ليکن کسي گم گشتہ شے کي ہے ہوس
!ورنہ اس صحرا ميں کيوں نالاں ہے يہ مثل جرس
حسن کے اس عام جلوے ميں بھي يہ بے تاب ہے
زندگي اس کي مثال ماہي بے آب ہے
سکوت شام ميں محو سرود ہے راوي
نہ پوچھ مجھ سے جو ہے کيفيت مرے دل کي
پيام سجدے کا يہ زير و بم ہوا مجھ کو
جہاں تمام سواد حرم ہوا مجھ کو
سر کنارہ آب رواں کھڑا ہوں ميں
خبر نہيں مجھے ليکن کہاں کھڑا ہوں ميں
شراب سرخ سے رنگيں ہوا ہے دامن شام
ليے ہے پير فلک دست رعشہ دار ميں جام
عدم کو قافلہ روز تيز گام چلا
شفق نہيں ہے ، يہ سورج کے پھول ہيں گويا
کھڑے ہيں دور وہ عظمت فزائے تنہائي
منار خواب گہ شہسوار چغتائي
فسانہء ستم انقلاب ہے يہ محل
کوئي زمان سلف کي کتاب ہے يہ محل
مقام کيا ہے سرود خموش ہے گويا
شجر ، يہ انجمن بے خروش ہے گويا
رواں ہے سينہء دريا پہ اک سفينہ تيز
ہوا ہے موج سے ملاح جس کا گرم ستيز
سبک روي ميں ہے مثل نگاہ يہ کشتي
نکل کے حلقہ حد نظر سے دور گئي
جہاز زندگي آدمي رواں ہے يونہي
ابد کے بحر ميں پيدا يونہي ، نہاں ہے يونہي
شکست سے يہ کبھي آشنا نہيں ہوتا
نظر سے چھپتا ہے ليکن فنا نہيں ہوتا
فرشتے پڑھتے ہيں جس کو وہ نام ہے تيرا
بڑي جناب تري، فيض عام ہے تيرا
ستارے عشق کے تيري کشش سے ہيں قائم
نظام مہر کي صورت نظام ہے تيرا
تري لحد کي زيارت ہے زندگي دل کي
مسيح و خضر سے اونچا مقام ہے تيرا
نہاں ہے تيري محبت ميں رنگ محبوبي
بڑي ہے شان، بڑا احترام ہے تيرا
اگر سياہ دلم، داغ لالہ زار تو ام
و گر کشادہ جبينم، گل بہار تو ام
چمن کو چھوڑ کے نکلا ہوں مثل نکہت گل
ہوا ہے صبر کا منظور امتحاں مجھ کو
چلي ہے لے کے وطن کے نگار خانے سے
شراب علم کي لذت کشاں کشاں مجھ کو
نظر ہے ابر کرم پر ، درخت صحرا ہوں
کيا خدا نے نہ محتاج باغباں مجھ کو
فلک نشيں صفت مہر ہوں زمانے ميں
تري دعا سے عطا ہو وہ نردباں مجھ کو
مقام ہم سفروں سے ہوا اس قدر آگے
کہ سمجھے منزل مقصود کارواں مجھ کو
مري زبان قلم سے کسي کا دل نہ دکھے
کسي سے شکوہ نہ ہو زير آسماں مجھ کو
دلوں کو چاک کرے مثل شانہ جس کا اثر
تري جناب سے ايسي ملے فغاں مجھ کو
بنايا تھا جسے چن چن کے خار و خس ميں نے
چمن ميں پھر نظر آئے وہ آشياں مجھ کو
پھر آ رکھوں قدم مادر و پدر پہ جبيں
کيا جنھوں نے محبت کا رازداں مجھ کو
وہ شمع بارگہ خاندان مرتضوي
رہے گا مثل حرم جس کا آستاں مجھ کو
نفس سے جس کے کھلي ميري آرزو کي کلي
بنايا جس کي مروت نے نکتہ داں مجھ کو
دعا يہ کر کہ خداوند آسمان و زميں
کرے پھر اس کي زيارت سے شادماں مجھ کو
وہ ميرا يوسف ثاني وہ شمع محفل عشق
ہوئي ہے جس کي اخوت قرار جاں مجھ کو
جلا کے جس کي محبت نے دفتر من و تو
ہوائے عيش ميں پالا، کيا جواں مجھ کو
رياض دہر ميں مانند گل رہے خنداں
کہ ہے عزيز تر از جاں وہ جان جاں مجھ کو
!شگفتہ ہو کے کلي دل کي پھول ہو جائے
!يہ التجائے مسافر قبول ہو جائے
گلزار ہست و بود نہ بيگانہ وار ديکھ
ہے ديکھنے کي چيز اسے بار بار ديکھ
آيا ہے تو جہاں ميں مثال شرار ديکھ
دم دے نہ جائے ہستي ناپائدار ديکھ
مانا کہ تيري ديد کے قابل نہيں ہوں ميں
تو ميرا شوق ديکھ، مرا انتظار ديکھ
کھولي ہيں ذوق ديد نے آنکھيں تري اگر
ہر رہ گزر ميں نقش کف پائے يار ديکھ
نہ آتے ، ہميں اس ميں تکرار کيا تھي
مگر وعدہ کرتے ہوئے عار کيا تھي
تمھارے پيامي نے سب راز کھولا
خطا اس ميں بندے کي سرکار کيا تھي
بھري بزم ميں اپنے عاشق کو تاڑا
!تري آنکھ مستي ميں ہشيار کيا تھي
تامل تو تھا ان کو آنے ميں قاصد
مگر يہ بتا طرز انکار کيا تھي
کھنچے خود بخود جانب طور موسي
!کشش تيري اے شوق ديدار کيا تھي
کہيں ذکر رہتا ہے اقبال تيرا
فسوں تھا کوئي ، تيري گفتار کيا تھي
عجب واعظ کي دينداري ہے يا رب
عداوت ہے اسے سارے جہاں سے
کوئي اب تک نہ يہ سمجھا کہ انساں
کہاں جاتا ہے، آتا ہے کہاں سے
وہيں سے رات کو ظلمت ملي ہے
چمک تارے نے پائي ہے جہاں سے
ہم اپني درد مندي کا فسانہ
سنا کرتے ہيں اپنے رازداں سے
بڑي باريک ہيں واعظ کي چاليں
لرز جاتا ہے آواز اذاں سے
لائوں وہ تنکے کہيں سے آشيانے کے ليے
بجلياں بے تاب ہوں جن کو جلانے کے ليے
وائے ناکامي ، فلک نے تاک کر توڑا اسے
ميں نے جس ڈالي کو تاڑا آشيانے کے ليے
آنکھ مل جاتي ہے ہفتاد و دو ملت سے تري
ايک پيمانہ ترا سارے زمانے کے ليے
دل ميں کوئي اس طرح کي آرزو پيدا کروں
لوٹ جائے آسماں ميرے مٹانے کے ليے
جمع کر خرمن تو پہلے دانہ دانہ چن کے تو
آ ہي نکلے گي کوئي بجلي جلانے کے ليے
پاس تھا ناکامي صياد کا اے ہم صفير
!ورنہ ميں ، اور اڑ کے آتا ايک دانے کے ليے
اس چمن ميں مرغ دل گائے نہ آزادي کا گيت
آہ يہ گلشن نہيں ايسے ترانے کے ليے
کيا کہوں اپنے چمن سے ميں جدا کيونکر ہوا
اور اسير حلقہ دام ہوا کيونکر ہوا
جائے حيرت ہے برا سارے زمانے کا ہوں ميں
مجھ کو يہ خلعت شرافت کا عطا کيونکر ہوا
کچھ دکھانے ديکھنے کا تھا تقاضا طور پر
کيا خبر ہے تجھ کو اے دل فيصلا کيونکر ہوا
ہے طلب بے مدعا ہونے کي بھي اک مدعا
مرغ دل دام تمنا سے رہا کيونکر ہوا
ديکھنے والے يہاں بھي ديکھ ليتے ہيں تجھے
پھر يہ وعدہ حشر کا صبر آزما کيونکر ہوا
حسن کامل ہي نہ ہو اس بے حجابي کا سبب
وہ جو تھا پردوں ميں پنہاں ، خود نما کيونکر ہوا
!موت کا نسخہ ابھي باقي ہے اے درد فراق
چارہ گر ديوانہ ہے ، ميں لا دوا کيونکر ہوا
تو نے ديکھا ہے کبھي اے ديدہء عبرت کہ گل
ہو کے پيدا خاک سے رنگيں قبا کيونکر ہوا
پرسش اعمال سے مقصد تھا رسوائي مري
ورنہ ظاہر تھا سبھي کچھ ، کيا ہوا ، کيونکر ہوا
ميرے مٹنے کا تماشا ديکھنے کي چيز تھي
کيا بتائوں ان کا ميرا سامنا کيونکر ہوا
انوکھي وضع ہے ، سارے زمانے سے نرالے ہيں
يہ عاشق کون سي بستي کے يا رب رہنے والے ہيں
علاج درد ميں بھي درد کي لذت پہ مرتا ہوں
جو تھے چھالوں ميں کانٹے ، نوک سوزن سے نکالے ہيں
پھلا پھولا رہے يا رب! چمن ميري اميدوں کا
جگر کا خون دے دے کر يہ بوٹے ميں نے پالے ہيں
رلاتي ہے مجھے راتوں کو خاموشي ستاروں کي
نرالا عشق ہے ميرا ، نرالے ميرے نالے ہيں
نہ پوچھو مجھ سے لذت خانماں برباد رہنے کي
نشيمن سينکڑوں ميں نے بنا کر پھونک ڈالے ہيں
نہيں بيگانگي اچھي رفيق راہ منزل سے
ٹھہر جا اے شرر ، ہم بھي تو آخر مٹنے والے ہيں
اميد حور نے سب کچھ سکھا رکھا ہے واعظ کو
يہ حضرت ديکھنے ميں سيدھے سادے ، بھولے بھالے ہيں
مرے اشعار اے اقبال کيوں پيارے نہ ہوں مجھ کو
مرے ٹوٹے ہوئے دل کے يہ درد انگيز نالے ہيں
ظاہر کي آنکھ سے نہ تماشا کرے کوئي
ہو ديکھنا تو ديدہء دل وا کرے کوئي
منصور کو ہوا لب گويا پيام موت
اب کيا کسي کے عشق کا دعوي کرے کوئي
ہو ديد کا جو شوق تو آنکھوں کو بند کر
ہے ديکھنا يہي کہ نہ ديکھا کرے کوئي
ميں انتہائے عشق ہوں ، تو انتہائے حسن
ديکھے مجھے کہ تجھ کو تماشا کرے کوئي
عذر آفرين جرم محبت ہے حسن دوست
محشر ميں عذر تازہ نہ پيدا کرے کوئي
!چھپتي نہيں ہے يہ نگہ شوق ہم نشيں
پھر اور کس طرح انھيں ديکھا کر ے کوئي
اڑ بيٹھے کيا سمجھ کے بھلا طور پر کليم
طاقت ہو ديد کي تو تقاضا کرے کوئي
نظارے کو يہ جنبش مژگاں بھي بار ہے
نرگس کي آنکھ سے تجھے ديکھا کرے کوئي
کھل جائيں ، کيا مزے ہيں تمنائے شوق ميں
دو چار دن جو ميري تمنا کرے کوئي
کہوں کيا آرزوئے بے دلي مجھ کو کہاں تک ہے
مرے بازار کي رونق ہي سودائے زياں تک ہے
وہ مے کش ہوں فروغ مے سے خود گلزار بن جائوں
ہوائے گل فراق ساقي نامہرباں تک ہے
چمن افروز ہے صياد ميري خوشنوائي تک
رہي بجلي کي بے تابي ، سو ميرے آشياں تک ہے
وہ مشت خاک ہوں ، فيض پريشاني سے صحرا ہوں
نہ پوچھو ميري وسعت کي ، زميں سے آ سماں تک ہے
جرس ہوں ، نالہ خوابيدہ ہے ميرے ہر رگ و پے ميں
يہ خاموشي مري وقت رحيل کارواں تک ہے
سکون دل سے سامان کشود کار پيدا کر
کہ عقدہ خاطر گرداب کا آب رواں تک ہے
!چمن زار محبت ميں خموشي موت ہے بلبل
يہاں کي زندگي پابندي رسم فغاں تک ہے
جواني ہے تو ذوق ديد بھي ، لطف تمنا بھي
ہمارے گھر کي آبادي قيام ميہماں تک ہے
!زمانے بھر ميں رسوا ہوں مگر اے وائے ناداني
سمجھتا ہوں کہ ميرا عشق ميرے رازداں تک ہے
جنھيں ميں ڈھونڈتا تھا آسمانوں ميں زمينوں ميں
وہ نکلے ميرے ظلمت خانہ دل کے مکينوں ميں
حقيقت اپني آنکھوں پر نماياں جب ہوئي اپني
مکاں نکلا ہمارے خانہ دل کے مکينوں ميں
اگر کچھ آشنا ہوتا مذاق جبہہ سائي سے
تو سنگ آستاں کعبہ جا ملتا جبينوں ميں
کبھي اپنا بھي نظارہ کيا ہے تو نے اے مجنوں
کہ ليلي کي طرح تو خود بھي ہے محمل نشينوں ميں
مہينے وصل کے گھڑيوں کي صورت اڑتے جاتے ہيں
مگر گھڑياں جدائي کي گزرتي ہيں مہينوں ميں
مجھے روکے گا تو اے ناخدا کيا غرق ہونے سے
کہ جن کو ڈوبنا ہو ، ڈوب جاتے ہيں سفينوں ميں
چھپايا حسن کو اپنے کليم اللہ سے جس نے
وہي ناز آفريں ہے جلوہ پيرا نازنينوں ميں
جلا سکتي ہے شمع کشتہ کو موج نفس ان کي
الہي! کيا چھپا ہوتا ہے اہل دل کے سينوں ميں
تمنا درد دل کي ہو تو کر خدمت فقيروں کي
نہيں ملتا يہ گوہر بادشاہوں کے خزينوں ميں
نہ پوچھ ان خرقہ پوشوں کي ، ارادت ہو تو ديکھ ان کو
يد بيضا ليے بيٹھے ہيں اپني آستينوں ميں
ترستي ہے نگاہ نا رسا جس کے نظارے کو
وہ رونق انجمن کي ہے انھي خلوت گزينوں ميں
کسي ايسے شرر سے پھونک اپنے خرمن دل کو
کہ خورشيد قيامت بھي ہو تيرے خوشہ چينوں ميں
محبت کے ليے دل ڈھونڈ کوئي ٹوٹنے والا
يہ وہ مے ہے جسے رکھتے ہيں نازک آبگينوں ميں
سراپا حسن بن جاتا ہے جس کے حسن کا عاشق
بھلا اے دل حسيں ايسا بھي ہے کوئي حسينوں ميں
پھڑک اٹھا کوئي تيري ادائے 'ما عرفنا' پر
ترا رتبہ رہا بڑھ چڑھ کے سب ناز آفرينوں ميں
نماياں ہو کے دکھلا دے کبھي ان کو جمال اپنا
بہت مدت سے چرچے ہيں ترے باريک بينوں ميں
خموش اے دل! ، بھري محفل ميں چلانا نہيں اچھا
ادب پہلا قرينہ ہے محبت کے قرينوں ميں
برا سمجھوں انھيں مجھ سے تو ايسا ہو نہيں سکتا
کہ ميں خود بھي تو ہوں اقبال اپنے نکتہ چينوں ميں
ترے عشق کي انتہا چاہتا ہوں
مري سادگي ديکھ کيا چاہتا ہوں
ستم ہو کہ ہو وعدہ بے حجابي
کوئي بات صبر آزما چاہتا ہوں
يہ جنت مبارک رہے زاہدوں کو
کہ ميں آپ کا سامنا چاہتا ہوں
ذرا سا تو دل ہوں ، مگر شوخ اتنا
وہي لن تراني سنا چاہتا ہوں
کوئي دم کا مہماں ہوں اے اہل محفل
چراغ سحر ہوں ، بجھا چاہتا ہوں
بھري بزم ميں راز کي بات کہہ دي
بڑا بے ادب ہوں ، سزا چاہتا ہوں
کشادہ دست کرم جب وہ بے نياز کرے
نياز مند نہ کيوں عاجزي پہ ناز کرے
!بٹھا کے عرش پہ رکھا ہے تو نے اے واعظ
خدا وہ کيا ہے جو بندوں سے احتراز کرے
مري نگاہ ميں وہ رند ہي نہيں ساقي
جو ہوشياري و مستي ميں امتياز کرے
مدام گوش بہ دل رہ ، يہ ساز ہے ايسا
جو ہو شکستہ تو پيدا نوائے راز کرے
کوئي يہ پوچھے کہ واعظ کا کيا بگڑتا ہے
جو بے عمل پہ بھي رحمت وہ بے نياز کرے
سخن ميں سوز ، الہي کہاں سے آتا ہے
يہ چيز وہ ہے کہ پتھر کو بھي گداز کرے
تميز لالہ و گل سے ہے نالہء بلبل
جہاں ميں وانہ کوئي چشم امتياز کرے
غرور زہد نے سکھلا ديا ہے واعظ کو
کہ بندگان خدا پر زباں دراز کرے
ہوا ہو ايسي کہ ہندوستاں سے اے اقبال
اڑا کے مجھ کو غبار رہ حجاز کرے
سختياں کرتا ہوں دل پر ، غير سے غافل ہوں ميں
ہائے کيا اچھي کہي ظالم ہوں ميں ، جاہل ہوں ميں
ميں جبھي تک تھا کہ تيري جلوہ پيرائي نہ تھي
جو نمود حق سے مٹ جاتا ہے وہ باطل ہوں ميں
علم کے دريا سے نکلے غوطہ زن گوہر بدست
وائے محرومي! خزف چين لب ساحل ہوں ميں
ہے مري ذلت ہي کچھ ميري شرافت کي دليل
جس کي غفلت کو ملک روتے ہيں وہ غافل ہوں ميں
بزم ہستي! اپني آرائش پہ تو نازاں نہ ہو
تو تو اک تصوير ہے محفل کي اور محفل ہوں ميں
ڈھونڈتا پھرتا ہوں اے اقبال اپنے آپ کو
آپ ہي گويا مسافر ، آپ ہي منزل ہوں ميں
مجنوں نے شہر چھوڑا تو صحرا بھي چھوڑ دے
نظارے کي ہوس ہو تو ليلي بھي چھوڑ دے
واعظ! کمال ترک سے ملتي ہے ياں مراد
دنيا جو چھوڑ دي ہے تو عقبي بھي چھوڑ دے
تقليد کي روش سے تو بہتر ہے خودکشي
رستہ بھي ڈھونڈ ، خضر کا سودا بھي چھوڑ دے
مانند خامہ تيري زباں پر ہے حرف غير
بيگانہ شے پہ نازش بے جا بھي چھوڑ دے
لطف کلام کيا جو نہ ہو دل ميں درد عشق
بسمل نہيں ہے تو تو تڑپنا بھي چھوڑ دے
شبنم کي طرح پھولوں پہ رو ، اور چمن سے چل
اس باغ ميں قيام کا سودا بھي چھوڑ دے
ہے عاشقي ميں رسم الگ سب سے بيٹھنا
بت خانہ بھي ، حرم بھي ، کليسا بھي چھوڑ دے
سوداگري نہيں ، يہ عبادت خدا کي ہے
اے بے خبر! جزا کي تمنا بھي چھوڑ دے
اچھا ہے دل کے ساتھ رہے پاسبان عقل
ليکن کبھي کبھي اسے تنہا بھي چھوڑ دے
جينا وہ کيا جو ہو نفس غير پر مدار
شہرت کي زندگي کا بھروسا بھي چھوڑ دے
!شوخي سي ہے سوال مکرر ميں اے کليم
شرط رضا يہ ہے کہ تقاضا بھي چھوڑ دے
واعظ ثبوت لائے جو مے کے جواز ميں
اقبال کو يہ ضد ہے کہ پينا بھي چھوڑ دے
عروس شب کي زلفيں تھيں ابھي نا آشنا خم سے
ستارے آسماں کے بے خبر تھے لذت رم سے
قمر اپنے لباس نو ميں بيگانہ سا لگتا تھا
نہ تھا واقف ابھي گردش کے آئين مسلم سے
ابھي امکاں کے ظلمت خانے سے ابھري ہي تھي دنيا
مذاق زندگي پوشيدہ تھا پہنائے عالم سے
کمال نظم ہستي کي ابھي تھي ابتدا گويا
ہويدا تھي نگينے کي تمنا چشم خاتم سے
سنا ہے عالم بالا ميں کوئي کيمياگر تھا
صفا تھي جس کي خاک پا ميں بڑھ کر ساغر جم سے
لکھا تھا عرش کے پائے پہ اک اکسير کا نسخہ
چھپاتے تھے فرشتے جس کو چشم روح آدم سے
نگاہيں تاک ميں رہتي تھيں ليکن کيمياگر کي
وہ اس نسخے کو بڑھ کر جانتا تھا اسم اعظم سے
بڑھا تسبيح خواني کے بہانے عرش کي جانب
تمنائے دلي آخر بر آئي سعي پيہم سے
پھرايا فکر اجزا نے اسے ميدان امکاں ميں
چھپے گي کيا کوئي شے بارگاہ حق کے محرم سے
چمک تارے سے مانگي ، چاند سے داغ جگر مانگا
اڑائي تيرگي تھوڑي سي شب کي زلف برہم سے
تڑپ بجلي سے پائي ، حور سے پاکيزگي پائي
حرارت لي نفسہائے مسيح ابن مريم سے
ذرا سي پھر ربوبيت سے شان بے نيازي لي
ملک سے عاجزي ، افتادگي تقدير شبنم سے
پھر ان اجزا کو گھولا چشمہء حيواں کے پاني ميں
مرکب نے محبت نام پايا عرش اعظم سے
مہوس نے يہ پاني ہستي نوخيز پر چھڑکا
گرہ کھولي ہنر نے اس کے گويا کار عالم سے
ہوئي جنبش عياں ، ذروں نے لطف خواب کو چھوڑا
گلے ملنے لگے اٹھ اٹھ کے اپنے اپنے ہمدم سے
خرام ناز پايا آفتابوں نے ، ستاروں نے
چٹک غنچوں نے پائي ، داغ پائے لالہ زاروں نے
خدا سے حسن نے اک روز يہ سوال کيا
جہاں ميں کيوں نہ مجھے تو نے لازوال کيا
ملا جواب کہ تصوير خانہ ہے دنيا
شب دراز عدم کا فسانہ ہے دنيا
ہوئي ہے رنگ تغير سے جب نمود اس کي
وہي حسيں ہے حقيقت زوال ہے جس کي
کہيں قريب تھا ، يہ گفتگو قمر نے سني
فلک پہ عام ہوئي ، اختر سحر نے سني
سحر نے تارے سے سن کر سنائي شبنم کو
فلک کي بات بتا دي زميں کے محرم کو
بھر آئے پھول کے آنسو پيام شبنم سے
کلي کا ننھا سا دل خون ہو گيا غم سے
چمن سے روتا ہوا موسم بہار گيا
شباب سير کو آيا تھا ، سوگوار گيا
عشق نے کر دیا تجھے ذوقِ تپش سے آشنا
بزم کو مثلِ شمعِ بزم حاصلِ سوز و ساز دے
شانِ کرم پہ ہے مدار عشقِ گرہ کشاے کا
دَیر و حرم کی قید کیا! جس کو وہ بے نیاز دے
صورتِ شمع نُور کی مِلتی نہیں قبا اُسے
جس کو خدا نہ دہر میں گریۂ جاں گداز دے
تارے میں وہ، قمر میں وہ، جلوہ گہِ سحَر میں وہ
چشمِ نظارہ میں نہ تُو سُرمۂ امتیاز دے
عشق بلند بال ہے رسم و رہِ نیاز سے
حُسن ہے مستِ ناز اگر تُو بھی جوابِ ناز دے
پیرِ مغاں! فرنگ کی مے کا نشاط ہے اثر
اس میں وہ کیفِ غم نہیں، مجھ کو تو خانہ ساز دے
تجھ کو خبر نہیں ہے کیا! بزم کُہن بدل گئی
اب نہ خدا کے واسطے ان کو می مجاز دے
ہم بغل دريا سے ہے اے قطرہ بے تاب تو
پہلے گوہر تھا ، بنا اب گوہر ناياب تو
آہ کھولا کس ادا سے تو نے راز رنگ و بو
ميں ابھي تک ہوں اسير امتياز رنگ و بو
مٹ کے غوغا زندگي کا شورش محشر بنا
يہ شرارہ بجھ کے آتش خانہ آزر بنا
نفي ہستي اک کرشمہ ہے دل آگاہ کا
'لا' کے دريا ميں نہاں موتي ہے 'الااللہ' کا
چشم نابينا سے مخفي معني انجام ہے
تھم گئي جس دم تڑپ ، سيماب سيم خام ہے
توڑ ديتا ہے بت ہستي کو ابراہيم عشق
ہوش کا دارو ہے گويا مستي تسنيم عشق
اوروں کا ہے پيام اور ، ميرا پيام اور ہے
عشق کے درد مند کا طرز کلام اور ہے
طائر زير دام کے نالے تو سن چکے ہو تم
يہ بھي سنو کہ نالہء طائر بام اور ہے
آتي تھي کوہ سے صدا راز حيات ہے سکوں
کہتا تھا مور ناتواں لطف خرام اور ہے
جذب حرم سے ہے فروغ انجمن حجاز کا
اس کا مقام اور ہے ، اس کا نظام اور ہے
موت ہے عيش جاوداں ، ذوق طلب اگر نہ ہو
گردش آدمي ہے اور ، گردش جام اور ہے
شمع سحر يہ کہہ گئي سوز ہے زندگي کا ساز
غم کدہء نمود ميں شرط دوام اور ہے
بادہ ہے نيم رس ابھي ، شوق ہے نارسا ابھي
رہنے دو خم کے سر پہ تم خشت کليسيا ابھي
ستارہ صبح کا روتا تھا اور يہ کہتا تھا
ملي نگاہ مگر فرصت نظر نہ ملي
ہوئي ہے زندہ دم آفتاب سے ہر شے
اماں مجھي کو تہ دامن سحر نہ ملي
بساط کيا ہے بھلا صبح کے ستارے کي
نفس حباب کا ، تابندگي شرارے کي
!کہا يہ ميں نے کہ اے زيور جبين سحر
غم فنا ہے تجھے! گنبد فلک سے اتر
ٹپک بلندي گردوں سے ہمرہ شبنم
مرے رياض سخن کي فضا ہے جاں پرور
ميں باغباں ہوں ، محبت بہار ہے اس کي
بنا مثال ابد پائدار ہے اس کي
جس طرح ڈوبتي ہے کشتي سيمين قمر
نور خورشيد کے طوفان ميں ہنگام سحر
جسے ہو جاتا ہے گم نور کا لے کر آنچل
چاندني رات ميں مہتاب کا ہم رنگ کنول
جلوہ طور ميں جيسے يد بيضائے کليم
موجہ نکہت گلزار ميں غنچے کي شميم
ہے ترے سيل محبت ميں يونہي دل ميرا
تو جو محفل ہے تو ہنگامہء محفل ہوں ميں
حسن کي برق ہے تو ، عشق کا حاصل ہوں ميں
تو سحر ہے تو مرے اشک ہيں شبنم تيري
شام غربت ہوں اگر ميں تو شفق تو ميري
مرے دل ميں تري زلفوں کي پريشاني ہے
تري تصوير سے پيدا مري حيراني ہے
حسن کامل ہے ترا ، عشق ہے کامل ميرا
ہے مرے باغ سخن کے ليے تو باد بہار
ميرے بے تاب تخيل کو ديا تو نے قرار
جب سے آباد ترا عشق ہوا سينے ميں
نئے جوہر ہوئے پيدا مرے آئينے ميں
حسن سے عشق کي فطرت کو ہے تحريک کمال
تجھ سے سر سبز ہوئے ميري اميدوں کے نہال
تجھ کو دزديدہ نگاہي يہ سکھا دي کس نے
رمز آغاز محبت کي بتا دي کس نے
ہر ادا سے تيري پيدا ہے محبت کيسي
نيلي آنکھوں سے ٹپکتي ہے ذکاوت کيسي
ديکھتي ہے کبھي ان کو، کبھي شرماتي ہے
کبھي اٹھتي ہے ، کبھي ليٹ کے سو جاتي ہے
آنکھ تيري صفت آئنہ حيران ہے کيا
نور آگاہي سے روشن تري پہچان ہے کيا
مارتي ہے انھيں پونہچوں سے، عجب ناز ہے يہ
چھيڑ ہے ، غصہ ہے يا پيار کا انداز ہے يہ؟
شوخ تو ہوگي تو گودي سے اتاريں گے تجھے
گر گيا پھول جو سينے کا تو ماريں گے تجھے
کيا تجسس ہے تجھے ، کس کي تمنائي ہے
آہ! کيا تو بھي اسي چيز کي سودائي ہے
خاص انسان سے کچھ حسن کا احساس نہيں
صورت دل ہے يہ ہر چيز کے باطن ميں مکيں
شيشہ دہر ميں مانند مے ناب ہے عشق
روح خورشيد ہے، خون رگ مہتاب ہے عشق
دل ہر ذرہ ميں پوشيدہ کسک ہے اس کي
نور يہ وہ ہے کہ ہر شے ميں جھلک ہے اس کي
کہيں سامان مسرت، کہيں ساز غم ہے
کہيں گوہر ہے ، کہيں اشک ، کہيں شبنم ہے
جب دکھاتي ہے سحر عارض رنگيں اپنا
کھول ديتي ہے کلي سينہء زريں اپنا
جلوہ آشام ہے صبح کے مے خانے ميں
زندگي اس کي ہے خورشيد کے پيمانے ميں
سامنے مہر کے دل چير کے رکھ ديتي ہے
کس قدر سينہ شگافي کے مزے ليتي ہے
مرے خورشيد! کبھي تو بھي اٹھا اپني نقاب
بہر نظارہ تڑپتي ہے نگاہ بے تاب
تيرے جلوے کا نشيمن ہو مرے سينے ميں
عکس آباد ہو تيرا مرے آئينے ميں
زندگي ہو ترا نظارہ مرے دل کے ليے
روشني ہو تري گہوارہ مرے دل کے ليے
ذرہ ذرہ ہو مرا پھر طرب اندوز حيات
ہو عياں جوہر انديشہ ميں پھر سوز حيات
اپنے خورشيد کا نظارہ کروں دور سے ميں
صفت غنچہ ہم آغوش رہوں نور سے ميں
جان مضطر کي حقيقت کو نماياں کر دوں
دل کے پوشيدہ خيالوں کو بھي عرياں کر دوں
ڈرتے ڈرتے دم سحر سے
تارے کہنے لگے قمر سے
نظارے رہے وہي فلک پر
ہم تھک بھي گئے چمک چمک کر
کام اپنا ہے صبح و شام چلنا
چلنا چلنا ، مدام چلنا
بے تاب ہے اس جہاں کي ہر شے
کہتے ہيں جسے سکوں، نہيں ہے
رہتے ہيں ستم کش سفر سب
تارے، انساں، شجر، حجر سب
ہوگا کبھي ختم يہ سفر کيا
منزل کبھي آئے گي نظر کيا
کہنے لگا چاند ، ہم نشينو
!اے مزرع شب کے خوشہ چينو
جنبش سے ہے زندگي جہاں کي
يہ رسم قديم ہے يہاں کي
ہے دوڑتا اشہب زمانہ
کھا کھا کے طلب کا تازيانہ
اس رہ ميں مقام بے محل ہے
پوشيدہ قرار ميں اجل ہے
چلنے والے نکل گئے ہيں
جو ٹھہرے ذرا، کچل گئے ہيں
انجام ہے اس خرام کا حسن
آغاز ہے عشق، انتہا حسن
جستجو جس گل کي تڑپاتي تھي اے بلبل مجھے
خوبي قسمت سے آخر مل گيا وہ گل مجھے
خود تڑپتا تھا ، چمن والوں کو تڑپاتا تھا ميں
تجھ کو جب رنگيں نوا پاتا تھا ، شرماتا تھا ميں
ميرے پہلو ميں دل مضطر نہ تھا ، سيماب تھا
ارتکاب جرم الفت کے ليے بے تاب تھا
نامرادي محفل گل ميں مري مشہور تھي
صبح ميري آئنہ دار شب ديجور تھي
از نفس در سينہء خوں گشتہ نشتر داشتم
زير خاموشي نہاں غوغائے محشر داشتم
اب تاثر کے جہاں ميں وہ پريشاني نہيں
اہل گلشن پر گراں ميري غزل خواني نہيں
عشق کي گرمي سے شعلے بن گئے چھالے مرے
کھليتے ہيں بجليوں کے ساتھ اب نالے مرے
غازئہ الفت سے يہ خاک سيہ آئينہ ہے
اور آئينے ميں عکس ہمدم ديرينہ ہے
قيد ميں آيا تو حاصل مجھ کو آزادي ہوئي
دل کے لٹ جانے سے ميرے گھر کي آبادي ہوئي
ضو سے اس خورشيد کي اختر مرا تابندہ ہے
چاندني جس کے غبار راہ سے شرمندہ ہے
يک نظر کر دي و آداب فنا آموختي
اے خنک روزے کہ خاشاک مرا واسوختي
جس کي نمود ديکھي چشم ستارہ بيں نے
خورشيد ميں ، قمر ميں ، تاروں کي انجمن ميں
صوفي نے جس کو دل کے ظلمت کدے ميں پايا
شاعر نے جس کو ديکھا قدرت کے بانکپن ميں
جس کي چمک ہے پيدا ، جس کي مہک ہويدا
شبنم کے موتيوں ميں ، پھولوں کے پيرہن ميں
صحرا کو ہے بسايا جس نے سکوت بن کر
ہنگامہ جس کے دم سے کاشانہ چمن ميں
ہر شے ميں ہے نماياں يوں تو جمال اس کا
آنکھوں ميں ہے سليمي تيري کمال اس کا
(1)
ہے عجب مجموعہء اضداد اے اقبال تو
رونق ہنگامہء محفل بھي ہے، تنہا بھي ہے
!تيرے ہنگاموں سے اے ديوانہ رنگيں نوا
زينت گلشن بھي ہے ، آرائش صحرا بھي ہے
ہم نشيں تاروں کا ہے تو رفعت پرواز سے
اے زميں فرسا ، قدم تيرا فلک پيما بھي ہے
عين شغل ميں پيشاني ہے تيري سجدہ ريز
کچھ ترے مسلک ميں رنگ مشرب مينا بھي ہے
مثل بوئے گل لباس رنگ سے عرياں ہے تو
ہے تو حکمت آفريں ، ليکن تجھے سودا بھي ہے
جانب منزل رواں بے نقش پا مانند موج
اور پھر افتادہ مثل ساحل دريا بھي ہے
حسن نسواني ہے بجلي تيري فطرت کے ليے
پھر عجب يہ ہے کہ تيرا عشق بے پروا بھي ہے
تيري ہستي کا ہے آئين تفنن پر مدار
تو کبھي ايک آستانے پر جبيں فرسا بھي ہے ؟
ہے حسينوں ميں وفا نا آشنا تيرا خطاب
اے تلون کيش! تو مشہور بھي ، رسوا بھي ہے
لے کے آيا ہے جہاں ميں عادت سيماب تو
تيري بے تابي کے صدقے، ہے عجب بے تاب تو
(2)
عشق کي آشفتگي نے کر ديا صحرا جسے
مشت خاک ايسي نہاں زير قبا رکھتا ہوں ميں
ہيں ہزاروں اس کے پہلو ، رنگ ہر پہلو کا اور
سينے ميں ہيرا کوئي ترشا ہوا رکھتا ہوں ميں
دل نہيں شاعر کا ، ہے کيفيتوں کي رستخيز
کيا خبر تجھ کو درون سينہ کيا رکھتا ہوں ميں
آرزو ہر کيفيت ميں اک نئے جلوے کي ہے
مضطرب ہوں ، دل سکوں نا آشنا رکھتا ہوں ميں
گو حسين تازہ ہے ہر لحظہ مقصود نظر
حسن سے مضبوط پيمان وفا رکھتا ہوں ميں
بے نيازي سے ہے پيدا ميري فطرت کا نياز
سوز و ساز جستجو مثل صبا رکھتا ہوں ميں
موجب تسکيں تماشائے شرار جستہ اے
ہو نہيں سکتا کہ دل برق آشنا رکھتا ہوں ميں
ہر تقاضا عشق کي فطرت کا ہو جس سے خموش
آہ! وہ کامل تجلي مدعا رکھتا ہوں ميں
جستجو کل کي ليے پھرتي ہے اجزا ميں مجھے
حسن بے پاياں ہے ، درد لادوا رکھتا ہوں ميں
زندگي الفت کي درد انجاميوں سے ہے مري
عشق کو آزاد دستور وفا رکھتا ہوں ميں
سچ اگر پوچھے تو افلاس تخيل ہے وفا
دل ميں ہر دم اک نيا محشر بپا رکھتا ہوں ميں
فيض ساقي شبنم آسا ، ظرف دل دريا طلب
تشنہء دائم ہوں آتش زير پا رکھتا ہوں ميں
مجھ کو پيدا کر کے اپنا نکتہ چيں پيدا کيا
نقش ہوں ، اپنے مصور سے گلا رکھتا ہوں ميں
محفل ہستي ميں جب ايسا تنک جلوہ تھا حسن
پھر تخيل کس ليے لا انتہا رکھتا ہوں ميں
در بيابان طلب پيوستہ مي کوشيم ما
موج بحريم و شکست خويش بر دوشيم ما
فرقت آفتاب ميں کھاتي ہے پيچ و تاب صبح
چشم شفق ہے خوں فشاں اختر شام کے ليے
رہتي ہے قيس روز کو ليلي شام کي ہوس
اختر صبح مضطرب تاب دوام کے ليے
کہتا تھا قطب آسماں قافلہ نجوم سے
ہمرہو ، ميں ترس گيا لطف خرام کے ليے
سوتوں کو نديوں کا شوق ، بحر کا نديوں کو عشق
موجہء بحر کو تپش ماہ تمام کے ليے
حسن ازل کہ پردہء لالہ و گل ميں ہے نہاں
کہتے ہيں بے قرار ہے جلوہء عام کے ليے
راز حيات پو چھ لے خضر خجستہ گام سے
زندہ ہر ايک چيز ہے کوشش ناتمام سے
زندگاني ہے مري مثل رباب خاموش
جس کي ہر رنگ کے نغموں سے ہے لبريز آغوش
بربط کون و مکاں جس کي خموشي پہ نثار
جس کے ہر تار ميں ہيں سينکڑوں نغموں کے مزار
محشرستان نوا کا ہے اميں جس کا سکوت
اور منت کش ہنگامہ نہيں جس کا سکوت
آہ! اميد محبت کي بر آئي نہ کبھي
چوٹ مضراب کي اس ساز نے کھائي نہ کبھي
مگر آتي ہے نسيم چمن طور کبھي
سمت گردوں سے ہوائے نفس حور کبھي
چھيڑ آہستہ سے ديتي ہے مرا تار حيات
جس سے ہوتي ہے رہا روح گرفتار حيات
نغمہ ياس کي دھيمي سي صدا اٹھتي ہے
اشک کے قافلے کو بانگ درا اٹھتي ہے
جس طرح رفعت شبنم ہے مذاق رم سے
ميري فطرت کي بلندي ہے نوائے غم سے
نہ مجھ سے کہہ کہ اجل ہے پيام عيش و سرور
نہ کھينچ نقشہ کيفيت شراب طہور
فراق حور ميں ہو غم سے ہمکنار نہ تو
پري کو شيشہ الفاظ ميں اتار نہ تو
مجھے فريفتہ ساقي جميل نہ کر
بيان حور نہ کر ، ذکر سلسبيل نہ کر
مقام امن ہے جنت ، مجھے کلام نہيں
شباب کے ليے موزوں ترا پيام نہيں
شباب ، آہ! کہاں تک اميدوار رہے
وہ عيش ، عيش نہيں ، جس کا انتظار رہے
وہ حسن کيا جو محتاج چشم بينا ہو
نمود کے ليے منت پذير فردا ہو
عجيب چيز ہے احساس زندگاني کا
عقيدہ 'عشرت امروز' ہے جواني کا
!قدرت کا عجيب يہ ستم ہے
انسان کو راز جو بنايا
راز اس کي نگاہ سے چھپايا
بے تاب ہے ذوق آگہي کا
کھلتا نہيں بھيد زندگي کا
حيرت آغاز و انتہا ہے
آئينے کے گھر ميں اور کيا ہے
ہے گرم خرام موج دريا
دريا سوئے سجر جادہ پيما
بادل کو ہوا اڑا رہي ہے
شانوں پہ اٹھائے لا رہي ہے
تارے مست شراب تقدير
زندان فلک ميں پا بہ زنجير
خورشيد ، وہ عابد سحر خيز
لانے والا پيام بر خيز
مغرب کي پہاڑيوں ميں چھپ کر
پيتا ہے مے شفق کا ساغر
لذت گير وجود ہر شے
سر مست مے نمود ہر شے
کوئي نہيں غم گسار انساں
جلوہ حسن کہ ہے جس سے تمنا بے تاب
پالتا ہے جسے آغوش تخيل ميں شباب
ابدي بنتا ہے يہ عالم فاني جس سے
ايک افسانہ رنگيں ہے جواني جس سے
جو سکھاتا ہے ہميں سر بہ گريباں ہونا
منظر عالم حاضر سے گريزاں ہونا
دور ہو جاتي ہے ادراک کي خامي جس سے
عقل کرتي ہے تاثر کي غلامي جس سے
آہ! موجود بھي وہ حسن کہيں ہے کہ نہيں
خاتم دہر ميں يا رب وہ نگيں ہے کہ نہيں
خاموش ہے چاندني قمر کي
شاخيں ہيں خموش ہر شجر کي
وادي کے نوا فروش خاموش
کہسار کے سبز پوش خاموش
فطرت بے ہوش ہو گئي ہے
آغوش ميں شب کے سو گئي ہے
کچھ ايسا سکوت کا فسوں ہے
نيکر کا خرام بھي سکوں ہے
تاروں کا خموش کارواں ہے
يہ قافلہ بے درا رواں ہے
خاموش ہيں کوہ و دشت و دريا
قدرت ہے مراقبے ميں گويا
اے دل! تو بھي خموش ہو جا
آغوش ميں غم کو لے کے سو جا
تنہائي شب ميں ہے حزيں کيا
!انجم نہيں تيرے ہم نشيں کيا
يہ رفعت آسمان خاموش
خوابيدہ زميں ، جہان خاموش
يہ چاند ، يہ دشت و در ، يہ کہسار
فطرت ہے تمام نسترن زار
موتي خوش رنگ ، پيارے پيارے
يعني ترے آنسوئوں کے تارے
!کس شے کي تجھے ہوس ہے اے دل
!قدرت تري ہم نفس ہے اے دل
سن اے طلب گار درد پہلو! ميں ناز ہوں ، تو نياز ہو جا
ميں غزنوي سومنات دل کا ، تو سراپا اياز ہو جا
نہيں ہے وابستہ زير گردوں کمال شان سکندري سے
تمام ساماں ہے تيرے سينے ميں ، تو بھي آئينہ ساز ہو جا
غرض ہے پيکار زندگي سے کمال پائے ہلال تيرا
جہاں کا فرض قديم ہے تو ، ادا مثال نماز ہو جا
نہ ہو قناعت شعار گلچيں! اسي سے قائم ہے شان تيري
وفور گل ہے اگر چمن ميں تو اور دامن دراز ہو جا
گئے وہ ايام ، اب زمانہ نہيں ہے صحرانورديوں کا
جہاں ميں مانند شمع سوزاں ميان محفل گداز ہو جا
وجود افراد کا مجازي ہے ، ہستي قوم ہے حقيقي
فدا ہو ملت پہ يعني آتش زن طلسم مجاز ہو جا
يہ ہند کے فرقہ ساز اقبال آزري کر رہے ہيں گويا
بچا کے دامن بتوں سے اپنا غبار راہ حجاز ہو جا
تلاش گوشہء عزلت ميں پھر رہا ہوں ميں
يہاں پہاڑ کے دامن ميں آ چھپا ہوں ميں
شکستہ گيت ميں چشموں کے دلبري ہے کمال
دعائے طفلک گفتار آزما کي مثال
ہے تخت لعل شفق پر جلوس اختر شام
بہشت ديدہء بينا ہے حسن منظر شام
سکوت شام جدائي ہوا بہانہ مجھے
کسي کي ياد نے سکھلا ديا ترانہ مجھے
يہ کيفيت ہے مري جان ناشکيبا کي
مري مثال ہے طفل صغير تنہا کي
اندھيري رات ميں کرتا ہے وہ سرود آغاز
صدا کو اپني سمجھتا ہے غير کي آواز
يونہي ميں دل کو پيام شکيب ديتا ہوں
شب فراق کو گويا فريب ديتا ہوں
اٹھ کہ ظلمت ہوئي پيدا افق خاور پر
بزم ميں شعلہ نوائي سے اجالا کر ديں
ايک فرياد ہے مانند سپند اپني بساط
اسي ہنگامے سے محفل تہ و بالا کر ديں
اہل محفل کو دکھا ديں اثر صيقل عشق
سنگ امروز کو آئينہ فردا کر ديں
جلوہ يوسف گم گشتہ دکھا کر ان کو
تپش آمادہ تر از خون زليخا کر ديں
اس چمن کو سبق آئين نمو کا دے کر
قطرہ شبنم بے مايہ کو دريا کر ديں
رخت جاں بت کدہء چيں سے اٹھا ليں اپنا
سب کو محو رخ سعدي و سليمي کر ديں
ديکھ! يثرب ميں ہوا ناقہ ليلي بيکار
قيس کو آرزوئے نو سے شناسا کر ديں
بادہ ديرينہ ہو اور گرم ہو ايسا کہ گداز
جگر شيشہ و پيمانہ و مينا کر ديں
گرم رکھتا تھا ہميں سردي مغرب ميں جو داغ
چير کر سينہ اسے وقف تماشا کر ديں
شمع کي طرح جييں بزم گہ عالم ميں
خود جليں ، ديدہ اغيار کو بينا کر ديں
ہر چہ در دل گذرد وقف زباں دارد شمع ''
''سوختن نيست خيالے کہ نہاں دارد شمع
رو لے اب دل کھول کر اے ديدہء خوننابہ بار
وہ نظر آتا ہے تہذيب حجازي کا مزار
تھا يہاں ہنگامہ ان صحرا نشينوں کا کبھي
بحر بازي گاہ تھا جن کے سفينوں کا کبھي
زلزلے جن سے شہنشاہوں کے درباروں ميں تھے
بجليوں کے آشيانے جن کي تلواروں ميں تھے
اک جہان تازہ کا پيغام تھا جن کا ظہور
کھا گئي عصر کہن کو جن کي تيغ ناصبور
مردہ عالم زندہ جن کي شورش قم سے ہوا
آدمي آزاد زنجير توہم سے ہوا
غلغلوں سے جس کے لذت گير اب تک گوش ہے
کيا وہ تکبير اب ہميشہ کے ليے خاموش ہے؟
آہ اے سسلي! سمندرکي ہے تجھ سے آبرو
رہنما کي طرح اس پاني کے صحرا ميں ہے تو
زيب تيرے خال سے رخسار دريا کو رہے
تيري شمعوں سے تسلي بحر پيما کو رہے
ہو سبک چشم مسافر پر ترا منظر مدام
موج رقصاں تيرے ساحل کي چٹانوں پر مدام
تو کبھي اس قوم کي تہذيب کا گہوارہ تھا
حسن عالم سوز جس کا آتش نظارہ تھا
نالہ کش شيراز کا بلبل ہوا بغداد پر
داغ رويا خون کے آنسو جہاں آباد پر
آسماں نے دولت غرناطہ جب برباد کي
ابن بدروں کے دل ناشاد نے فرياد کي
غم نصيب اقبال کو بخشا گيا ماتم ترا
چن ليا تقدير نے وہ دل کہ تھا محرم ترا
ہے ترے آثار ميں پوشيدہ کس کي داستاں
تيرے ساحل کي خموشي ميں ہے انداز بياں
درد اپنا مجھ سے کہہ ، ميں بھي سراپا درد ہوں
جس کي تو منزل تھا ، ميں اس کارواں کي گرد ہوں
رنگ تصوير کہن ميں بھر کے دکھلا دے مجھے
قصہ ايام سلف کا کہہ کے تڑپا دے مجھے
ميں ترا تحفہ سوئے ہندوستاں لے جاؤں گا
خود يہاں روتا ہوں ، اوروں کو وہاں رلوائوں گا
زندگي انساں کي اک دم کے سوا کچھ بھي نہيں
دم ہوا کي موج ہے ، رم کے سوا کچھ بھي نہيں
گل تبسم کہہ رہا تھا زندگاني کو مگر
شمع بولي ، گريہء غم کے سوا کچھ بھي نہيں
راز ہستي راز ہے جب تک کوئي محرم نہ ہو
کھل گيا جس دم تو محرم کے سوا کچھ بھي نہيں
زائران کعبہ سے اقبال يہ پوچھے کوئي
!کيا حرم کا تحفہ زمزم کے سوا کچھ بھي نہيں
الہي عقل خجستہ پے کو ذرا سي ديوانگي سکھا دے
اسے ہے سودائے بخيہ کاري ، مجھے سر پيرہن نہيں ہے
ملا محبت کا سوز مجھ کو تو بولے صبح ازل فرشتے
مثال شمع مزار ہے تو ، تري کوئي انجمن نہيں ہے
!يہاں کہاں ہم نفس ميسر ، يہ ديس نا آشنا ہے اے دل
وہ چيز تو مانگتا ہے مجھ سے کہ زير چرخ کہن نہيں ہے
نرالا سارے جہاں سے اس کو عرب کے معمار نے بنايا
بنا ہمارے حصار ملت کي اتحاد وطن نہيں ہے
کہاں کا آنا ، کہاں کا جانا ، فريب ہے امتياز عقبي
نمود ہر شے ميں ہے ہماري ، کہيں ہمارا وطن نہيں ہے
مدير 'مخزن' سے کوئي اقبال جا کے ميرا پيام کہہ دے
جوکام کچھ کر رہي ہيں قوميں ، انھيں مذاق سخن نہيں ہے
زمانہ ديکھے گا جب مرے دل سے محشر اٹھے گا گفتگو کا
مري خموشي نہيں ہے ، گويا مزار ہے حرف آرزو کا
جو موج دريا لگي يہ کہنے ، سفر سے قائم ہے شان ميري
گہر يہ بولا صدف نشيني ہے مجھ کو سامان آبرو کا
نہ ہو طبيعت ہي جن کي قابل ، وہ تربيت سے نہيں سنورتے
ہوا نہ سرسبز رہ کے پاني ميں عکس سرو کنار جو کا
کوئي دل ايسا نظر نہ آيا نہ جس ميں خوابيدہ ہو تمنا
الہي تيرا جہان کيا ہے نگار خانہ ہے آرزو کا
کھلا يہ مر کر کہ زندگي اپني تھي طلسم ہوس سراپا
جسے سمجھتے تھے جسم خاکي ، غبار تھا کوئے آرزو کا
اگر کوئي شے نہيں ہے پنہاں تو کيوں سراپا تلاش ہوں ميں
نگہ کو نظارے کي تمنا ہے، دل کو سودا ہے جستجو کا
چمن ميں گلچيں سے غنچہ کہتا تھا ، اتنا بيدرد کيوں ہے انساں
تري نگاہوں ميں ہے تبسم شکستہ ہونا مرے سبو کا
رياض ہستي کے ذرے ذرے سے ہے محبت کا جلوہ پيدا
حقيقت گل کو تو جو سمجھے تو يہ بھي پيماں ہے رنگ و بو کا
تمام مضموں مرے پرانے ، کلام ميرا خطا سراپا
ہنر کوئي ديکھتا ہے مجھ ميں تو عيب ہے ميرے عيب جو کا
سپاس شرط ادب ہے ورنہ کرم ترا ہے ستم سے بڑھ کر
ذرا سا اک دل ديا ہے ، وہ بھي فريب خوردہ ہے آرزو کا
کمال وحدت عياں ہے ايسا کہ نوک نشتر سے تو جو چھيڑے
يقيں ہے مجھ کو گرے رگ گل سے قطرہ انسان کے لہو کا
گيا ہے تقليد کا زمانہ ، مجاز رخت سفر اٹھائے
ہوئي حقيقت ہي جب نماياں تو کس کو يارا ہے گفتگو کا
جو گھر سے اقبال دور ہوں ميں ، تو ہوں نہ محزوں عزيز ميرے
مثال گوہر وطن کي فرقت کمال ہے ميري آبرو کا
چمک تيري عياں بجلي ميں ، آتش ميں ، شرارے ميں
جھلک تيري ہويدا چاند ميں ،سورج ميں ، تارے ميں
بلندي آسمانوں ميں ، زمينوں ميں تري پستي
رواني بحر ميں ، افتادگي تيري کنارے ميں
شريعت کيوں گريباں گير ہو ذوق تکلم کي
چھپا جاتا ہوں اپنے دل کا مطلب استعارے ميں
جو ہے بيدار انساں ميں وہ گہري نيند سوتا ہے
شجر ميں ، پھول ميں ، حيواں ميں ، پتھر ميں ، ستارے ميں
مجھے پھونکا ہے سوز قطرہء اشک محبت نے
غضب کي آگ تھي پاني کے چھوٹے سے شرارے ميں
نہيں جنس ثواب آخرت کي آرزو مجھ کو
وہ سوداگر ہوں ، ميں نے نفع ديکھا ہے خسارے ميں
سکوں نا آشنا رہنا اسے سامان ہستي ہے
تڑپ کس دل کي يا رب چھپ کے آ بيٹھي ہے پارے ميں
صدائے لن تراني سن کے اے اقبال ميں چپ ہوں
تقاضوں کي کہاں طاقت ہے مجھ فرقت کے مارے ميں
يوں تو اے بزم جہاں! دلکش تھے ہنگامے ترے
اک ذرا افسردگي تيرے تماشائوں ميں تھي
پا گئي آسودگي کوئے محبت ميں وہ خاک
مدتوں آوارہ جو حکمت کے صحرائوں ميں تھي
کس قدر اے مے! تجھے رسم حجاب آئي پسند
پردہ انگور سے نکلي تو مينائوں ميں تھي
حسن کي تاثير پر غالب نہ آ سکتا تھا علم
اتني ناداني جہاں کے سارے دانائوں ميں تھي
ميں نے اے اقبال يورپ ميں اسے ڈھونڈا عبث
بات جو ہندوستاں کے ماہ سيمائوں ميں تھي
مثال پرتو مے ، طوف جام کرتے ہيں
يہي نماز ادا صبح و شام کرتے ہيں
خصوصيت نہيں کچھ اس ميں اے کليم تري
شجر حجر بھي خدا سے کلام کرتے ہيں
نيا جہاں کوئي اے شمع ڈھونڈيے کہ يہاں
ستم کش تپش ناتمام کرتے ہيں
بھلي ہے ہم نفسو اس چمن ميں خاموشي
کہ خوشنوائوں کو پابند دام کرتے ہيں
غرض نشاط ہے شغل شراب سے جن کي
حلال چيز کو گويا حرام کرتے ہيں
!بھلا نبھے گي تري ہم سے کيونکر اے واعظ
کہ ہم تو رسم محبت کو عام کرتے ہيں
!الہي سحر ہے پيران خرقہ پوش ميں کيا
کہ اک نظر سے جوانوں کو رام کرتے ہيں
ميں ان کي محفل عشرت سے کانپ جاتا ہوں
جو گھر کو پھونک کے دنيا ميں نام کرتے ہيں
!ہرے رہو وطن مازني کے ميدانو
جہاز پر سے تمھيں ہم سلام کرتے ہيں
جو بے نماز کبھي پڑھتے ہيں نماز اقبال
بلا کے دير سے مجھ کو امام کرتے ہيں
زمانہ آيا ہے بے حجابي کا ، عام ديدار يار ہو گا
سکوت تھا پردہ دار جس کا ، وہ راز اب آشکار ہوگا
گزر گيا اب وہ دور ساقي کہ چھپ کے پيتے تھے پينے والے
بنے گا سارا جہان مے خانہ ، ہر کوئي بادہ خوار ہو گا
کبھي جو آوارہ جنوں تھے ، وہ بستيوں ميں پھر آ بسيں گے
برہنہ پائي وہي رہے گي مگر نيا خارزار ہو گا
سنا ديا گوش منتظر کو حجاز کي خامشي نے آخر
جو عہد صحرائيوں سے باندھا گيا تھا ، پھر استوار ہو گا
نکل کے صحرا سے جس نے روما کي سلطنت کو الٹ ديا تھا
سنا ہے يہ قدسيوں سے ميں نے ، وہ شير پھر ہوشيار ہو گا
کيا مرا تذکرہ جوساقي نے بادہ خواروں کي انجمن ميں
تو پير ميخانہ سن کے کہنے لگا کہ منہ پھٹ ہے ، خوار ہو گا
ديار مغرب کے رہنے والو! خدا کي بستي دکاں نہيں ہے
کھرا جسے تم سمجھ رہے ہو ، وہ اب زر کم عيار ہو گا
تمھاري تہذيب اپنے خنجر سے آپ ہي خود کشي کرے گي
جوشاخ نازک پہ آشيانہ بنے گا ، ناپائدار ہو گا
سفينہ برگ گل بنا لے گا قافلہ مور ناتواں کا
ہزار موجوں کي ہو کشاکش مگر يہ دريا سے پار ہو گا
چمن ميں لالہ دکھاتا پھرتا ہے داغ اپنا کلي کلي کو
يہ جانتا ہے کہ اس دکھاوے سے دل جلوں ميں شمار ہو گا
جو ايک تھا اے نگاہ تو نے ہزار کر کے ہميں دکھايا
يہي اگر کيفيت ہے تيري تو پھر کسے اعتبار ہو گا
کہا جوقمري سے ميں نے اک دن ، يہاں کے آزاد پا بہ گل ہيں
توغنچے کہنے لگے ، ہمارے چمن کا يہ رازدار ہو گا
خدا کے عاشق تو ہيں ہزاروں ، بنوں ميں پھرتے ہيں مارے مارے
ميں اس کا بندہ بنوں گا جس کو خدا کے بندوں سے پيار ہو گا
يہ رسم بزم فنا ہے اے دل! گناہ ہے جنبش نظر بھي
رہے گي کيا آبرو ہماري جو تو يہاں بے قرار ہو گا
ميں ظلمت شب ميں لے کے نکلوں گا اپنے درماندہ کارواں کو
شررفشاں ہوگي آہ ميري ، نفس مرا شعلہ بار ہو گا
نہيں ہے غير از نمود کچھ بھي جو مدعا تيري زندگي کا
تو اک نفس ميں جہاں سے مٹنا تجھے مثال شرار ہو گا
نہ پوچھ اقبال کا ٹھکانا ابھي وہي کيفيت ہے اس کي
کہيں سر رہ گزار بيٹھا ستم کش انتظار ہو گا
سرزميں دلي کي مسجود دل غم ديدہ ہے
ذرے ذرے ميں لہو اسلاف کا خوابيدہ ہے
پاک اس اجڑے گلستاں کي نہ ہو کيونکر زميں
خانقاہ عظمت اسلام ہے يہ سرزميں
سوتے ہيں اس خاک ميں خير الامم کے تاجدار
نظم عالم کا رہا جن کي حکومت پر مدار
دل کو تڑپاتي ہے اب تک گرمي محفل کي ياد
جل چکا حاصل مگر محفوظ ہے حاصل کي ياد
ہے زيارت گاہ مسلم گو جہان آباد بھي
اس کرامت کا مگر حق دار ہے بغداد بھي
يہ چمن وہ ہے کہ تھا جس کے ليے سامان ناز
لالہ صحرا جسے کہتے ہيں تہذيب حجاز
خاک اس بستي کي ہو کيونکر نہ ہمدوش ارم
جس نے ديکھے جانشينان پيمبر کے قدم
جس کے غنچے تھے چمن ساماں ، وہ گلشن ہے يہي
کاپنتا تھا جن سے روما ، ان کا مدفن ہے يہي
ہے زمين قرطبہ بھي ديدہء مسلم کا نور
ظلمت مغرب ميں جو روشن تھي مثل شمع طور
بجھ کے بزم ملت بيضا پريشاں کر گئي
اور ديا تہذيب حاضر کا فروزاں کر گئي
قبر اس تہذيب کي يہ سر زمين پاک ہے
جس سے تاک گلشن يورپ کي رگ نم ناک ہے
خطہ قسطنطنيہ يعني قيصر کا ديار
مہدي امت کي سطوت کا نشان پائدار
صورت خاک حرم يہ سر زميں بھي پاک ہے
آستان مسند آرائے شہ لولاک ہے
نکہت گل کي طرح پاکيزہ ہے اس کي ہوا
تربت ايوب انصاري سے آتي ہے صدا
اے مسلماں! ملت اسلام کا دل ہے يہ شہر
سينکڑوں صديوں کي کشت و خوں کا حاصل ہے يہ شہر
وہ زميں ہے تو مگر اے خواب گاہ مصطفي
ديد ہے کعبے کو تيري حج اکبر سے سوا
خاتم ہستي ميں تو تاباں ہے مانند نگيں
اپني عظمت کي ولادت گاہ تھي تيري زميں
تجھ ميں راحت اس شہنشاہ معظم کو ملي
جس کے دامن ميں اماں اقوام عالم کو ملي
نام ليوا جس کے شاہنشاہ عالم کے ہوئے
جانشيں قيصر کے ، وارث مسند جم کے ہوئے
ہے اگر قوميت اسلام پابند مقام
ہند ہي بنياد ہے اس کي ، نہ فارس ہے ، نہ شام
آہ يثرب! ديس ہے مسلم کا تو ، ماوا ہے تو
نقطہ جاذب تاثر کي شعاعوں کا ہے تو
جب تلک باقي ہے تو دنيا ميں ، باقي ہم بھي ہيں
صبح ہے تو اس چمن ميں گوہر شبنم بھي ہيں
قمر کا خوف کہ ہے خطرہء سحر تجھ کو
مآل حسن کي کيا مل گئي خبر تجھ کو؟
متاع نور کے لٹ جانے کا ہے ڈر تجھ کو
ہے کيا ہراس فنا صورت شرر تجھ کو؟
زميں سے دور ديا آسماں نے گھر تجھ کو
مثال ماہ اڑھائي قبائے زر تجھ کو
!غضب ہے پھر تري ننھي سي جان ڈرتي ہے
تمام رات تري کانپتے گزرتي ہے
چمکنے والے مسافر! عجب يہ بستي ہے
جو اوج ايک کا ہے ، دوسرے کي پستي ہے
اجل ہے لاکھوں ستاروں کي اک ولادت مہر
فنا کي نيند مے زندگي کي مستي ہے
وداع غنچہ ميں ہے راز آفرينش گل
!عدم ، عدم ہے کہ آئينہ دار ہستي ہے
سکوں محال ہے قدرت کے کارخانے ميں
ثبات ايک تغير کو ہے زمانے ميں
آئے جو قراں ميں دو ستارے
کہنے لگا ايک ، دوسرے سے
يہ وصل مدام ہو تو کيا خوب
انجام خرام ہو تو کيا خوب
تھوڑا سا جو مہرباں فلک ہو
ہم دونوں کي ايک ہي چمک ہو
ليکن يہ وصال کي تمنا
پيغام فراق تھي سراپا
گردش تاروں کا ہے مقدر
ہر ايک کي راہ ہے مقرر
ہے خواب ثبات آشنائي
آئين جہاں کا ہے جدائي
آسماں ، بادل کا پہنے خرقہء ديرينہ ہے
کچھ مکدر سا جبين ماہ کا آئينہ ہے
چاندني پھيکي ہے اس نظارہء خاموش ميں
صبح صادق سو رہي ہے رات کي آغوش ميں
کس قدر اشجار کي حيرت فزا ہے خامشي
بربط قدرت کي دھيمي سي نوا ہے خامشي
باطن ہر ذرہء عالم سراپا درد ہے
اور خاموشي لب ہستي پہ آہ سرد ہے
آہ! جولاں گاہ عالم گير يعني وہ حصار
دوش پر اپنے اٹھائے سيکڑوں صديوں کا بار
زندگي سے تھا کبھي معمور ، اب سنسان ہے
يہ خموشي اس کے ہنگاموں کا گورستاں ہے
اپنے سکان کہن کي خاک کا دلدادہ ہے
کوہ کے سر پر مثال پاسباں استادہ ہے
ابر کے روزن سے وہ بالائے بام آسماں
ناظر عالم ہے نجم سبز فام آسماں
خاک بازي وسعت دنيا کا ہے منظر اسے
داستاں ناکامي انساں کي ہے ازبر اسے
ہے ازل سے يہ مسافر سوئے منزل جا رہا
آسماں سے انقلابوں کا تماشا ديکھتا
گو سکوں ممکن نہيں عالم ميں اختر کے ليے
فاتحہ خواني کو يہ ٹھہرا ہے دم بھر کے ليے
رنگ و آب زندگي سے گل بدامن ہے زميں
سينکڑوں خوں گشتہ تہذيبوں کا مدفن ہے زميں
خواب گہ شاہوں کي ہے يہ منزل حسرت فزا
ديدہء عبرت! خراج اشک گلگوں کر ادا
ہے تو گورستاں مگر يہ خاک گردوں پايہ ہے
آہ! اک برگشتہ قسمت قوم کا سرمايہ ہے
مقبروں کي شان حيرت آفريں ہے اس قدر
جنبش مژگاں سے ہے چشم تماشا کو حذر
کيفيت ايسي ہے ناکامي کي اس تصوير ميں
جو اتر سکتي نہيں آئينہء تحرير ميں
سوتے ہيں خاموش ، آبادي کے ہنگاموں سے دور
مضطرب رکھتي تھي جن کو آرزوئے ناصبور
قبر کي ظلمت ميں ہے ان آفتابوں کي چمک
جن کے دروازوں پہ رہتا تھا جبيں گستر فلک
کيا يہي ہے ان شہنشاہوں کي عظمت کا مآل
جن کي تدبير جہاں باني سے ڈرتا تھا زوال
رعب فغفوري ہو دنيا ميں کہ شان قيصري
ٹل نہيں سکتي غنيم موت کي يورش کبھي
بادشاہوں کي بھي کشت عمر کا حاصل ہے گور
جادہ عظمت کي گويا آخري منزل ہے گور
شورش بزم طرب کيا ، عود کي تقرير کيا
درد مندان جہاں کا نالہء شب گير کيا
عرصہء پيکار ميں ہنگامہء شمشير کيا
خون کو گرمانے والا نعرہء تکبير کيا
اب کوئي آواز سوتوں کو جگا سکتي نہيں
سينہ ويراں ميں جان رفتہ آ سکتي نہيں
روح ، مشت خاک ميں زحمت کش بيداد ہے
کوچہ گرد نے ہوا جس دم نفس ، فرياد ہے
زندگي انساں کي ہے مانند مرغ خوش نوا
شاخ پر بيٹھا ، کوئي دم چہچايا ، اڑ گيا
!آہ! کيا آئے رياض دہر ميں ہم ، کيا گئے
زندگي کي شاخ سے پھوٹے ، کھلے ، مرجھا گئے
موت ہر شاہ و گدا کے خواب کي تعبير ہے
اس ستم گر کا ستم انصاف کي تصوير ہے
سلسلہ ہستي کا ہے اک بحر نا پيدا کنار
اور اس دريائے بے پاياں کے موجيں ہيں مزار
اے ہوس! خوں رو کہ ہے يہ زندگي بے اعتبار
يہ شرارے کا تبسم ، يہ خس آتش سوار
چاند ، جو صورت گر ہستي کا اک اعجاز ہے
پہنے سيمابي قبا محو خرام ناز ہے
چرخ بے انجم کي دہشت ناک وسعت ميں مگر
بے کسي اس کي کوئي ديکھے ذرا وقت سحر
اک ذرا سا ابر کا ٹکڑا ہے ، جو مہتاب تھا
آخري آنسو ٹپک جانے ميں ہو جس کي فنا
زندگي اقوام کي بھي ہے يونہي بے اعتبار
رنگ ہائے رفتہ کي تصوير ہے ان کي بہار
اس زياں خانے ميں کوئي ملت گردوں وقار
رہ نہيں سکتي ابد تک بار دوش روزگار
اس قدر قوموں کي بربادي سے ہے خوگر جہاں
ديکھتا بے اعتنائي سے ہے يہ منظر جہاں
ايک صورت پر نہيں رہتا کسي شے کو قرار
ذوق جدت سے ہے ترکيب مزاج روزگار
ہے نگين دہر کي زينت ہميشہ نام نو
مادر گيتي رہي آبستن اقوام نو
ہے ہزاروں قافلوں سے آشنا يہ رہ گزر
چشم کوہ نور نے ديکھے ہيں کتنے تاجور
مصر و بابل مٹ گئے باقي نشاں تک بھي نہيں
دفتر ہستي ميں ان کي داستاں تک بھي نہيں
آ دبايا مہر ايراں کو اجل کي شام نے
عظمت يونان و روما لوٹ لي ايام نے
آہ! مسلم بھي زمانے سے يونہي رخصت ہوا
آسماں سے ابر آذاري اٹھا ، برسا ، گيا
ہے رگ گل صبح کے اشکوں سے موتي کي لڑي
کوئي سورج کي کرن شبنم ميں ہے الجھي ہوئي
سينہ دريا شعاعوں کے ليے گہوارہ ہے
کس قدر پيارا لب جو مہر کا نظارہ ہے
محو زينت ہے صنوبر ، جوئبار آئينہ ہے
غنچہ گل کے ليے باد بہار آئينہ ہے
نعرہ زن رہتي ہے کوئل باغ کے کاشانے ميں
چشم انساں سے نہاں ، پتوں کے عزلت خانے ميں
اور بلبل ، مطرب رنگيں نوائے گلستاں
جس کے دم سے زندہ ہے گويا ہوائے گلستاں
عشق کے ہنگاموں کي اڑتي ہوئي تصوير ہے
خامہ قدرت کي کيسي شوخ يہ تحرير ہے
باغ ميں خاموش جلسے گلستاں زادوں کے ہيں
وادي کہسار ميں نعرے شباں زادوں کے ہيں
زندگي سے يہ پرانا خاک داں معمور ہے
موت ميں بھي زندگاني کي تڑپ مستور ہے
پتےاں پھولوں کي گرتي ہيں خزاں ميں اس طرح
دست طفل خفتہ سے رنگيں کھلونے جس طرح
اس نشاط آباد ميں گو عيش بے اندازہ ہے
ايک غم ، يعني غم ملت ہميشہ تازہ ہے
دل ہمارے ياد عہد رفتہ سے خالي نہيں
اپنے شاہوں کو يہ امت بھولنے والي نہيں
اشک باري کے بہانے ہيں يہ اجڑے بام و در
گريہ پيہم سے بينا ہے ہماري چشم تر
دہر کو ديتے ہيں موتي ديدہء گرياں کے ہم
آخري بادل ہيں اک گزرے ہوئے طوفاں کے ہم
ہيں ابھي صد ہا گہر اس ابر کي آغوش ميں
برق ابھي باقي ہے اس کے سينہء خاموش ميں
وادي گل ، خاک صحرا کو بنا سکتا ہے يہ
خواب سے اميد دہقاں کو جگا سکتا ہے يہ
ہو چکا گو قوم کي شان جلالي کا ظہور
ہے مگر باقي ابھي شان جمالي کا ظہور
ہو رہي ہے زير دامان افق سے آشکار
صبح يعني دختر دوشيزہ ليل و نہار
پا چکا فرصت درود فصل انجم سے سپہر
کشت خاور ميں ہوا ہے آفتاب آئينہ کار
آسماں نے آمد خورشيد کي پا کر خبر
محمل پرواز شب باندھا سر دوش غبار
شعلہء خورشيد گويا حاصل اس کھيتي کا ہے
بوئے تھے دہقان گردوں نے جو تاروں کے شرار
ہے رواں نجم سحر ، جيسے عبادت خانے سے
سب سے پيچھے جائے کوئي عابد شب زندہ دار
کيا سماں ہے جس طرح آہستہ آہستہ کوئي
کھينچتا ہو ميان کي ظلمت سے تيغ آب دار
مطلع خورشيد ميں مضمر ہے يوں مضمون صبح
جيسے خلوت گاہ مينا ميں شراب خوش گوار
ہے تہ دامان باد اختلاط انگيز صبح
شورش ناقوس ، آواز اذاں سے ہمکنار
جاگے کوئل کي اذاں سے طائران نغمہ سنج
ہے ترنم ريز قانون سحر کا تار تار
ہميشہ صورت باد سحر آوارہ رہتا ہوں
محبت ميں ہے منزل سے بھي خوشتر جادہ پيمائي
دل بے تاب جا پہنچا ديار پير سنجر ميں
ميسر ہے جہاں درمان درد نا شکيبائي
ابھي نا آشنائے لب تھا حرف آرزو ميرا
زباں ہونے کو تھي منت پذير تاب گويائي
يہ مرقد سے صدا آئي ، حرم کے رہنے والوں کو
!شکايت تجھ سے ہے اے تارک آئين آبائي
ترا اے قيس کيونکر ہوگيا سوز دروں ٹھنڈا
کہ ليلي ميں تو ہيں اب تک وہي انداز ليلائي
نہ تخم 'لا الہ' تيري زمين شور سے پھوٹا
زمانے بھر ميں رسوا ہے تري فطرت کي نازائي
تجھے معلوم ہے غافل کہ تيري زندگي کيا ہے
کنشتي ساز، معمور نوا ہائے کليسائي
ہوئي ہے تربيت آغوش بيت اللہ ميں تيري
دل شوريدہ ہے ليکن صنم خانے کا سودائي
وفا آموختي از ما، بکار ديگراں کر دي ''
''ربودي گوہرے از ما نثار ديگراں کر دي
گو سراپا کيف عشرت ہے شراب زندگي
اشک بھي رکھتا ہے دامن ميں سحاب زندگي
موج غم پر رقص کرتا ہے حباب زندگي
ہے 'الم' کا سورہ بھي جزو کتاب زندگي
ايک بھي پتي اگر کم ہو تو وہ گل ہي نہيں
جو خزاں ناديدہ ہو بلبل، وہ بلبل ہي نہيں
آرزو کے خون سے رنگيں ہے دل کي داستاں
نغمہ انسانيت کامل نہيں غير از فغاں
ديدہ بينا ميں داغ غم چراغ سينہ ہے
روح کو سامان زينت آہ کا آئينہ ہے
حادثات غم سے ہے انساں کي فطرت کو کمال
غازہ ہے آئينہء دل کے ليے گرد ملال
غم جواني کو جگا ديتا ہے لطف خواب سے
ساز يہ بيدار ہوتا ہے اسي مضراب سے
طائر دل کے ليے غم شہپر پرواز ہے
راز ہے انساں کا دل غم انکشاف راز ہے
غم نہيں غم، روح کا اک نغمہء خاموش ہے
جو سرود بربط ہستي سے ہم آغوش ہے
شام جس کي آشنائے نالہء 'يا رب' نہيں
جلوہ پيرا جس کي شب ميں اشک کے کوکب نہيں
جس کا جام دل شکست غم سے ہے ناآشنا
جو سدا مست شراب عيش و عشرت ہي رہا
ہاتھ جس گلچيں کا ہے محفوظ نوک خار سے
عشق جس کا بے خبر ہے ہجر کے آزار سے
کلفت غم گرچہ اس کے روز و شب سے دور ہے
زندگي کا راز اس کي آنکھ سے مستور ہے
اے کہ نظم دہر کا ادراک ہے حاصل تجھے
کيوں نہ آساں ہو غم و اندوہ کي منزل تجھے
ہے ابد کے نسخہ ديرينہ کي تمہيد عشق
عقل انساني ہے فاني، زندہء جاويد عشق
عشق کے خورشيد سے شام اجل شرمندہ ہے
عشق سوز زندگي ہے ، تا ابد پائندہ ہے
رخصت محبوب کا مقصد فنا ہوتا اگر
جوش الفت بھي دل عاشق سے کر جاتا سفر
عشق کچھ محبوب کے مرنے سے مر جاتا نہيں
روح ميں غم بن کے رہتا ہے ، مگر جاتا نہيں
ہے بقائے عشق سے پيدا بقا محبوب کي
زندگاني ہے عدم ناآشنا محبوب کي
آتي ہے ندي جبين کوہ سے گاتي ہوئي
آسماں کے طائروں کو نغمہ سکھلاتي ہوئي
آئنہ روشن ہے اس کا صورت رخسار حور
گر کے وادي کي چٹانوں پر يہ ہو جاتا ہے چور
نہر جو تھي ، اس کے گوہر پيارے پيارے بن گئے
يعني اس افتاد سے پاني کے تارے بن گئے
جوئے سيماب رواں پھٹ کر پريشاں ہو گئي
مضطرب بوندوں کي اک دنيا نماياں ہو گئي
ہجر، ان قطروں کو ليکن وصل کي تعليم ہے
دو قدم پر پھر وہي جو مثل تار سيم ہے
ايک اصليت ميں ہے نہر روان زندگي
گر کے رفعت سے ہجوم نوع انساں بن گئي
پستي عالم ميں ملنے کو جدا ہوتے ہيں ہم
عارضي فرقت کو دائم جان کر روتے ہيں ہم
مرنے والے مرتے ہيں ليکن فنا ہوتے نہيں
يہ حقيقت ميں کبھي ہم سے جدا ہوتے نہيں
عقل جس دم دہر کي آفات ميں محصور ہو
يا جواني کي اندھيري رات ميں مستور ہو
دامن دل بن گيا ہو رزم گاہ خير و شر
راہ کي ظلمت سے ہو مشکل سوئے منزل سفر
خضر ہمت ہو گيا ہو آرزو سے گوشہ گير
فکر جب عاجز ہو اور خاموش آواز ضمير
وادي ہستي ميں کوئي ہم سفر تک بھي نہ ہو
جادہ دکھلانے کو جگنو کا شرر تک بھي نہ ہو
مرنے والوں کي جبيں روشن ہے اس ظلمات ميں
جس طرح تارے چمکتے ہيں اندھيري رات ميں
وہ مست ناز جو گلشن ميں جا نکلتي ہے
کلي کلي کي زباں سے دعا نکلتي ہے
الہي! پھولوں ميں وہ انتخاب مجھ کو کرے ''
''کلي سے رشک گل آفتاب مجھ کو کرے
تجھے وہ شاخ سے توڑيں! زہے نصيب ترے
تڑپتے رہ گئے گلزار ميں رقيب ترے
اٹھا کے صدمہ فرقت وصال تک پہنچا
تري حيات کا جوہر کمال تک پہنچا
مرا کنول کہ تصدق ہيں جس پہ اہل نظر
مرے شباب کے گلشن کو ناز ہے جس پر
کبھي يہ پھول ہم آغوش مدعا نہ ہوا
کسي کے دامن رنگيں سے آشنا نہ ہوا
شگفتہ کر نہ سکے گي کبھي بہار اسے
فسردہ رکھتا ہے گلچيں کا انتظار اسے
چين و عرب ہمارا ، ہندوستاں ہمارا
مسلم ہيں ہم ، وطن ہے سارا جہاں ہمارا
توحيد کي امانت سينوں ميں ہے ہمارے
آساں نہيں مٹانا نام و نشاں ہمارا
دنيا کے بت کدوں ميں پہلا وہ گھر خدا کا
ہم اس کے پاسباں ہيں، وہ پاسباں ہمارا
تيغوں کے سائے ميں ہم پل کر جواں ہوئے ہيں
خنجر ہلال کا ہے قومي نشاں ہمارا
مغرب کي واديوں ميں گونجي اذاں ہماري
تھمتا نہ تھا کسي سے سيل رواں ہمارا
باطل سے دنبے والے اے آسماں نہيں ہم
سو بار کر چکا ہے تو امتحاں ہمارا
اے گلستان اندلس! وہ دن ہيں ياد تجھ کو
تھا تيري ڈاليوں پر جب آشياں ہمارا
اے موج دجلہ! تو بھي پہچانتي ہے ہم کو
اب تک ہے تيرا دريا افسانہ خواں ہمارا
اے ارض پاک! تيري حرمت پہ کٹ مرے ہم
ہے خوں تري رگوں ميں اب تک رواں ہمارا
سالار کارواں ہے مير حجاز اپنا
اس نام سے ہے باقي آرام جاں ہمارا
اقبال کا ترانہ بانگ درا ہے گويا
ہوتا ہے جادہ پيما پھر کارواں ہمارا
اس دور ميں مے اور ہے ، جام اور ہے جم اور
ساقي نے بنا کي روش لطف و ستم اور
مسلم نے بھي تعمير کيا اپنا حرم اور
تہذيب کے آزر نے ترشوائے صنم اور
ان تازہ خداؤں ميں بڑا سب سے وطن ہے
جو پيرہن اس کا ہے ، وہ مذہب کا کفن ہے
يہ بت کہ تراشيدہء تہذيب نوي ہے
غارت گر کاشانہء دين نبوي ہے
بازو ترا توحيد کي قوت سے قوي ہے
اسلام ترا ديس ہے ، تو مصطفوي ہے
نظارہ ديرينہ زمانے کو دکھا دے
!اے مصطفوي خاک ميں اس بت کو ملا دے
ہو قيد مقامي تو نتيجہ ہے تباہي
رہ بحر ميں آزاد وطن صورت ماہي
ہے ترک وطن سنت محبوب الہي
دے تو بھي نبوت کي صداقت پہ گواہي
گفتار سياست ميں وطن اور ہي کچھ ہے
ارشاد نبوت ميں وطن اور ہي کچھ ہے
اقوام جہاں ميں ہے رقابت تو اسي سے
تسخير ہے مقصود تجارت تو اسي سے
خالي ہے صداقت سے سياست تو اسي سے
کمزور کا گھر ہوتا ہے غارت تو اسي سے
اقوام ميں مخلوق خدا بٹتي ہے اس سے
قوميت اسلام کے جڑ کٹتي ہے اس سے
قافلہ لوٹا گيا صحرا ميں اور منزل ہے دور
اس بياباں يعني بحر خشک کا ساحل ہے دور
ہم سفر ميرے شکار دشنہء رہزن ہوئے
بچ گئے جو ، ہو کے بے دل سوئے بيت اللہ پھرے
!اس بخاري نوجواں نے کس خوشي سے جان دي
موت کے زہراب ميں پائي ہے اس نے زندگي
خنجر رہزن اسے گويا ہلال عيد تھا
'ہائے يثرب' دل ميں ، لب پر نعرہ توحيد تھا
خوف کہتا ہے کہ يثرب کي طرف تنہا نہ چل
شوق کہتا ہے کہ تو مسلم ہے ، بے باکانہ چل
بے زيارت سوئے بيت اللہ پھر جاؤں گا کيا
عاشقوں کو روز محشر منہ نہ دکھلاؤں گا کيا
خوف جاں رکھتا نہيں کچھ دشت پيمائے حجاز
ہجرت مدفون يثرب ميں يہي مخفي ہے راز
گو سلامت محمل شامي کي ہمراہي ميں ہے
عشق کي لذت مگر خطروں کے جاں کاہي ميں ہے
آہ! يہ عقل زياں انديش کيا چالاک ہے
اور تاثر آدمي کا کس قدر بے باک ہے
کل ايک شوريدہ خواب گاہ نبي پہ رو رو کے کہہ رہا تھا
کہ مصر و ہندوستاں کے مسلم بنائے ملت مٹا رہے ہيں
يہ زائران حريم مغرب ہزار رہبر بنيں ہمارے
ہميں بھلا ان سے واسطہ کيا جو تجھ سے نا آشنا رہے ہيں
!غضب ہيں يہ 'مرشدان خود بيں خدا تري قوم کو بچائے
بگاڑ کر تيرے مسلموں کو يہ اپني عزت بنا رہے ہيں
سنے گا اقبال کون ان کو ، يہ انجمن ہي بدل گئي ہے
!نئے زمانے ميں آپ ہم کو پراني باتيں سنا رہے ہيں
کيوں زياں کار بنوں ، سود فراموش رہوں
فکر فردا نہ کروں محو غم دوش رہوں
نالے بلبل کے سنوں اور ہمہ تن گوش رہوں
ہم نوا ميں بھي کوئي گل ہوں کہ خاموش رہوں
جرات آموز مري تاب سخن ہے مجھ کو
شکوہ اللہ سے ، خاکم بدہن ، ہے مجھ کو
ہے بجا شيوہء تسليم ميں مشہور ہيں ہم
قصہ درد سناتے ہيں کہ مجبور ہيں ہم
ساز خاموش ہيں ، فرياد سے معمور ہيں ہم
نالہ آتا ہے اگر لب پہ تو معذور ہيں ہم
اے خدا! شکوہء ارباب وفا بھي سن لے
خوگر حمد سے تھوڑا سا گلا بھي سن لے
تھي تو موجود ازل سے ہي تري ذات قديم
پھول تھا زيب چمن پر نہ پريشاں تھي شميم
شرط انصاف ہے اے صاحب الطاف عميم
بوئے گل پھيلتي کس طرح جو ہوتي نہ نسيم
ہم کو جمعيت خاطر يہ پريشاني تھي
ورنہ امت ترے محبوب کي ديواني تھي؟
ہم سے پہلے تھا عجب تيرے جہاں کا منظر
کہيں مسجود تھے پتھر ، کہيں معبود شجر
خوگر پيکر محسوس تھي انساں کي نظر
مانتا پھر کوئي ان ديکھے خدا کو کيونکر
تجھ کو معلوم ہے ، ليتا تھا کوئي نام ترا؟
قوت بازوئے مسلم نے کيا کام ترا
بس رہے تھے يہيں سلجوق بھي، توراني بھي
اہل چيں چين ميں ، ايران ميں ساساني بھي
اسي معمورے ميں آباد تھے يوناني بھي
اسي دنيا ميں يہودي بھي تھے ، نصراني بھي
پر ترے نام پہ تلوار اٹھائي کس نے
بات جو بگڑي ہوئي تھي ، وہ بنائي کس نے
تھے ہميں ايک ترے معرکہ آراؤں ميں
خشکيوں ميں کبھي لڑتے ، کبھي درياؤں ميں
ديں اذانيں کبھي يورپ کے کليساؤں ميں
کبھي افريقہ کے تپتے ہوئے صحراؤں ميں
شان آنکھوں ميں نہ جچتي تھي جہاں داروں کي
کلمہ پڑھتے تھے ہم چھاؤں ميں تلواروں کي
ہم جو جيتے تھے تو جنگوں کے مصيبت کے ليے
اور مرتے تھے ترے نام کي عظمت کے ليے
تھي نہ کچھ تيغ زني اپني حکومت کے ليے
سربکف پھرتے تھے کيا دہر ميں دولت کے ليے؟
قوم اپني جو زر و مال جہاں پر مرتي
!بت فروشي کے عوض بت شکني کيوں کرتي
ٹل نہ سکتے تھے اگر جنگ ميں اڑ جاتے تھے
پاؤں شيروں کے بھي ميداں سے اکھڑ جاتے تھے
تجھ سے سرکش ہوا کوئي تو بگڑ جاتے تھے
تيغ کيا چيز ہے ، ہم توپ سے لڑ جاتے تھے
نقش توحيد کا ہر دل پہ بٹھايا ہم نے
زير خنجر بھي يہ پيغام سنايا ہم نے
تو ہي کہہ دے کہ اکھاڑا در خيبر کس نے
شہر قيصر کا جو تھا ، اس کو کيا سر کس نے
توڑے مخلوق خداوندوں کے پيکر کس نے
کاٹ کر رکھ ديے کفار کے لشکر کس نے
کس نے ٹھنڈا کيا آتشکدہ ايراں کو؟
کس نے پھر زندہ کيا تذکرہ يزداں کو؟
کون سي قوم فقط تيري طلب گار ہوئي
اور تيرے ليے زحمت کش پيکار ہوئي
کس کي شمشير جہاں گير ، جہاں دار ہوئي
کس کي تکبير سے دنيا تري بيدار ہوئي
کس کي ہيبت سے صنم سہمے ہوئے رہتے تھے
منہ کے بل گر کے 'ھو اللہ احد' کہتے تھے
آ گيا عين لڑائي ميں اگر وقت نماز
قبلہ رو ہو کے زميں بوس ہوئي قوم حجاز
ايک ہي صف ميں کھڑے ہو گئے محمود و اياز
نہ کوئي بندہ رہا اور نہ کوئي بندہ نواز
بندہ و صاحب و محتاج و غني ايک ہوئے
تيري سرکار ميں پہنچے تو سبھي ايک ہوئے
محفل کون و مکاں ميں سحر و شام پھرے
مے توحيد کو لے کر صفت جام پھرے
کوہ ميں ، دشت ميں لے کر ترا پيغام پھرے
!اور معلوم ہے تجھ کو ، کبھي ناکام پھرے
دشت تو دشت ہيں ، دريا بھي نہ چھوڑے ہم نے
بحر ظلمات ميں دوڑا ديے گھوڑے ہم نے
صفحہ دہر سے باطل کو مٹايا ہم نے
نوع انساں کو غلامي سے چھڑايا ہم نے
تيرے کعبے کو جبينوں سے بسايا ہم نے
تيرے قرآن کو سينوں سے لگايا ہم نے
پھر بھي ہم سے يہ گلہ ہے کہ وفادار نہيں
!ہم وفادار نہيں ، تو بھي تو دلدار نہيں
امتيں اور بھي ہيں ، ان ميں گنہ گار بھي ہيں
عجز والے بھي ہيں ، مست مےء پندار بھي ہيں
ان ميں کاہل بھي ہيں، غافل بھي ہيں، ہشيار بھي ہيں
سينکڑوں ہيں کہ ترے نام سے بيزار بھي ہيں
رحمتيں ہيں تري اغيار کے کاشانوں پر
برق گرتي ہے تو بيچارے مسلمانوں پر
بت صنم خانوں ميں کہتے ہيں ، مسلمان گئے
ہے خوشي ان کو کہ کعبے کے نگہبان گئے
منزل دہر سے اونٹوں کے حدي خوان گئے
اپني بغلوں ميں دبائے ہوئے قرآن گئے
خندہ زن کفر ہے ، احساس تجھے ہے کہ نہيں
اپني توحيد کا کچھ پاس تجھے ہے کہ نہيں
يہ شکايت نہيں ، ہيں ان کے خزانے معمور
نہيں محفل ميں جنھيں بات بھي کرنے کا شعور
قہر تو يہ ہے کہ کافر کو مليں حور و قصور
اور بيچارے مسلماں کو فقط وعدہ حور
اب وہ الطاف نہيں ، ہم پہ عنايات نہيں
بات يہ کيا ہے کہ پہلي سي مدارات نہيں
کيوں مسلمانوں ميں ہے دولت دنيا ناياب
تيري قدرت تو ہے وہ جس کي نہ حد ہے نہ حساب
تو جو چاہے تو اٹھے سينہء صحرا سے حباب
رہرو دشت ہو سيلي زدہء موج سراب
طعن اغيار ہے ، رسوائي ہے ، ناداري ہے
کيا ترے نام پہ مرنے کا عوض خواري ہے؟
بني اغيار کي اب چاہنے والي دنيا
رہ گئي اپنے ليے ايک خيالي دنيا
ہم تو رخصت ہوئے ، اوروں نے سنبھالي دنيا
پھر نہ کہنا ہوئي توحيد سے خالي دنيا
ہم تو جيتے ہيں کہ دنيا ميں ترا نام رہے
!کہيں ممکن ہے کہ ساقي نہ رہے ، جام رہے
تيري محفل بھي گئي ، چاہنے والے بھي گئے
شب کے آہيں بھي گئيں ، صبح کے نالے بھي گئے
دل تجھے دے بھي گئے ، اپنا صلا لے بھي گئے
آ کے بيٹھے بھي نہ تھے اور نکالے بھي گئے
آئے عشاق ، گئے وعدہء فردا لے کر
اب انھيں ڈھونڈ چراغ رخ زيبا لے کر
درد ليلي بھي وہي ، قيس کا پہلو بھي وہي
نجد کے دشت و جبل ميں رم آہو بھي وہي
عشق کا دل بھي وہي ، حسن کا جادو بھي وہي
امت احمد مرسل بھي وہي ، تو بھي وہي
پھر يہ آزردگي غير سبب کيا معني
اپنے شيداؤں پہ يہ چشم غضب کيا معني
تجھ کو چھوڑا کہ رسول عربي کو چھوڑا؟
بت گري پيشہ کيا ، بت شکني کو چھوڑا؟
عشق کو ، عشق کي آشفتہ سري کو چھوڑا؟
رسم سلمان و اويس قرني کو چھوڑا؟
آگ تکبير کي سينوں ميں دبي رکھتے ہيں
زندگي مثل بلال حبشي رکھتے ہيں
عشق کي خير وہ پہلي سي ادا بھي نہ سہي
جادہ پيمائي تسليم و رضا بھي نہ سہي
مضطرب دل صفت قبلہ نما بھي نہ سہي
اور پابندي آئين وفا بھي نہ سہي
کبھي ہم سے ، کبھي غيروں سے شناسائي ہے
!بات کہنے کي نہيں ، تو بھي تو ہرجائي ہے
سر فاراں پہ کيا دين کو کامل تو نے
اک اشارے ميں ہزاروں کے ليے دل تو نے
آتش اندوز کيا عشق کا حاصل تو نے
پھونک دي گرمي رخسار سے محفل تو نے
آج کيوں سينے ہمارے شرر آباد نہيں
ہم وہي سوختہ ساماں ہيں ، تجھے ياد نہيں؟
وادي نجد ميں وہ شور سلاسل نہ رہا
قيس ديوانہ نظارہ محمل نہ رہا
حوصلے وہ نہ رہے ، ہم نہ رہے ، دل نہ رہا
گھر يہ اجڑا ہے کہ تو رونق محفل نہ رہا
اے خوش آں روز کہ آئي و بصد ناز آئي
بے حجابانہ سوئے محفل ما باز آئي
بادہ کش غير ہيں گلشن ميں لب جو بيٹھے
سنتے ہيں جام بکف نغمہ کو کو بيٹھے
دور ہنگامہ گلزار سے يک سو بيٹھے
تيرے ديوانے بھي ہيں منتظر 'ھو' بيٹھے
اپنے پروانوں کو پھر ذوق خود افروزي دے
برق ديرينہ کو فرمان جگر سوزي دے
قوم آوارہ عناں تاب ہے پھر سوئے حجاز
لے اڑا بلبل بے پر کو مذاق پرواز
مضطرب باغ کے ہر غنچے ميں ہے بوئے نياز
تو ذرا چھيڑ تو دے، تشنہء مضراب ہے ساز
نغمے بے تاب ہيں تاروں سے نکلنے کے ليے
طور مضطر ہے اسي آگ ميں جلنے کے ليے
مشکليں امت مرحوم کي آساں کر دے
مور بے مايہ کو ہمدوش سليماں کر دے
جنس ناياب محبت کو پھر ارزاں کر دے
ہند کے دير نشينوں کو مسلماں کر دے
جوئے خوں مي چکد از حسرت ديرينہء ما
مي تپد نالہ بہ نشتر کدہ سينہ ما
بوئے گل لے گئي بيرون چمن راز چمن
!کيا قيامت ہے کہ خود پھول ہيں غماز چمن
عہد گل ختم ہوا ٹوٹ گيا ساز چمن
اڑ گئے ڈاليوں سے زمزمہ پرواز چمن
ايک بلبل ہے کہ ہے محو ترنم اب تک
اس کے سينے ميں ہے نغموں کا تلاطم اب تک
قمرياں شاخ صنوبر سے گريزاں بھي ہوئيں
پےتاں پھول کي جھڑ جھڑ کے پريشاں بھي ہوئيں
وہ پراني روشيں باغ کي ويراں بھي ہوئيں
ڈالياں پيرہن برگ سے عرياں بھي ہوئيں
قيد موسم سے طبيعت رہي آزاد اس کي
!کاش گلشن ميں سمجھتا کوئي فرياد اس کي
لطف مرنے ميں ہے باقي ، نہ مزا جينے ميں
کچھ مزا ہے تو يہي خون جگر پينے ميں
کتنے بے تاب ہيں جوہر مرے آئينے ميں
کس قدر جلوے تڑپتے ہيں مرے سينے ميں
اس گلستاں ميں مگر ديکھنے والے ہي نہيں
داغ جو سينے ميں رکھتے ہوں ، وہ لالے ہي نہيں
چاک اس بلبل تنہا کي نوا سے دل ہوں
جاگنے والے اسي بانگ درا سے دل ہوں
يعني پھر زندہ نئے عہد وفا سے دل ہوں
پھر اسي بادہء ديرينہ کے پياسے دل ہوں
عجمي خم ہے تو کيا ، مے تو حجازي ہے مري
!نغمہ ہندي ہے تو کيا ، لے تو حجازي ہے مري
اے چاند! حسن تيرا فطرت کي آبرو ہے
طوف حريم خاکي تيري قديم خو ہے
يہ داغ سا جو تيرے سينے ميں ہے نماياں
عاشق ہے تو کسي کا، يہ داغ آرزو ہے؟
ميں مضطرب زميں پر، بے تاب تو فلک پر
تجھ کو بھي جستجو ہے ، مجھ کو بھي جستجو ہے
انساں ہے شمع جس کي ، محفل وہي ہے تيري؟
ميں جس طرف رواں ہوں ، منزل وہي ہے تيري؟
تو ڈھونڈتا ہے جس کو تاروں کي خامشي ميں
پوشيدہ ہے وہ شايد غوغائے زندگي ميں
استادہ سرو ميں ہے ، سبزے ميں سو رہا ہے
بلبل ميں نغمہ زن ہے ، خاموش ہے کلي ميں
آ ! ميں تجھے دکھاؤں رخسار روشن اس کا
نہروں کے آئنے ميں شبنم کي آرسي ميں
صحرا و دشت و در ميں ، کہسار ميں وہي ہے
انساں کے دل ميں ، تيرے رخسار ميں وہي ہے
(1)
رات
کيوں ميري چاندني ميں پھرتا ہے تو پريشاں
خاموش صورت گل ، مانند بو پريشاں
تاروں کے موتيوں کا شايد ہے جوہري تو
مچھلي ہے کوئي ميرے دريائے نور کي تو
يا تو مري جبيں کا تارا گرا ہوا ہے
رفعت کو چھوڑ کر جو بستي ميں جا بسا ہے
خاموش ہو گيا ہے تار رباب ہستي
ہے ميرے آئنے ميں تصوير خواب ہستي
دريا کي تہ ميں چشم گرادب سو گئي ہے
ساحل سے لگ کے موج بے تاب سو گئي ہے
بستي زميں کي کيسي ہنگامہ آفريں ہے
يوں سو گئي ہے جيسے آباد ہي نہيں ہے
شاعر کا دل ہے ليکن ناآشنا سکوں سے
آزاد رہ گيا تو کيونکر مرے فسوں سے؟
(2)
شاعر
ميں ترے چاند کي کھيتي ميں گہر بوتا ہوں
چھپ کے انسانوں سے مانند سحر روتا ہوں
دن کي شورش ميں نکلتے ہوئے گھبراتے ہيں
عزلت شب ميں مرے اشک ٹپک جاتے ہيں
مجھ ميں فرياد جو پنہاں ہے ، سناؤں کس کو
تپش شوق کا نظارہ دکھاؤں کس کو
برق ايمن مرے سينے پہ پڑي روتي ہے
!ديکھنے والي ہے جو آنکھ ، کہاں سوتي ہے
صفت شمع لحد مردہ ہے محفل ميري
آہ، اے رات! بڑي دور ہے منزل ميري
عہد حاضر کي ہوا راس نہيں ہے اس کو
اپنے نقصان کا احساس نہيں ہے اس کا
ضبط پيغام محبت سے جو گھبراتا ہوں
تيرے تابندہ ستاروں کو سنا جاتا ہوں
سورج نے جاتے جاتے شام سيہ قبا کو
طشت افق سے لے کر لالے کے پھول مارے
پہنا ديا شفق نے سونے کا سارا زيور
قدرت نے اپنے گہنے چاندي کے سب اتارے
محمل ميں خامشي کے ليلائے ظلمت آئي
چمکے عروس شب کے موتي وہ پيارے پيارے
وہ دور رہنے والے ہنگامہء جہاں سے
'کہتا ہے جن کو انساں اپني زباں ميں 'تارے
محو فلک فروزي تھي انجمن فلک کي
عرش بريں سے آئي آواز اک ملک کي
!اے شب کے پاسانو، اے آسماں کے تارو
تابندہ قوم ساري گردوں نشيں تمھاري
چھيڑو سرود ايسا ، جاگ اٹھيں سونے والے
رہبر ہے قافلوں کي تاب جبيں تمھاري
آئينے قسمتوں کے تم کو يہ جانتے ہيں
شايد سنيں صدائيں اہل زميں تمھاري
رخصت ہوئي خموشي تاروں بھري فضا سے
وسعت تھي آسماں کي معمور اس نوا سے
حسن ازل ہے پيدا تاروں کي دلبري ميں
جس طرح عکس گل ہو شبنم کے آرسي ميں
آئين نو سے ڈرنا ، طرز کہن پہ اڑنا
منزل يہي کھٹن ہے قوموں کي زندگي ميں
يہ کاروان ہستي ہے تيز گام ايسا
قوميں کچل گئي ہيں جس کي رواروي ميں
آنکھوں سے ہيں ہماري غائب ہزاروں انجم
داخل ہيں وہ بھي ليکن اپني برادري ميں
اک عمر ميں نہ سمجھے اس کو زمين والے
جو بات پا گئے ہم تھوڑي سي زندگي ميں
ہيں جذب باہمي سے قائم نظام سارے
پوشيدہ ہے يہ نکتہ تاروں کي زندگي ميں
تھا تخيل جو ہم سفر ميرا
آسماں پر ہوا گزر ميرا
اڑتا جاتا تھا اور نہ تھا کوئي
جاننے والا چرخ پر ميرا
تارے حيرت سے ديکھتے تھے مجھے
راز سر بستہ تھا سفر ميرا
حلقہ صبح و شام سے نکلا
اس پرانے نظام سے نکلا
کيا سناؤں تمھيں ارم کيا ہے
خاتم آرزوئے ديدہ و گوش
شاخ طوبي! پہ نغمہ ريز طيور
بے حجابانہ حور جلوہ فروش
ساقيان جميل جام بدست
پينے والوں ميں شور نوشانوش
دور جنت سے آنکھ نے ديکھا
ايک تاريک خانہ سرد و خموش
طالع قيس و گيسوئے ليلي
اس کي تاريکيوں سے دوش بدوش
خنک ايسا کہ جس سے شرما کر
کرہ زمہرير ہو روپوش
ميں نے پوچھي جو کيفيت اس کي
حيرت انگيز تھا جواب سروش
يہ مقام خنک جہنم ہے
نار سے ، نور سے تہي آغوش
شعلے ہوتے ہيں مستعار اس کے
جن سے لرزاں ہيں مرد عبرت کوش
اہل دنيا يہاں جو آتے ہيں
اپنے انگار ساتھ لاتے ہيں
ميں نے اقبال سے از راہ نصيحت يہ کہا
عامل روزہ ہے تو اور نہ پابند نماز
تو بھي ہے شيوہ ارباب ريا ميں کامل
دل ميں لندن کي ہوس ، لب پہ ترے ذکر حجاز
جھوٹ بھي مصلحت آميز ترا ہوتا ہے
تيرا انداز تملق بھي سراپا اعجاز
ختم تقرير تري مدحت سرکار پہ ہے
فکر روشن ہے ترا موجد آئين نياز
در حکام بھي ہے تجھ کو مقام محمود
پالسي بھي تري پيچيدہ تر از زلف اياز
اور لوگوں کي طرح تو بھي چھپا سکتا ہے
پردہ خدمت ديں ميں ہوس جاہ کا راز
نظر آجاتا ہے مسجد ميں بھي تو عيد کے دن
اثر وعظ سے ہوتي ہے طبيعت بھي گداز
دست پرورد ترے ملک کے اخبار بھي ہيں
چھيڑنا فرض ہے جن پر تري تشہير کا ساز
اس پہ طرہ ہے کہ تو شعر بھي کہہ سکتا ہے
تيري مينائے سخن ميں ہے شراب شيراز
جتنے اوصاف ہيں ليڈر کے ، وہ ہيں تجھ ميں سبھي
تجھ کو لازم ہے کہ ہو اٹھ کے شريک تگ و تاز
غم صياد نہيں ، اور پر و بال بھي ہيں
پھر سبب کيا ہے ، نہيں تجھ کو دماغ پرواز
عاقبت منزل ما وادي خاموشان است ''
''حاليا غلغلہ در گنبد افلاک انداز
لبريز ہے شراب حقيقت سے جام ہند
سب فلسفي ہيں خطہء مغرب کے رام ہند
يہ ہنديوں کے فکر فلک رس کا ہے اثر
رفعت ميں آسماں سے بھي اونچا ہے بام ہند
اس ديس ميں ہوئے ہيں ہزاروں ملک سرشت
مشہور جن کے دم سے ہے دنيا ميں نام ہند
ہے رام کے وجود پہ ہندوستاں کو ناز
اہل نظر سمجھتے ہيں اس کو امام ہند
اعجاز اس چراغ ہدايت کا ہے يہي
روشن تر از سحر ہے زمانے ميں شام ہند
تلوار کا دھني تھا ، شجاعت ميں فرد تھا
پاکيزگي ميں ، جوش محبت ميں فرد تھا
کيسي پتے کي بات جگندر نے کل کہي
موٹر ہے ذوالفقار علي خان کا کيا خموش
ہنگامہ آفريں نہيں اس کا خرام ناز
مانند برق تيز ، مثال ہوا خموش
ميں نے کہا ، نہيں ہے يہ موٹر پہ منحصر
ہے جادہء حيات ميں ہر تيزپا خموش
ہے پا شکستہ شيوہء فرياد سے جرس
نکہت کا کارواں ہے مثال صبا خموش
مينا مدام شورش قلقل سے پا بہ گل
ليکن مزاج جام خرام آشنا خموش
شاعر کے فکر کو پر پرواز خامشي
!سرمايہ دار گرمي آواز خامشي
منظر چمنستاں کے زيبا ہوں کہ نازيبا
محروم عمل نرگس مجبور تماشا ہے
رفتار کي لذت کا احساس نہيں اس کو
فطرت ہي صنوبر کي محروم تمنا ہے
تسليم کي خوگر ہے جو چيز ہے دنيا ميں
انسان کي ہر قوت سرگرم تقاضا ہے
اس ذرے کو رہتي ہے وسعت کي ہوس ہر دم
يہ ذرہ نہيں ، شايد سمٹا ہوا صحرا ہے
چاہے تو بدل ڈالے ہےئت چمنستاں کي
يہ ہستي دانا ہے ، بينا ہے ، توانا ہے
کبھي اے نوجواں مسلم! تدبر بھي کيا تو نے
وہ کيا گردوں تھا تو جس کا ہے اک ٹوٹا ہوا تارا
تجھے اس قوم نے پالا ہے آغوش محبت ميں
کچل ڈالا تھا جس نے پائوں ميں تاج سر دارا
تمدن آفريں خلاق آئين جہاں داري
وہ صحرائے عرب يعني شتربانوں کا گہوارا
سماں 'الفقر فخري' کا رہا شان امارت ميں
''بآب و رنگ و خال و خط چہ حاجت روے زيبا را''
گدائي ميں بھي وہ اللہ والے تھے غيور اتنے
کہ منعم کو گدا کے ڈر سے بخشش کا نہ تھا يارا
غرض ميں کيا کہوں تجھ سے کہ وہ صحرا نشيں کيا تھے
جہاں گير و جہاں دار و جہاں بان و جہاں آرا
اگر چاہوں تو نقشہ کھينچ کر الفاظ ميں رکھ دوں
مگر تيرے تخيل سے فزوں تر ہے وہ نظارا
تجھے آبا سے اپنے کوئي نسبت ہو نہيں سکتي
کہ تو گفتار وہ کردار ، تو ثابت وہ سےارا
گنوا دي ہم نے جو اسلاف سے ميراث پائي تھي
ثريا سے زميں پر آسماں نے ہم کو دے مارا
حکومت کا تو کيا رونا کہ وہ اک عارضي شے تھي
نہيں دنيا کے آئين مسلم سے کوئي چارا
مگر وہ علم کے موتي ، کتابيں اپنے آبا کي
جو ديکھيں ان کو يورپ ميں تو دل ہوتا ہے سيپارا
غني! روز سياہ پير کنعاں را تماشا کن ''
''کہ نور ديدہ اش روشن کند چشم زليخا را
غرہء شوال! اے نور نگاہ روزہ دار
آ کہ تھے تيرے ليے مسلم سراپا انتظار
تيري پيشاني پہ تحرير پيام عيد ہے
شام تيري کيا ہے ، صبح عيش کي تميد ہے
سرگزشت ملت بيضا کا تو آئينہ ہے
اے مہ نو! ہم کو تجھ سے الفت ديرينہ ہے
جس علم کے سائے ميں تيغ آزما ہوتے تھے ہم
دشمنوں کے خون سے رنگيں قبا ہوتے تھے ہم
تيري قسمت ميں ہم آغوشي اسي رايت کي ہے
حسن روز افزوں سے تيرے آبرو ملت کي ہے
آشنا پرور ہے قوم اپني ، وفا آئيں ترا
ہے محبت خيز يہ پيراہن سيميں ترا
اوج گردوں سے ذرا دنيا کي بستي ديکھ لے
!اپني رفعت سے ہمارے گھر کي پستي ديکھ لے
قافلے ديکھ اور ان کي برق رفتاري بھي ديکھ
رہر و درماندہ کي منزل سے بيزاري بھي ديکھ
ديکھ کر تجھ کو افق پر ہم لٹاتے تھے گہر
اے تہي ساغر! ہماري آج ناداري بھي ديکھ
فرقہ آرائي کي زنجيروں ميں ہيں مسلم اسير
اپني آزادي بھي ديکھ ، ان کي گرفتاري بھي ديکھ
ديکھ مسجد ميں شکست رشتہ تسبيح شيخ
بت کدے ميں برہمن کي پختہ زناري بھي ديکھ
کافروں کي مسلم آئيني کا بھي نظارہ کر
اور اپنے مسلموں کي مسلم آزاري بھي ديکھ
بارش سنگ حوادث کا تماشائي بھي ہو
امت مرحوم کي آئينہ ديواري بھي ديکھ
ہاں ، تملق پيشگي ديکھ آبرو والوں کي تو
اور جو بے آبرو تھے ، ان کي خود داري بھي ديکھ
جس کو ہم نے آشنا لطف تکلم سے کيا
اس حريف بے زباں کي گرم گفتاري بھي ديکھ
ساز عشرت کي صدا مغرب کے ايوانوں ميں سن
اور ايراں ميں ذرا ماتم کي تياري بھي ديکھ
چاک کر دي ترک ناداں نے خلافت کي قبا
سادگي مسلم کي ديکھ ، اوروں کي عياري بھي ديکھ
صورت آئينہ سب کچھ ديکھ اور خاموش رہ
شورش امروز ميں محو سرود دوش رہ
شاعر
دوش مي گفتم بہ شمع منزل ويران خويش
گيسوے تو از پر پروانہ دارد شانہ اے
درجہاں مثل چراغ لالہ صحراستم
نے نصيب محفلے نے قسمت کاشانہ اے
مدتے مانند تو من ہم نفس مي سوختم
در طواف شعلہ ام بالے نہ زد پروانہ اے
مي تپد صد جلوہ در جان امل فرسودم ن
بر نمي خيزد ازيں محفل دل ديوانہ اے
از کجا ايں آتش عالم فروز اندوختي
کرمک بے مايہ را سوز کليم آموختي
شمع
مجھ کو جو موج نفس ديتي ہے پيغام اجل
لب اسي موج نفس سے ہے نوا پيرا ترا
ميں تو جلتي ہوں کہ ہے مضمر مري فطرت ميں سوز
تو فروزاں ہے کہ پروانوں کو ہو سودا ترا
گريہ ساماں ميں کہ ميرے دل ميں ہے طوفان اشک
شبنم افشاں تو کہ بزم گل ميں ہو چرچا ترا
گل بہ دامن ہے مري شب کے لہو سے ميري صبح
ہے ترے امروز سے نا آشنا فردا ترا
يوں تو روشن ہے مگر سوز دروں رکھتا نہيں
شعلہ ہے مثل چراغ لالہء صحرا ترا
سوچ تو دل ميں ، لقب ساقي کا ہے زيبا تجھے؟
!انجمن پياسي ہے اور پيمانہ بے صہبا ترا
اور ہے تيرا شعار ، آئين ملت اور ہے
زشت روئي سے تري آئينہ ہے رسوا ترا
کعبہ پہلو ميں ہے اور سودائي بت خانہ ہے
کس قدر شوريدہ سر ہے شوق بے پروا ترا
قيس پيدا ہوں تري محفل ميں يہ ممکن نہيں
تنگ ہے صحرا ترا ، محمل ہے بے ليلا ترا
!اے در تابندہ ، اے پروردہء آغوش موج
لذت طوفاں سے ہے نا آشنا دريا ترا
اب نوا پيرا ہے کيا ، گلشن ہوا برہم ترا
بے محل تيرا ترنم ، نغمہ بے موسم ترا
تھا جنھيں ذوق تماشا ، وہ تو رخصت ہو گئے
لے کے اب تو وعدہ ديدار عام آيا تو کيا
انجمن سے وہ پرانے شعلہ آشام اٹھ گئے
ساقيا! محفل ميں تو آتش بجام آيا تو کيا
آہ ، جب گلشن کي جمعيت پريشاں ہو چکي
پھول کو باد بہاري کا پيام آيا تو کيا
آخر شب ديد کے قابل تھي بسمل کي تڑپ
صبحدم کوئي اگر بالائے بام آيا تو کيا
بجھ گيا وہ شعلہ جو مقصود ہر پروانہ تھا
اب کوئي سودائي سوز تمام آيا تو کيا
پھول بے پروا ہيں ، تو گرم نوا ہو يا نہ ہو
کارواں بے حس ہے ، آواز درا ہو يا نہ ہو
شمع محفل ہو کے تو جب سوز سے خالي رہا
تيرے پروانے بھي اس لذت سے بيگانے رہے
رشتہ الفت ميں جب ان کو پرو سکتا تھا تو
پھر پريشاں کيوں تري تسبيح کے دانے رہے
شوق بے پروا گيا ، فکر فلک پيما گيا
تيري محفل ميں نہ ديوانے نہ فرزانے رہے
وہ جگر سوزي نہيں ، وہ شعلہ آشامي نہيں
فائدہ پھر کيا جو گرد شمع پروانے رہے
خير ، تو ساقي سہي ليکن پلائے گا کسے
اب نہ وہ مے کش رہے باقي نہ مے خانے رہے
رو رہي ہے آج اک ٹوٹي ہوئي مينا اسے
کل تلک گردش ميں جس ساقي کے پيمانے رہے
آج ہيں خاموش وہ دشت جنوں پرور جہاں
رقص ميں ليلي رہي ، ليلي کے ديوانے رہے
وائے ناکامي! متاع کارواں جاتا رہا
کارواں کے دل سے احساس زياں جاتا رہا
جن کے ہنگاموں سے تھے آباد ويرانے کبھي
شہر ان کے مٹ گئے آبادياں بن ہو گئيں
سطوت توحيد قائم جن نمازوں سے ہوئي
وہ نمازيں ہند ميں نذر برہمن ہو گئيں
دہر ميں عيش دوام آئيں کي پابندي سے ہے
موج کو آزادياں سامان شيون ہو گئيں
خود تجلي کو تمنا جن کے نظاروں کي تھي
وہ نگاہيں نا اميد نور ايمن ہوگئيں
اڑتي پھرتي تھيں ہزاروں بلبليں گلزار ميں
دل ميں کيا آئي کہ پابند نشيمن ہو گئيں
وسعت گردوں ميں تھي ان کي تڑپ نظارہ سوز
بجلياں آسودہء دامان خرمن ہوگئيں
ديدہء خونبار ہو منت کش گلزار کيوں
اشک پيہم سے نگاہيں گل بہ دامن ہو گئيں
شام غم ليکن خبر ديتي ہے صبح عيد کي
ظلمت شب ميں نظر آئي کرن اميد کي
!مژدہ اے پيمانہ بردار خمستان حجاز
بعد مدت کے ترے رندوں کو پھر آيا ہے ہوش
نقد خودداري بہائے بادہء اغيار تھي
پھر دکاں تيري ہے لبريز صدائے نائو نوش
ٹوٹنے کو ہے طلسم ماہ سيمايان ہند
پھر سليمي کي نظر ديتي ہے پيغام خروش
پھر يہ غوغا ہے کہ لاساقي شراب خانہ ساز
دل کے ہنگامے مےء مغرب نے کر ڈالے خموش
نغمہ پيرا ہو کہ يہ ہنگام خاموشي نہيں
ہے سحر کا آسماں خورشيد سے مينا بدوش
در غم ديگر بسوز و ديگراں را ہم بسوز
گفتمت روشن حديثے گر تواني دار گوش
کہہ گئے ہيں شاعري جزو يست از پيغمبري
ہاں سنا دے محفل ملت کو پيغام سروش
آنکھ کو بيدار کر دے وعدہ ديدار سے
زندہ کر دے دل کو سوز جوہر گفتار سے
رہزن ہمت ہوا ذوق تن آساني ترا
بحر تھا صحرا ميں تو ، گلشن ميں مثل جو ہوا
اپني اصليت پہ قائم تھا تو جمعيت بھي تھي
چھوڑ کر گل کو پريشاں کاروان بو ہوا
زندگي قطرے کي سکھلاتي ہے اسرار حيات
يہ کبھي گوہر ، کبھي شبنم ، کبھي آنسو ہوا
پھر کہيں سے اس کو پيدا کر ، بڑي دولت ہے يہ
زندگي کيسي جو دل بيگانہء پہلو ہوا
فرد قائم ربط ملت سے ہے ، تنہا کچھ نہيں
موج ہے دريا ميں اور بيرون دريا کچھ نہيں
پردہ دل ميں محبت کو ابھي مستور رکھ
آبر باقي تري ملت کي جميعت ہے تھي
جب يہ جميعت گئي ، دنيا ميں رسوا تو ہوا
يعني اپني مے کو رسوا صورت مينا نہ کر
خيمہ زن ہو وادي سينا ميں مانند کليم
شعلہ تحقيق کو غارت گر کاشانہ کر
شمع کو بھي ہو ذرا معلوم انجام ستم
صرف تعمير سحر خاکستر پروانہ کر
تو اگر خود دار ہے ، منت کش ساقي نہ ہو
عين دريا ميں حباب آسا نگوں پيمانہ کر
کيفيت باقي پرانے کوہ و صحرا ميں نہيں
ہے جنوں تيرا نيا، پيدا نيا ويرانہ کر
خاک ميں تجھ کو مقدر نے ملايا ہے اگر
تو عصا افتاد سے پيدا مثال دانہ کر
ہاں ، اسي شاخ کہن پر پھر بنا لے آشياں
اہل گلشن کو شہيد نغمہ مستانہ کر
اس چمن ميں پيرو بلبل ہو يا تلميذ گل
يا سراپا نالہ بن جا يا نوا پيدا نہ کر
کيوں چمن ميں بے صدا مثل رم شبنم ہے تو
لب کشا ہو جا ، سرود بربط عالم ہے تو
آشنا اپني حقيقت سے ہو اے دہقاں ذرا
دانہ تو ، کھيتي بھي تو ، باراں بھي تو ، حاصل بھي تو
آہ ، کس کي جستجو آوارہ رکھتي ہے تجھے
راہ تو ، رہرو بھي تو، رہبر بھي تو ، منزل بھي تو
کانپتا ہے دل ترا انديشہء طوفاں سے کيا
ناخدا تو ، بحر تو ، کشتي بھي تو ، ساحل بھي تو
ديکھ آ کر کوچہء چاک گريباں ميں کبھي
قيس تو، ليلي بھي تو ، صحرا بھي تو، محمل بھي تو
وائے ناداني کہ تو محتاج ساقي ہو گيا
مے بھي تو، مينا بھي تو، ساقي بھي تو، محفل بھي تو
شعلہ بن کر پھونک دے خاشاک غير اللہ کو
خوف باطل کيا کہ ہے غارت گر باطل بھي تو
بے خبر! تو جوہر آئينہء ايام ہے
تو زمانے ميں خدا کا آخري پيغام ہے
اپني اصليت سے ہو آگاہ اے غافل کہ تو
قطرہ ہے ، ليکن مثال بحر بے پاياں بھي ہے
کيوں گرفتار طلسم ہيچ مقداري ہے تو
ديکھ تو پوشيدہ تجھ ميں شوکت طوفاں بھي ہے
سينہ ہے تيرا اميں اس کے پيام ناز کا
جو نظام دہر ميں پيدا بھي ہے ، پنہاں بھي ہے
ہفت کشور جس سے ہو تسخير بے تيغ و تفنگ
تو اگر سمجھے تو تيرے پاس وہ ساماں بھي ہے
اب تلک شاہد ہے جس پر کوہ فاراں کا سکوت
اے تغافل پيشہ! تجھ کو ياد وہ پيماں بھي ہے ؟
تو ہي ناداں چند کليوں پر قناعت کر گيا
ورنہ گلشن ميں علاج تنگي داماں بھي ہے
دل کي کيفيت ہے پيدا پردہء تقرير ميں
کسوت مينا ميں مے مستور بھي ، عرياں بھي ہے
پھونک ڈالا ہے مري آتش نوائي نے مجھے
اورميري زندگاني کا يہي ساماں بھي ہے
راز اس آتش نوائي کا مرے سينے ميں ديکھ
!جلوہ تقدير ميرے دل کے آئينے ميں ديکھ
آسماں ہوگا سحر کے نور سے آئينہ پوش
اور ظلمت رات کي سيماب پا ہو جائے گي
اس قدر ہوگي ترنم آفريں باد بہار
نکہت خوابيدہ غنچے کي نوا ہو جائے گي
آمليں گے سينہ چاکان چمن سے سينہ چاک
بزم گل کي ہم نفس باد صبا ہو جائے گي
شبنم افشاني مري پيدا کرے گي سوز و ساز
اس چمن کي ہر کلي درد آشنا ہو جائے گي
ديکھ لو گے سطوت رفتار دريا کا مآل
موج مضطر ہي اسے زنجير پا ہو جائے گي
پھر دلوں کو ياد آ جائے گا پيغام سجود
پھر جبيں خاک حرم سے آشنا ہو جائے گي
نالہء صياد سے ہوں گے نوا ساماں طيور
خون گلچيں سے کلي رنگيں قبا ہو جائے گي
آنکھ جو کچھ ديکھتي ہے ، لب پہ آ سکتا نہيں
محو حيرت ہوں کہ دنيا کيا سے کيا ہو جائے گي
شب گريزاں ہو گي آخر جلوہ خورشيد سے
يہ چمن معمور ہوگا نغمہ توحيد سے
ہر نفس اقبال تيرا آہ ميں مستور ہے
سينہ سوزاں ترا فرياد سے معمور ہے
نغمہ اميد تيري بربط دل ميں نہيں
ہم سمجھتے ہيں يہ ليلي تيرے محمل ميں نہيں
گوش آواز سرود رفتہ کا جويا ترا
اور دل ہنگامہء حاضر سے بے پروا ترا
قصہ گل ہم نوايان چمن سنتے نہيں
اہل محفل تيرا پيغام کہن سنتے نہيں
اے درائے کاروان خفتہ پا! خاموش رہ
ہے بہت ياس آفريں تيري صدا خاموش رہ
زندہ پھر وہ محفل ديرينہ ہو سکتي نہيں
شمع سے روشن شب دوشينہ ہوسکتي نہيں
ہم نشيں! مسلم ہوں ميں، توحيد کا حامل ہوں ميں
اس صداقت پر ازل سے شاہد عادل ہوں ميں
نبض موجودات ميں پيدا حرارت اس سے ہے
اور مسلم کے تخيل ميں جسارت اس سے ہے
حق نے عالم اس صداقت کے ليے پيدا کيا
اور مجھے اس کي حفاظت کے ليے پيدا کيا
دہر ميں غارت گر باطل پرستي ميں ہوا
حق تو يہ ہے حافظ ناموس ہستي ميں ہوا
ميري ہستي پيرہن عرياني عالم کي ہے
ميرے مٹ جانے سے رسوائي بني آدم کي ہے
قسمت عالم کا مسلم کوکب تابندہ ہے
جس کي تاباني سے افسون سحر شرمندہ ہے
آشکارا ہيں مري آنکھوں پہ اسرار حيات
کہہ نہيں سکتے مجھے نوميد پيکار حيات
کب ڈرا سکتا ہے غم کا عارضي منظر مجھے
ہے بھروسا اپني ملت کے مقدر پر مجھے
ياس کے عنصر سے ہے آزاد ميرا روزگار
فتح کامل کي خبر دتيا ہے جوش کارزار
ہاں يہ سچ ہے چشم بر عہد کہن رہتا ہوں ميں
اہل محفل سے پراني داستاں کہتا ہوں ميں
ياد عہد رفتہ ميري خاک کو اکسير ہے
ميرا ماضي ميرے استقبال کي تفسير ہے
سامنے رکھتا ہوں اس دور نشاط افزا کو ميں
ديکھتا ہوں دوش کے آئينے ميں فردا کو ميں
گراں جو مجھ پہ يہ ہنگامہ زمانہ ہوا
جہاں سے باندھ کے رخت سفر روانہ ہوا
قيود شام وسحر ميں بسر تو کي ليکن
نظام کہنہ عالم سے آشنا نہ ہوا
فرشتے بزم رسالت ميں لے گئے مجھ کو
حضور آيہ رحمت ميں لے گئے مجھ کو
!کہا حضور نے ، اے عندليب باغ حجاز
کلي کلي ہے تري گرمي نوا سے گداز
ہميشہ سرخوش جام ولا ہے دل تيرا
فتادگي ہے تري غيرت سجود نياز
اڑا جو پستي دنيا سے تو سوئے گردوں
سکھائي تجھ کو ملائک نے رفعت پرواز
نکل کے باغ جہاں سے برنگ بو آيا
ہمارے واسطے کيا تحفہ لے کے تو آيا؟
،حضور! دہر ميں آسودگي نہيں ملتي
تلاش جس کي ہے وہ زندگي نہيں ملتي
ہزاروں لالہ و گل ہيں رياض ہستي ميں
وفا کي جس ميں ہو بو، وہ کلي نہيں ملتي
مگر ميں نذر کو اک آبگينہ لايا ہوں
جو چيز اس ميں ہے، جنت ميں بھي نہيں ملتي
جھلکتي ہے تري امت کي آبرو اس ميں
طرابلس کے شہيدوں کا ہے لہو اس ميں
اک پيشوائے قوم نے اقبال سے کہا
کھلنے کو جدہ ميں ہے شفاخانہ حجاز
ہوتا ہے تيري خاک کا ہر ذرہ بے قرار
سنتا ہے تو کسي سے جو افسانہ حجاز
دست جنوں کو اپنے بڑھا جيب کي طرف
مشہور تو جہاں ميں ہے ديوانہ حجاز
دارالشفا حوالي لبطحا ميں چاہيے
نبض مريض پنجہ عيسي ميں چاہيے
ميں نے کہا کہ موت کے پردے ميں ہے حيات
پوشيدہ جس طرح ہو حقيقت مجاز ميں
تلخابہ اجل ميں جو عاشق کو مل گيا
پايا نہ خضر نے مے عمر دراز ميں
اوروں کو ديں حضور! يہ پيغام زندگي
ميں موت ڈھونڈتا ہوں زمين حجاز ميں
آئے ہيں آپ لے کے شفا کا پيام کيا
!رکھتے ہيں اہل درد مسيحا سے کام کيا
دل سے جو بات نکلتي ہے اثر رکھتي ہے
پر نہيں' طاقت پرواز مگر رکھتي ہے
قدسي الاصل ہے' رفعت پہ نظر رکھتي ہے
خاک سے اٹھتي ہے ، گردوں پہ گزر رکھتي ہے
عشق تھا فتنہ گرو سرکش و چالاک مرا
آسماں چير گيا نالہ بے باک مرا
پير گردوں نے کہا سن کے' کہيں ہے کوئي
بولے سيارے' سر عرش بريں ہے کوئي
چاند کہتا تھا' نہيں! اہل زميں ہے کوئي
کہکشاں کہتي تھي' پوشيدہ يہيں ہے کوئي
کچھ جو سمجھا مرے شکوے کو تو رضواں سمجھا
مجھے جنت سے نکالا ہوا انساں سمجھا
تھي فرشتوں کو بھي حيرت کہ يہ آواز ہے کيا
!عرش والوں پہ بھي کھلتا نہيں يہ راز ہے کيا
!تا سر عرش بھي انساں کي تگ و تاز ہے کيا
!آگئي خاک کي چٹکي کو بھي پرواز ہے کيا
غافل آداب سے سکان زميں کيسے ہيں
!شوخ و گستاخ يہ پستي کے مکيں کيسے ہيں
اس قدر شوخ کہ اللہ سے بھي برہم ہے
!تھا جو مسجود ملائک' يہ وہي آدم ہے
عالم کيف ہے' دانائے رموز کم ہے
ہاں مگر عجز کے اسرار سے نامحرم ہے
ناز ہے طاقت گفتار پہ انسانوں کو
بات کرنے کا سليقہ نہيں نادانوں کو
آئي آواز' غم انگيز ہے افسانہ ترا
اشک بے تاب سے لبريز ہے پيمانہ ترا
آسماں گير ہوا نعرئہ مستانہ ترا
کس قدر شوخ زباں ہے دل ديوانہ ترا
شکر شکوے کو کيا حسن ادا سے تو نے
ہم سخن کر ديا نبدوں کو خدا سے تو نے
ہم تو مائل بہ کرم ہيں' کوئي سائل ہي نہيں
راہ دکھلائيں کسے' رہر و منزل ہي نہيں
تربيت عام تو ہے' جوہر قابل ہي نہيں
جس سے تعمير ہو آدم کي' يہ وہ گل ہي نہيں
کوئي قابل ہو تو ہم شان کئي ديتے ہيں
ڈھونڈنے والوں کو دنيا بھي نئي ديتے ہيں
ہاتھ بے زور ہيں' الحاد سے دل خوگر ہيں
امتي باعث رسوائي پيغمبر ہيں
بت شکن اٹھ گئے' باقي جو رہے بت گر ہيں
تھا براہيم پدر اور پسر آزر ہيں
بادہ آشام نئے ، بادہ نيا' خم بھي نئے
حرم کعبہ نيا' بت بھي نئے' تم بھي نئے
وہ بھي دن تھے کہ يہي مايہ رعنائي تھا
نازش موسم گل لالہ صحرائي تھا
جو مسلمان تھا' اللہ کا سودائي تھا
کبھي محبوب تمھارا يہي ہرجائي تھا
کسي يکجائي سے اب عہد غلامي کر لو
!ملت احمد مرسل کو مقامي کو لو
کس قدر تم پہ گراں صبح کي بيداري ہے
ہم سے کب پيار ہے! ہاں نيند تمھيں پياري ہے
طبع آزاد پہ قيد رمضاں بھاري ہے
تمھي کہہ دو يہي آئين و فاداري ہے؟
قوم مذہب سے ہے' مذہب جو نہيں' تم بھي نہيں
جذب باہم جو نہيں' محفل انجم بھي نہيں
جن کو آتا نہيں دنيا ميں کوئي فن' تم ہو
نہيں جس قوم کو پروائے نشيمن، تم ہو
بجلياں جس ميں ہوں آسودہ' وہ خرمن تم ہو
بيچ کھاتے ہيں جو اسلاف کے مدفن، تم ہو
ہو نکو نام جو قبروں کي تجارت کرکے
کيا نہ بيچو گے جو مل جائيں صنم پتھر کے
صفحہ دہرئے سے باطل کو مٹايا کس نے؟
نوع انساں کو غلامي سے چھڑايا کس نے؟
ميرے کعبے کو جبينوں سے بسايا کس نے؟
ميرے قرآن کو سينوں سے لگايا کس نے؟
تھے تو آبا وہ تھارے ہي' مگر تم کيا ہو
!ہاتھ پر ہاتھ دھرے منتظر فردا ہو
کيا کہا ! بہر مسلماں ہے فقط وعدہ حور
شکوہ بے جا بھي کرے کوئي تو لازم ہے شعور
عدل ہے فاطر ہستي کا ازل سے دستور
مسلم آئيں ہوا کافر تو ملے حور و قصور
تم ميں حوروں کا کوئي چاہنے والا ہي نہيں
جلوئہ طور تو موجود ہے' موسي ہي نہيں
منفعت ايک ہے اس قوم کي' نقصان بھي ايک
ايک ہي سب کا نبي' دين بھي' ايمان بھي ايک
حرم پاک بھي' اللہ بھي' قرآن بھي ايک
کچھ بڑي بات تھي ہوتے جو مسلمان بھي ايک
فرقہ بندي ہے کہيں اور کہيں ذاتيں ہيں
کيا زمانے ميں پنپنے کي يہي باتيں ہيں
کون ہے تارک آئين رسول مختار؟
مصلحت وقت کي ہے کس کے عمل کا معيار؟
کس کي آنکھوں ميں سمايا ہے شعار اغيار؟
ہوگئي کس کي نگہ طرز سلف سے بيزار؟
قلب ميں سوز نہيں' روح ميں احساس نہيں
کچھ بھي پيغام محمد کا تمھيں پاس نہيں
جاکے ہوتے ہيں مساجد ميں صف آرا' تو غريب
زحمت روزہ جو کرتے ہيں گوارا ، تو غريب
نام ليتا ہے اگر کوئي ہمارا' تو غريب
پردہ رکھتا ہے اگر کوئي تمھارا' تو غريب
امرا نشہ دولت ميں ہيں غافل ہم سے
زندہ ہے ملت بيضا غربا کے دم سے
واعظ قوم کي وہ پختہ خيالي نہ رہي
برق طبعي نہ رہي، شعلہ مقالي نہ رہي
رہ گئي رسم اذاں روح بلالي نہ رہي
فلسفہ رہ گيا ، تلقين غزالي نہ رہي
مسجديں مرثيہ خواں ہيں کہ نمازي نہ رہے
يعني وہ صاحب اوصاف حجازي نہ رہے
شور ہے، ہو گئے دنيا سے مسلماں نابود
!ہم يہ کہتے ہيں کہ تھے بھي کہيں مسلم موجود
وضع ميں تم ہو نصاري تو تمدن ميں ہنود
يہ مسلماں ہيں! جنھيں ديکھ کے شرمائيں يہود
يوں تو سيد بھي ہو، مرزا بھي ہو، افغان بھي ہو
!تم سبھي کچھ ہو ، بتائو تو مسلمان بھي ہو
دم تقرير تھي مسلم کي صداقت بے باک
عدل اس کا تھا قوي، لوث مراعات سے پاک
شجر فطرت مسلم تھا حيا سے نم ناک
تھا شجاعت ميں وہ اک ہستي فوق الادراک
خود گدازي نم کيفيت صہبايش بود
خالي از خويش شدن صورت مينايش بود
ہر مسلماں رگ باطل کے ليے نشتر تھا
اس کے آئينہء ہستي ميں عمل جوہر تھا
جو بھروسا تھا اسے قوت بازو پر تھا
ہے تمھيں موت کا ڈر، اس کو خدا کا ڈر تھا
باپ کا علم نہ بيٹے کو اگر ازبر ہو
!پھر پسر قابل ميراث پدر کيونکر ہو
ہر کوئي مست مے ذوق تن آساني ہے
!تم مسلماں ہو! يہ انداز مسلماني ہے
حيدري فقر ہے نے دولت عثماني ہے
تم کو اسلاف سے کيا نسبت روحاني ہے؟
وہ زمانے ميں معزز تھے مسلماں ہو کر
اور تم خوار ہوئے تارک قرآں ہو کر
تم ہو آپس ميں غضب ناک، وہ آپس ميں رحيم
تم خطاکار و خطابيں، وہ خطا پوش و کريم
چاہتے سب ہيں کہ ہوں اوج ثريا پہ مقيم
پہلے ويسا کوئي پيدا تو کرے قلب سليم
تخت فغفور بھي ان کا تھا، سرير کے بھي
يونہي باتيں ہيں کہ تم ميں وہ حميت ہے بھي؟
خودکشي شيوہ تمھارا، وہ غيور و خود دار
تم اخوت سے گريزاں، وہ اخوت پہ نثار
تم ہو گفتار سراپا، وہ سراپا کردار
تم ترستے ہو کلي کو، وہ گلستاں بہ کنار
اب تلک ياد ہے قوموں کو حکايت ان کي
نقش ہے صفحہ ہستي پہ صداقت ان کي
مثل انجم افق قوم پہ روشن بھي ہوئے
بت ہندي کي محبت ميں برہمن بھي ہوئے
شوق پرواز ميں مہجور نشيمن بھي ہوئے
بے عمل تھے ہي جواں ، دين سے بدظن بھي ہوئے
ان کو تہذيب نے ہر بند سے آزاد کيا
لا کے کعبے سے صنم خانے ميں آباد کيا
قيس زحمت کش تنہائي صحرا نہ رہے
شہر کي کھائے ہوا ، باديہ پيما نہ رہے
وہ تو ديوانہ ہے، بستي ميں رہے يا نہ رہے
!يہ ضروري ہے حجاب رخ ليلا نہ رہے
گلہ جور نہ ہو ، شکوئہ بيداد نہ ہو
!عشق آزاد ہے ، کيوں حسن بھي آزاد نہ ہو
عہد نو برق ہے ، آتش زن ہر خرمن ہے
ايمن اس سے کوئي صحرا نہ کوئي گلشن ہے
اس نئي آگ کا اقوام کہن ايندھن ہے
ملت ختم رسل شعلہ بہ پيراہن ہے
آج بھي ہو جو براہيم کا ايماں پيدا
آگ کر سکتي ہے انداز گلستاں پيدا
ديکھ کر رنگ چمن ہو نہ پريشاں مالي
کوکب غنچہ سے شاخيں ہيں چمکنے والي
خس و خاشاک سے ہوتا ہے گلستاں خالي
گل بر انداز ہے خون شہدا کي لالي
رنگ گردوں کا ذرا ديکھ تو عنابي ہے
يہ نکلتے ہوئے سورج کي افق تابي ہے
امتيں گلشن ہستي ميں ثمر چيدہ بھي ہيں
اور محروم ثمر بھي ہيں، خزاں ديدہ بھي ہيں
سينکڑوں نخل ہيں، کاہيدہ بھي، باليدہ بھي ہيں
سينکڑوں بطن چمن ميں ابھي پوشيدہ بھي ہيں
نخل اسلام نمونہ ہے برومندي کا
پھل ہے يہ سينکڑوں صديوں کي چمن بندي کا
پاک ہے گرد وطن سے سر داماں تيرا
تو وہ يوسف ہے کہ ہر مصر ہے کنعاں تيرا
قافلہ ہو نہ سکے گا کبھي ويراں تيرا
غير يک بانگ درا کچھ نہيں ساماں تيرا
نخل شمع استي و درشعلہ دود ريشہ تو
عاقبت سوز بود سايہ انديشہ تو
تو نہ مٹ جائے گا ايران کے مٹ جانے سے
نشہ مے کو تعلق نہيں پيمانے سے
ہے عياں يورش تاتار کے افسانے سے
پاسباں مل گئے کعبے کو صنم خانے سے
کشتي حق کا زمانے ميں سہارا تو ہے
عصر نو رات ہے، دھندلا سا ستارا تو ہے
ہے جو ہنگامہ بپا يورش بلغاري کا
غافلوں کے ليے پيغام ہے بيداري کا
تو سمجھتا ہے يہ ساماں ہے دل آزاري کا
امتحاں ہے ترے ايثار کا، خود داري کا
کيوں ہراساں ہے صہيل فرس اعدا سے
نور حق بجھ نہ سکے گا نفس اعدا سے
چشم اقوام سے مخفي ہے حقيقت تيري
ہے ابھي محفل ہستي کو ضرورت تيري
زندہ رکھتي ہے زمانے کو حرارت تيري
کوکب قسمت امکاں ہے خلافت تيري
وقت فرصت ہے کہاں، کام ابھي باقي ہے
نور توحيد کا اتمام ابھي باقي ہے
مثل بو قيد ہے غنچے ميں، پريشاں ہوجا
رخت بردوش ہوائے چمنستاں ہوجا
ہے تنک مايہ تو ذرے سے بياباں ہوجا
!نغمہ موج سے ہنگامہء طوفاں ہوجا
قوت عشق سے ہر پست کو بالا کر دے
دہر ميں اسم محمد سے اجالا کر دے
ہو نہ يہ پھول تو بلبل کا ترنم بھي نہ ہو
چمن دہر ميں کليوں کا تبسم بھي نہ ہو
يہ نہ ساقي ہو تو پھرمے بھي نہ ہو، خم بھي نہ ہو
بزم توحيد بھي دنيا ميں نہ ہو، تم بھي نہ ہو
خيمہ افلاک کا استادہ اسي نام سے ہے
نبض ہستي تپش آمادہ اسي نام سے ہے
دشت ميں، دامن کہسار ميں، ميدان ميں ہے
بحر ميں، موج کي آغوش ميں، طوفان ميں ہے
چين کے شہر، مراقش کے بيابان ميں ہے
اور پوشيدہ مسلمان کے ايمان ميں ہے
چشم اقوام يہ نظارہ ابد تک ديکھے
رفعت شان 'رفعنالک ذکرک' ديکھے
مردم چشم زميں يعني وہ کالي دنيا
وہ تمھارے شہدا پالنے والي دنيا
گرمي مہر کي پروردہ ہلالي دنيا
عشق والے جسے کہتے ہيں بلالي دنيا
تپش اندوز ہے اس نام سے پارے کي طرح
غوطہ زن نور ميں ہے آنکھ کے تارے کي طرح
عقل ہے تيري سپر، عشق ہے شمشير تري
مرے درويش! خلافت ہے جہاں گير تري
ماسوي اللہ کے ليے آگ ہے تکبير تري
تو مسلماں ہو تو تقدير ہے تدبير تري
کي محمد سے وفا تو نے تو ہم تيرے ہيں
يہ جہاں چيز ہے کيا، لوح و قلم تيرے ہيں
نشہ پلا کے گرانا تو سب کو آتا ہے
مزا تو جب ہے کہ گرتوں کو تھام لے ساقي
جو بادہ کش تھے پرانے، وہ اٹھتے جاتے ہيں
!کہيں سے آب بقائے دوام لے ساقي
کٹي ہے رات تو ہنگامہ گستري ميں تري
!سحر قريب ہے، اللہ کا نام لے ساقي
خوش تو ہيں ہم بھي جوانوں کي ترقي سے مگر
لب خنداں سے نکل جاتي ہے فرياد بھي ساتھ
ہم سمجھتے تھے کہ لائے گي فراغت تعليم
کيا خبر تھي کہ چلا آئے گا الحاد بھي ساتھ
گھر ميں پرويز کے شيريں تو ہوئي جلوہ نما
لے کے آئي ہے مگر تيشہء فرہاد بھي ساتھ
''تخم ديگر بکف آريم و بکاريم ز نو
کانچہ کشتيم ز خجلت نتواں کرد درو
تميز حاکم و محکوم مٹ نہيں سکتي
مجال کيا کہ گداگر ہو شاہ کا ہمدوش
جہاں ميں خواجہ پرستي ہے بندگي کا کمال
رضاے خواجہ طلب کن قباے رنگيں پوش
مگر غرض جو حصول رضائے حاکم ہو
خطاب ملتا ہے منصب پرست و قوم فروش
پرانے طرز عمل ميں ہزار مشکل ہے
نئے اصول سے خالي ہے فکر کي آغوش
مزا تو يہ ہے کہ يوں زير آسماں رہيے
''ہزار گونہ سخن در دہان و لب خاموش''
يہي اصول ہے سرمايہء سکون حيات
''گداے گوشہ نشيني تو حافظا مخروش''
مگر خروش پہ مائل ہے تو ، تو بسم اللہ
''بگير بادئہ صافي، ببانگ چنگ بنوش''
شريک بزم امير و وزير و سلطاں ہو
لڑا کے توڑ دے سنگ ہوس سے شيشہء ہوش
پيام مرشد شيراز بھي مگر سن لے
کہ ہے يہ سر نہاں خانہء ضمير سروش
محل نور تجلي ست راے انور شاہ ''
''چو قرب او طلبي درصفاے نيت کوش
جوئے سرود آفريں آتي ہے کوہسار سے
پي کے شراب لالہ گوں مے کدئہ بہار سے
مست مے خرام کا سن تو ذرا پيام تو
زندہ وہي ہے کام کچھ جس کو نہيں قرار سے
پھرتي ہے واديوں ميں کيا دخترخوش خرام ابر
کرتي ہے عشق بازياں سبزئہ مرغزار سے
جام شراب کوہ کے خم کدے سے اڑاتي ہے
پست و بلند کرکے طے کھيتوں کو جا پلاتي ہے
شاعر دل نواز بھي بات اگر کہے کھري
ہوتي ہے اس کے فيض سے مزرع زندگي ہري
شان خليل ہوتي ہے اس کے کلام سے عياں
کرتي ہے اس کي قوم جب اپنا شعار آزري
اہل زميں کو نسخہء زندگي دوام ہے
خون جگر سے تربيت پاتي ہے جو سخنوري
گلشن دہر ميں اگر جوئے مے سخن نہ ہو
پھول نہ ہو، کلي نہ ہو، سبزہ نہ ہو، چمن نہ ہو
آتي ہے مشرق سے جب ہنگامہ در دامن سحر
منزل ہستي سے کر جاتي ہے خاموشي سفر
محفل قدرت کا آخر ٹوٹ جاتا ہے سکوت
ديتي ہے ہر چيز اپني زندگاني کا ثبوت
چہچاتے ہيں پرندے پا کے پيغام حيات
باندھتے ہيں پھول بھي گلشن ميں احرام حيات
مسلم خوابيدہ اٹھ ، ہنگامہ آرا تو بھي ہو
وہ چمک اٹھا افق ، گرم تقاضا تو بھي ہو
وسعت عالم ميں رہ پيما ہو مثل آفتاب
دامن گردوں سے ناپيدا ہوں يہ داغ سحاب
کھينچ کر خنجر کرن کا ، پھر ہو سرگرم ستيز
پھر سکھا تاريکي باطل کو آداب گريز
تو سراپا نور ہے، خوشتر ہے عرياني تجھے
اور عرياں ہو کے لازم ہے خود افشاني تجھے
ہاں ، نماياں ہو کے برق ديدئہ خفاش ہو
اے دل کون ومکاں کے راز مضمر! فاش ہو
يا رب! دل مسلم کو وہ زندہ تمنا دے
جو قلب کو گرما دے ، جو روح کو تڑپا دے
پھر وادي فاراں کے ہر ذرے کو چمکا دے
پھر شوق تماشا دے، پھر ذوق تقاضا دے
محروم تماشا کو پھر ديدئہ بينا دے
ديکھا ہے جو کچھ ميں نے اوروں کو بھي دکھلا دے
بھٹکے ہوئے آہو کو پھر سوئے حرم لے چل
اس شہر کے خوگر کو پھر وسعت صحرا دے
پيدا دل ويراں ميں پھر شورش محشر کر
اس محمل خالي کو پھر شاہد ليلا دے
اس دور کي ظلمت ميں ہر قلب پريشاں کو
وہ داغ محبت دے جو چاند کو شرما دے
رفعت ميں مقاصد کو ہمدوش ثريا کر
خودداري ساحل دے، آزادي دريا دے
بے لوث محبت ہو ، بے باک صداقت ہو
سينوں ميں اجالا کر، دل صورت مينا دے
احساس عنايت کر آثار مصيبت کا
امروز کي شورش ميں انديشہء فردا دے
ميں بلبل نالاں ہوں اک اجڑے گلستاں کا
!تاثير کا سائل ہوں ، محتاج کو ، داتا دے
يہ شالامار ميں اک برگ زرد کہتا تھا
گيا وہ موسم گل جس کا رازدار ہوں ميں
نہ پائمال کريں مجھ کو زائران چمن
انھي کي شاخ نشيمن کي يادگار ہوں ميں
ذرا سے پتے نے بيتاب کر ديا دل کو
چمن ميں آکے سراپا غم بہار ہوں ميں
خزاں ميں مجھ کو رلاتي ہے ياد فصل بہار
خوشي ہو عيد کي کيونکر کہ سوگوار ہوں ميں
اجاڑ ہو گئے عہد کہن کے ميخانے
گزشتہ بادہ پرستوں کي يادگار ہوں ميں
پيام عيش ، مسرت ہميں سناتا ہے
ہلال عيد ہماري ہنسي اڑاتا ہے
فاطمہ! تو آبروئے امت مرحوم ہے
ذرہ ذرہ تيري مشت خاک کا معصوم ہے
يہ سعادت ، حور صحرائي! تري قسمت ميں تھي
غازيان ديں کي سقائي تري قسمت ميں تھي
يہ جہاد اللہ کے رستے ميں بے تيغ و سپر
ہے جسارت آفريں شوق شہادت کس قدر
يہ کلي بھي اس گلستان خزاں منظر ميں تھي
!ايسي چنگاري بھي يارب، اپني خاکستر ميں تھي
اپنے صحرا ميں بہت آہو ابھي پوشيدہ ہيں
!بجلياں برسے ہوئے بادل ميں بھي خوابيدہ ہيں
فاطمہ! گو شبنم افشاں آنکھ تيرے غم ميں ہے
نغمہ عشرت بھي اپنے نالہ ماتم ميں ہے
رقص تيري خاک کا کتنا نشاط انگيز ہے
ذرہ ذرہ زندگي کے سوز سے لبريز ہے
ہے کوئي ہنگامہ تيري تربت خاموش ميں
پل رہي ہے ايک قوم تازہ اس آغوش ميں
بے خبر ہوں گرچہ ان کي وسعت مقصد سے ميں
آفرينش ديکھتا ہوں ان کي اس مرقد سے ميں
تازہ انجم کا فضائے آسماں ميں ہے ظہور
ديدئہ انساں سے نامحرم ہے جن کي موج نور
جو ابھي ابھرے ہيں ظلمت خانہء ايام سے
جن کي ضو ناآشنا ہے قيد صبح و شام سے
جن کي تاباني ميں انداز کہن بھي، نو بھي ہے
اور تيرے کوکب تقدير کا پرتو بھي ہے
اک رات يہ کہنے لگے شبنم سے ستارے
ہر صبح نئے تجھ کو ميسر ہيں نظارے
کيا جانيے ، تو کتنے جہاں ديکھ چکي ہے
جو بن کے مٹے، ان کے نشاں ديکھ چکي ہے
زہرہ نے سني ہے يہ خبر ايک ملک سے
انسانوں کي بستي ہے بہت دور فلک سے
کہہ ہم سے بھي اس کشور دلکش کا فسانہ
گاتا ہے قمر جس کي محبت کا ترانہ
اے تارو نہ پوچھو چمنستان جہاں کي
گلشن نہيں ، اک بستي ہے وہ آہ و فغاں کي
آتي ہے صبا واں سے پلٹ جانے کي خاطر
بے چاري کلي کھلتي ہے مرجھانے کي خاطر
کيا تم سے کہوں کيا چمن افروز کلي ہے
ننھا سا کوئي شعلہ بے سوز کلي ہے
گل نالہ بلبل کي صدا سن نہيں سکتا
دامن سے مرے موتيوں کو چن نہيں سکتا
ہيں مرغ نواريز گرفتار، غضب ہے
اگتے ہيں تہ سايہ گل خار، غضب ہے
رہتي ہے سدا نرگس بيمار کي تر آنکھ
دل طالب نظارہ ہے ، محروم نظر آنکھ
دل سوختہ گرمي فرياد ہے شمشاد
زنداني ہے اور نام کو آزاد ہے شمشاد
تارے شرر آہ ہيں انساں کي زباں ميں
ميں گريہ گردوں ہوں گلستاں کي زباں ميں
ناداني ہے يہ گرد زميں طوف قمر کا
سمجھا ہے کہ درماں ہے وہاں داغ جگر کا
بنياد ہے کاشانہ عالم کي ہوا پر
فرياد کي تصوير ہے قرطاس فضا پر
يورپ ميں جس گھڑي حق و باطل کي چھڑ گئي
حق خنجر آزمائي پہ مجبور ہو گيا
گرد صليب گرد قمر حلقہ زن ہوئي
شکري حصار درنہ ميں محصور ہو گيا
مسلم سپاہيوں کے ذخيرے ہوئے تمام
روئے اميد آنکھ سے مستور ہو گيا
آخر امير عسکر ترکي کے حکم سے
'آئين جنگ' شہر کا دستور ہوگيا
ہر شے ہوئي ذخيرہ لشکر ميں منتقل
شاہيں گدائے دانہء عصفور ہو گيا
ليکن فقيہ شہر نے جس دم سني يہ بات
گرما کے مثل صاعقہ طور ہو گيا
ذمي کا مال لشکر مسلم پہ ہے حرام
فتوي تمام شہر ميں مشہور ہو گيا
چھوتي نہ تھي يہود و نصاري کا مال فوج
مسلم ، خدا کے حکم سے مجبور ہوگيا
رہيلہ کس قدر ظالم، جفا جو، کينہ پرور تھا
نکاليں شاہ تيموري کي آنکھيں نوک خنجر سے
ديا اہل حرم کو رقص کا فرماں ستم گر نے
يہ انداز ستم کچھ کم نہ تھا آثار محشر سے
!بھلا تعميل اس فرمان غيرت کش کي ممکن تھي
شہنشاہي حرم کي نازنينان سمن بر سے
بنايا آہ! سامان طرب بيدرد نے ان کو
نہاں تھا حسن جن کا چشم مہر و ماہ و اختر سے
لرزتے تھے دل نازک، قدم مجبور جنبش تھے
رواں دريائے خوں ، شہزاديوں کے ديدئہ تر سے
يونہي کچھ دير تک محو نظر آنکھيں رہيں اس کي
کيا گھبرا کے پھر آزاد سر کو بار مغفر سے
کمر سے ، اٹھ کے تيغ جاں ستاں ، آتش فشاں کھولي
سبق آموز تاباني ہوں انجم جس کے جوہر سے
رکھا خنجر کو آگے اور پھر کچھ سوچ کر ليٹا
تقاضا کر رہي تھي نيند گويا چشم احمر سے
بجھائے خواب کے پاني نے اخگر اس کي آنکھوں کے
نظر شرما گئي ظالم کي درد انگيز منظر سے
پھر اٹھا اور تيموري حرم سے يوں لگا کہنے
شکايت چاہيے تم کو نہ کچھ اپنے مقدر سے
مرا مسند پہ سو جانا بناوٹ تھي، تکلف تھا
کہ غفلت دور سے شان صف آرايان لشکر سے
يہ مقصد تھا مرا اس سے ، کوئي تيمور کي بيٹي
مجھے غافل سمجھ کر مار ڈالے ميرے خنجر سے
مگر يہ راز آخر کھل گيا سارے زمانے پر
حميت نام ہے جس کا، گئي تيمور کے گھر سے
اک مرغ سرا نے يہ کہا مرغ ہوا سے
!پردار اگر تو ہے تو کيا ميں نہيں پردار
گر تو ہے ہوا گير تو ہوں ميں بھي ہوا گير
آزاد اگر تو ہے ، نہيں ميں بھي گرفتار
پرواز ، خصوصيت ہر صاحب پر ہے
کيوں رہتے ہيں مرغان ہوا مائل پندار؟
مجروح حميت جو ہوئي مرغ ہوا کي
يوں کہنے لگا سن کے يہ گفتار دل آزار
کچھ شک نہيں پرواز ميں آزاد ہے تو بھي
حد ہے تري پرواز کي ليکن سر ديوار
واقف نہيں تو ہمت مرغان ہوا سے
تو خاک نشيمن ، انھيں گردوں سے سروکار
تو مرغ سرائي ، خورش از خاک بجوئي
ما در صدد دانہ بہ انجم زدہ منقار
مذاق ديد سے ناآشنا نظر ہے مري
تري نگاہ ہے فطرت کي راز داں، پھر کيا
رہين شکوئہ ايام ہے زبان مري
تري مراد پہ ہے دور آسماں، پھر کيا
رکھا مجھے چمن آوارہ مثل موج نسيم
عطا فلک نے کيا تجھ کو آشياں، پھر کيا
فزوں ہے سود سے سرمايہء حيات ترا
مرے نصيب ميں ہے کاوش زياں، پھر کيا
ہوا ميں تيرتے پھرتے ہيں تيرے طيارے
مرا جہاز ہے محروم بادباں، پھر کيا
قوي شديم چہ شد، ناتواں شديم چہ شد
چنيں شديم چہ شد يا چناں شديم چہ شد
بہيچ گونہ دريں گلستاں قرارے نيست
توگر بہار شدي، ما خزاں شديم، چہ شد
خوب ہے تجھ کو شعار صاحب ثيرب کا پاس
کہہ رہي ہے زندگي تيري کہ تو مسلم نہيں
جس سے تيرے حلقہء خاتم ميں گردوں تھا اسير
اے سليماں! تيري غفلت نے گنوايا وہ نگيں
وہ نشان سجدہ جو روشن تھا کوکب کي طرح
ہوگئي ہے اس سے اب ناآشنا تيري جبيں
ديکھ تو اپنا عمل، تجھ کو نظر آتي ہے کيا
وہ صداقت جس کي بے باکي تھي حيرت آفريں
تيرے آبا کي نگہ بجلي تھي جس کے واسطے
ہے وہي باطل ترے کاشانہء دل ميں مکيں
غافل! اپنے آشياں کو آ کے پھر آباد کر
نغمہ زن ہے طور معني پر کليم نکتہ بيں
،سرکشي باہر کہ کردي رام او بايد شدن
،شعلہ ساں از ہر کجا برخاستي ، آنجانشيں
مسلم سے ايک روز يہ اقبال نے کہا
ديوان جزو و کل ميں ہے تيرا وجود فرد
تيرے سرود رفتہ کے نغمے علوم نو
تہذيب تيرے قافلہ ہائے کہن کي گرد
پتھر ہے اس کے واسطے موج نسيم بھي
نازک بہت ہے آئنہ آبروئے مرد
مردان کار، ڈھونڈ کے اسباب حادثات
کرتے ہيں چارئہ ستم چرخ لاجورد
پوچھ ان سے جو چمن کے ہيں ديرنيہ رازدار
کيونکر ہوئي خزاں ترے گلشن سے ہم نبرد
مسلم مرے کلام سے بے تاب ہوگيا
غماز ہوگئي غم پنہاں کي آہ سرد
کہنے لگا کہ ديکھ تو کيفيت خزاں
اوراق ہو گئے شجر زندگي کے زرد
خاموش ہو گئے چمنستاں کے رازدار
سرمايہ گداز تھي جن کي نوائے درد
شبلي کو رو رہے تھے ابھي اہل گلستاں
حالي بھي ہوگيا سوئے فردوس رہ نورد
اکنوں کرا دماغ کہ پرسد زباغباں ''
''بلبل چہ گفت و گل چہ شنيد و صبا چہ کرد
ستيزہ کار رہا ہے ازل سے تا امروز
چراغ مصطفوي سے شرار بولہبي
حيات شعلہ مزاج و غيور و شور انگيز
سرشت اس کي ہے مشکل کشي، جفا طلبي
سکوت شام سے تا نغمہ سحر گاہي
ہزار مرحلہ ہائے فعان نيم شبي
کشا کش زم و گرما، تپ و تراش و خراش
ز خاک تيرہ دروں تا بہ شيشہ حلبي
مقام بست و شکت و فشار و سوز و کشيد
ميان قطرئہ نيسان و آتش عنبي
اسي کشاکش پيہم سے زندہ ہيں اقوام
يہي ہے راز تب و تاب ملت عربي
مغاں کہ دانہء انگور آب مي سازند ''
''ستارہ مي شکنند، آفتاب مي سازند
اک دن رسول پاک نے اصحاب سے کہا
ديں مال راہ حق ميں جو ہوں تم ميں مالدار
ارشاد سن کے فرط طرب سے عمر اٹھے
اس روز ان کے پاس تھے درہم کئي ہزار
دل ميں يہ کہہ رہے تھے کہ صديق سے ضرور
بڑھ کر رکھے گا آج قدم ميرا راہوار
لائے غرضکہ مال رسول اميں کے پاس
ايثار کي ہے دست نگر ابتدائے کار
!پوچھا حضور سرور عالم نے ، اے عمر
اے وہ کہ جوش حق سے ترے دل کو ہے قرار
رکھا ہے کچھ عيال کي خاطر بھي تو نے کيا؟
مسلم ہے اپنے خويش و اقارب کا حق گزار
کي عرض نصف مال ہے فرزند و زن کا حق
باقي جو ہے وہ ملت بيضا پہ ہے نثار
اتنے ميں وہ رفيق نبوت بھي آگيا
جس سے بنائے عشق و محبت ہے استوار
لے آيا اپنے ساتھ وہ مرد وفا سرشت
ہر چيز ، جس سے چشم جہاں ميں ہو اعتبار
ملک يمين و درہم و دينار و رخت و جنس
اسپ قمر سم و شتر و قاطر و حمار
بولے حضور، چاہيے فکر عيال بھي
کہنے لگا وہ عشق و محبت کا راز دار
!اے تجھ سے ديدئہ مہ و انجم فروغ گير
!اے تيري ذات باعث تکوين روزگار
پروانے کو چراغ ہے، بلبل کو پھول بس
صديق کے ليے ہے خدا کا رسول بس
حرارت ہے بلاکي بادئہ تہذيب حاضر ميں
بھڑک اٹھا بھبوکا بن کے مسلم کا تن خاکي
کيا ذرے کو جگنو دے کے تاب مستعار اس نے
کوئي ديکھے تو شوخي آفتاب جلوہ فرما کي
نئے انداز پائے نوجوانوں کي طبيعت نے
يہ رعنائي ، يہ بيداري ، يہ آزادي ، يہ بے باکي
تغير آگيا ايسا تدبر ميں، تخيل ميں
ہنسي سمجھي گئي گلشن ميں غنچوں کي جگر چاکي
کيا گم تازہ پروازوں نے اپنا آشياں ليکن
مناظر دلکشا دکھلا گئي ساحر کي چالاکي
حيات تازہ اپنے ساتھ لائي لذتيں کيا کيا
رقابت ، خودفروشي ، ناشکيبائي ، ہوسناکي
فروغ شمع نو سے بزم مسلم جگمگا اٹھي
مگر کہتي ہے پروانوں سے ميري کہنہ ادراکي
تو اے پروانہ ! ايں گرمي ز شمع محفلے داري ''
''چو من در آتش خود سوز اگر سوز دلے داري
ذرہ ذرہ دہر کا زنداني تقدير ہے
پردئہ مجبوري و بے چارگي تدبير ہے
آسماں مجبور ہے، شمس و قمر مجبور ہيں
انجم سيماب پا رفتار پر مجبور ہيں
ہے شکت انجام غنچے کا سبو گلزار ميں
سبزہ و گل بھي ہيں مجبور نمو گلزار ميں
نغمہ بلبل ہو يا آواز خاموش ضمير
ہے اسي زنجير عالم گير ميں ہر شے اسير
آنکھ پر ہوتا ہے جب يہ سر مجبوري عياں
خشک ہو جاتا ہے دل ميں اشک کا سيل رواں
قلب انساني ميں رقص عيش و غم رہتا نہيں
نغمہ رہ جاتا ہے ، لطف زيروبم رہتا نہيں
علم و حکمت رہزن سامان اشک و آہ ہے
يعني اک الماس کا ٹکڑا دل آگاہ ہے
گرچہ ميرے باغ ميں شبنم کي شادابي نہيں
آنکھ ميري مايہ دار اشک عنابي نہيں
جانتا ہوں آہ ، ميں آلام انساني کا راز
ہے نوائے شکوہ سے خالي مري فطرت کا ساز
ميرے لب پر قصہ نيرنگي دوراں نہيں
دل مرا حيراں نہيں، خنداں نہيں، گرياں نہيں
پر تري تصوير قاصد گريہء پيہم کي ہے
آہ! يہ ترديد ميري حکمت محکم کي ہے
گريہ سرشار سے بنياد جاں پائندہ ہے
درد کے عرفاں سے عقل سنگدل شرمندہ ہے
موج دود آہ سے آئينہ ہے روشن مرا
گنج آب آورد سے معمور ہے دامن مرا
حيرتي ہوں ميں تري تصوير کے اعجاز کا
رخ بدل ڈالا ہے جس نے وقت کي پرواز کا
رفتہ و حاضر کو گويا پا بپا اس نے کيا
عہد طفلي سے مجھے پھر آشنا اس نے کيا
جب ترے دامن ميں پلتي تھي وہ جان ناتواں
بات سے اچھي طرح محرم نہ تھي جس کي زباں
اور اب چرچے ہيں جس کي شوخي گفتار کے
بے بہا موتي ہيں جس کي چشم گوہربار کے
علم کي سنجيدہ گفتاري، بڑھاپے کا شعور
دنيوي اعزاز کي شوکت، جواني کا غرور
زندگي کي اوج گاہوں سے اتر آتے ہيں ہم
صحبت مادر ميں طفل سادہ رہ جاتے ہيں ہم
بے تکلف خندہ زن ہيں، فکر سے آزاد ہيں
پھر اسي کھوئے ہوئے فردوس ميں آباد ہيں
کس کو اب ہوگا وطن ميں آہ! ميرا انتظار
کون ميرا خط نہ آنے سے رہے گا بے قرار
خاک مرقد پر تري لے کر يہ فرياد آئوں گا
!اب دعائے نيم شب ميں کس کو ياد ميں آئوں گا
تربيت سے تيري ميں انجم کا ہم قسمت ہوا
گھر مرے اجداد کا سرمايہ عزت ہوا
دفتر ہستي ميں تھي زريں ورق تيري حيات
تھي سراپا ديں و دنيا کا سبق تيري حيات
عمر بھر تيري محبت ميري خدمت گر رہي
ميں تري خدمت کے قابل جب ہوا تو چل بسي
وہ جواں، قامت ميں ہے جو صورت سرو بلند
تيري خدمت سے ہوا جو مجھ سے بڑھ کر بہرہ مند
کاروبار زندگاني ميں وہ ہم پہلو مرا
وہ محبت ميں تري تصوير، وہ بازو مرا
تجھ کو مثل طفلک بے دست و پا روتا ہے وہ
صبر سے ناآشنا صبح و مسا روتا ہے وہ
تخم جس کا تو ہماري کشت جاں ميں بو گئي
شرکت غم سے وہ الفت اور محکم ہوگئي
آہ! يہ دنيا ، يہ ماتم خانہ برنا و پير
!آدمي ہے کس طلسم دوش و فردا ميں اسير
کتني مشکل زندگي ہے، کس قدر آساں ہے موت
گلشن ہستي ميں مانند نسيم ارزاں ہے موت
زلزلے ہيں، بجلياں ہيں، قحط ہيں، آلام ہيں
!کيسي کيسي دختران مادر ايام ہيں
کلبہ افلاس ميں، دولت کے کاشانے ميں موت
دشت و در ميں، شہر ميں، گلشن ميں، ويرانے ميں موت
موت ہے ہنگامہ آرا قلزم خاموش ميں
ڈوب جاتے ہيں سفينے موج کي آغوش ميں
نے مجال شکوہ ہے، نے طاقت گفتار ہے
!زندگاني کيا ہے ، اک طوق گلو افشار ہے
قافلے ميں غير فرياد درا کچھ بھي نہيں
اک متاع ديدئہ تر کے سوا کچھ بھي نہيں
ختم ہو جائے گا ليکن امتحاں کا دور بھي
ہيں پس نہ پردئہ گردوں ابھي اور بھي
سينہ چاک اس گلستاں ميں لالہ و گل ہيں تو کيا
نالہ و فرياد پر مجبور بلبل ہيں تو کيا
جھاڑياں، جن کے قفس ميں قيد ہے آہ خزاں
سبز کر دے گي انھيں باد بہار جاوداں
خفتہ خاک پے سپر ميں ہے شرار اپنا تو کيا
عارضي محمل ہے يہ مشت غبار اپنا تو کيا
زندگي کي آگ کا انجام خاکستر نہيں
ٹوٹنا جس کا مقدر ہو يہ وہ گوہر نہيں
زندگي محبوب ايسي ديدئہ قدرت ميں ہے
ذوق حفظ زندگي ہر چيز کي فطرت ميں ہے
موت کے ہاتھوں سے مٹ سکتا اگر نقش حيات
عام يوں اس کو نہ کر ديتا نظام کائنات
ہے اگر ارزاں تو يہ سمجھو اجل کچھ بھي نہيں
جس طرح سونے سے جينے ميں خلل کچھ بھي نہيں
آہ غافل! موت کا راز نہاں کچھ اور ہے
نقش کي ناپائداري سے عياں کچھ اور ہے
جنت نظارہ ہے نقش ہوا بالائے آب
موج مضطر توڑ کر تعمير کرتي ہے حباب
موج کے دامن ميں پھر اس کو چھپا ديتي ہے يہ
کتني بيدردي سے نقش اپنا مٹا ديتي ہے يہ
پھر نہ کر سکتي حباب اپنا اگر پيدا ہوا
توڑنے ميں اس کے يوں ہوتي نہ بے پروا ہوا
اس روش کا کيا اثر ہے ہےئت تعمير پر
يہ تو حجت ہے ہوا کي قوت تعمير پر
فطرت ہستي شہيد آرزو رہتي نہ ہو
خوب تر پيکر کي اس کو جستجو رہتي نہ ہو
آہ سيماب پريشاں ، انجم گردوں فروز
شوخ يہ چنگارياں ، ممنون شب ہے جن کا سوز
عقل جس سے سر بہ زانو ہے وہ مدت ان کي ہے
سرگزشت نوع انساں ايک ساعت ان کي ہے
پھر يہ انساں، آں سوئے افلاک ہے جس کي نظر
قدسيوں سے بھي مقاصد ميں ہے جو پاکيزہ تر
جو مثال شمع روشن محفل قدرت ميں ہے
آسماں اک نقطہ جس کي وسعت فطرت ميں ہے
جس کي ناداني صداقت کے ليے بيتاب ہے
جس کا ناخن ساز ہستي کے ليے مضراب ہے
شعلہ يہ کمتر ہے گردوں کے شراروں سے بھي کيا
کم بہا ہے آفتاب اپنا ستاروں سے بھي کيا
تخم گل کي آنکھ زير خاک بھي بے خواب ہے
کس قدر نشوونما کے واسطے بے تاب ہے
زندگي کا شعلہ اس دانے ميں جو مستور ہے
خود نمائي ، خودفزائي کے ليے مجبور ہے
سردي مرقد سے بھي افسردہ ہو سکتا نہيں
خاک ميں دب کر بھي اپنا سوز کھو سکتا نہيں
پھول بن کر اپني تربت سے نکل آتا ہے يہ
موت سے گويا قبائے زندگي پاتا ہے يہ
ہے لحد اس قوت آشفتہ کي شيرازہ بند
ڈالتي ہے گردن گردوں ميں جو اپني کمند
موت، تجديد مذاق زندگي کا نام ہے
خواب کے پردے ميں بيداري کا اک پيغام ہے
خوگر پرواز کو پرواز ميں ڈر کچھ نہيں
موت اس گلشن ميں جز سنجيدن پر کچھ نہيں
کہتے ہيں اہل جہاں درد اجل ہے لا دوا
زخم فرقت وقت کے مرہم سے پاتا ہے شفا
دل مگر ، غم مرنے والوں کا جہاں آباد ہے
حلقہ زنجير صبح و شام سے آزاد ہے
وقت کے افسوں سے تھمتا نالئہ ماتم نہيں
وقت زخم تيغ فرقت کا کوئي مرہم نہيں
سر پہ آجاتي ہے جب کوئي مصيبت ناگہاں
اشک پيہم ديدئہ انساں سے ہوتے ہيں رواں
ربط ہو جاتا ہے دل کو نالہ و فرياد سے
خون دل بہتا ہے آنکھوں کي سرشک آباد سے
آدمي تاب شکيبائي سے گو محروم ہے
اس کي فطرت ميں يہ اک احساس نامعلوم ہے
جوہر انساں عدم سے آشنا ہوتا نہيں
آنکھ سے غائب تو ہوتا ہے ،فنا ہوتا نہيں
رخت ہستي خاک، غم کي شعلہ افشاني سے ہے
سرد يہ آگ اس لطيف احساس کے پاني سے ہے
آہ، يہ ضبط فغاں غفلت کي خاموشي نہيں
آگہي ہے يہ دل آسائي، فراموشي نہيں
پردئہ مشرق سے جس دم جلوہ گر ہوتي ہے صبح
داغ شب کا دامن آفاق سے دھوتي ہے صبح
لالہ افسردہ کو آتش قبا کرتي ہے يہ
بے زباں طائر کو سرمست نوا کرتي ہے يہ
سينہ بلبل کے زنداں سے سرود آزاد ہے
سينکڑوں نغموں سے باد صج دم آباد ہے
خفتگان لالہ زار و کوہسار و رودباد
ہوتے ہيں آخر عروس زندگي سے ہمکنار
يہ اگر آئين ہستي ہے کہ ہو ہر شام صبح
مرقد انساں کي شب کا کيوں نہ ہو انجام صبح
دام سيمين تخيل ہے مرا آفاق گير
کر ليا ہے جس سے تيري ياد کو ميں نے اسير
ياد سے تيري دل درد آشنا معمور ہے
جيسے کعبے ميں دعاؤں سے فضا معمور ہے
وہ فرائض کا تسلسل نام ہے جس کا حيات
جلوہ گاہيں اس کي ہيں لاکھوں جہاں بے ثبات
مختلف ہر منزل ہستي کي رسم و راہ ہے
آخرت بھي زندگي کي ايک جولاں گاہ ہے
ہے وہاں بے حاصلي کشت اجل کے واسطے
ساز گار آب و ہوا تخم عمل کے واسطے
نور فطرت ظلمت پيکر کا زنداني نہيں
تنگ ايسا حلقہء افکار انساني نہيں
زندگاني تھي تري مہتاب سے تابندہ تر
خوب تر تھا صبح کے تارے سے بھي تيرا سفر
مثل ايوان سحر مرقد فروزاں ہو ترا
نور سے معمور يہ خاکي شبستاں ہو ترا
آسماں تيري لحد پر شبنم افشاني کرے
سبزئہ نورستہ اس گھر کي نگہباني کرے
صبح جب ميري نگہ سودائي نظارہ تھي
آسماں پر اک شعاع آفتاب آوارہ تھي
!ميں نے پوچھا اس کرن سے ''اے سراپا اضطراب
تيري جان ناشکيبا ميں ہے کيسا اضطراب
تو کوئي چھوٹي سي بجلي ہے کہ جس کو آسماں
کر رہا ہے خرمن اقوام کي خاطر جواں
يہ تڑپ ہے يا ازل سے تيري خو ہے، کيا ہے يہ
رقص ہے، آوارگي ہے، جستجو ہے، کيا ہے يہ''؟
''خفتہ ہنگامے ہيں ميري ہستي خاموش ميں
پرورش پائي ہے ميں نے صبح کي آغوش ميں
مضطرب ہر دم مري تقدير رکھتي ہے مجھے
جستجو ميں لذت تنوير رکھتي ہے مجھے
برق آتش خو نہيں، فطرت ميں گو ناري ہوں ميں
مہر عالم تاب کا پيغام بيداري ہوں ميں
سرمہ بن کر چشم انساں ميں سما جائوں گي ميں
رات نے جو کچھ چھپا رکھا تھا، دکھلائوں گي ميں
تيرے مستوں ميں کوئي جويائے ہشياري بھي ہے
سونے والوں ميں کسي کو ذوق بيداري بھي ہے؟
محل ايسا کيا تعمير عرفي کے تخيل نے
تصدق جس پہ حيرت خانہء سينا و فارابي
فضائے عشق پر تحرير کي اس نے نوا ايسي
ميسر جس سے ہيں آنکھوں کو اب تک اشک عنابي
مرے دل نے يہ اک دن اس کي تربت سے شکايت کي
نہيں ہنگامہ عالم ميں اب سامان بيتابي
مزاج اہل عالم ميں تغير آگيا ايسا
کہ رخصت ہوگئي دنيا سے کيفيت وہ سيمابي
فغان نيم شب شاعر کي بار گوش ہوتي ہے
نہ ہو جب چشم محفل آشنائے لطف بے خوابي
کسي کا شعلہء فرياد ہو ظلمت ربا کيونکر
گراں ہے شب پرستوں پر سحر کي آسماں تابي
صدا تربت سے آئي ، شکوہء اہل جہاں کم گو
نوارا تلخ تر مي زن چو ذوق نغمہ کم يابي ''
ہوس بھي ہو تو نہيں مجھ ميں ہمت تگ و تاز
حصول جاہ ہے وابستہ مذاق تلاش
ہزار شکر، طبيعت ہے ريزہ کار مري
ہزار شکر، نہيں ہے دماغ فتنہ تراش
مرے سخن سے دلوں کي ہيں کھيتياں سرسبز
جہاں ميں ہوں ميں مثال سحاب دريا پاش
يہ عقدہ ہائے سياست تجھے مبارک ہوں
کہ فيض عشق سے ناخن مرا ہے سينہ خراش
ہوائے بزم سلاطيں دليل مردہ دلي
کيا ہے حافظ رنگيں نوا نے راز يہ فاش
گرت ہوا ست کہ با خضر ہم نشيں باشي ''
''نہاں ز چشم سکندر چو آب حيواں باش
قوم نے پيغام گو تم کي ذرا پروا نہ کي
قدر پہچاني نہ اپنے گوہر يک دانہ کي
آہ! بد قسمت رہے آواز حق سے بے خبر
غافل اپنے پھل کي شيريني سے ہوتا ہے شجر
آشکار اس نے کيا جو زندگي کا راز تھا
ہند کو ليکن خيالي فلسفے پر ناز تھا
شمع حق سے جو منور ہو يہ وہ محفل نہ تھي
بارش رحمت ہوئي ليکن زميں قابل نہ تھي
آہ! شودر کے ليے ہندوستاں غم خانہ ہے
درد انساني سے اس بستي کا دل بيگانہ ہے
برہمن سرشار ہے اب تک مےء پندار ميں
شمع گو تم جل رہي ہے محفل اغيار ميں
بت کدہ پھر بعد مدت کے مگر روشن ہوا
نور ابراہيم سے آزر کا گھر روشن ہوا
پھر اٹھي آخر صدا توحيد کي پنجاب سے
ہند کو اک مرد کامل نے جگايا خواب سے
ايک دن اقبال نے پوچھا کليم طور سے
اے کہ تيرے نقش پا سے وادي سينا چمن
آتش نمرود ہے اب تک جہاں ميں شعلہ ريز
ہوگيا آنکھوں سے پنہاں کيوں ترا سوز کہن
تھا جواب صاحب سينا کہ مسلم ہے اگر
چھوڑ کر غائب کو تو حاضر کا شيدائي نہ بن
ذوق حاضر ہے تو پھر لازم ہے ايمان خليل
ورنہ خاکستر ہے تيري زندگي کا پيرہن
ہے اگر ديوانہء غائب تو کچھ پروا نہ کر
منتظر رہ وادي فاراں ميں ہو کر خيمہ زن
عارضي ہے شان حاضر ، سطوت غائب مدام
اس صداقت کو محبت سے ہے ربط جان و تن
شعلہ نمرود ہے روشن زمانے ميں تو کيا
شمع خود رامي گدازد درميان انجمن ''
لکھا ہے ايک مغربي حق شناس نے
اہل قلم ميں جس کا بہت احترام تھا
جولاں گہ سکندر رومي تھا ايشيا
گردوں سے بھي بلند تر اس کا مقام تھا
تاريخ کہہ رہي ہے کہ رومي کے سامنے
دعوي کيا جو پورس و دارا نے، خام تھا
دنيا کے اس شہنشہ انجم سپاہ کو
حيرت سے ديکھتا فلک نيل فام تھا
آج ايشيا ميں اس کو کوئي جانتا نہيں
تاريخ دان بھي اسے پہچانتا نہيں
ليکن بلال، وہ حبشي زادئہ حقير
فطرت تھي جس کي نور نبوت سے مستنير
جس کا اميں ازل سے ہوا سينہء بلال
محکوم اس صدا کے ہيں شاہنشہ و فقير
ہوتا ہے جس سے اسود و احمر ميں اختلاط
کرتي ہے جو غريب کو ہم پہلوئے امير
ہے تازہ آج تک وہ نوائے جگر گداز
صديوں سے سن رہا ہے جسے گوش چرخ پير
اقبال! کس کے عشق کا يہ فيض عام ہے
رومي فنا ہوا ، حبشي کو دوام ہے
مرشد کي يہ تعليم تھي اے مسلم شوريدہ سر
لازم ہے رہرو کے ليے دنيا ميں سامان سفر
بدلي زمانے کي ہوا ، ايسا تغير آگيا
تھے جو گراں قميت کبھي، اب ہيں متاع کس مخر
وہ شعلہ روشن ترا ظلمت گريزاں جس سے تھي
گھٹ کر ہوا مثل شرر تارے سے بھي کم نور تر
شيدائي غائب نہ رہ، ديوانہء موجود ہو
غالب ہے اب اقوام پر معبود حاضر کا اثر
ممکن نہيں اس باغ ميں کوشش ہو بار آور تري
فرسودہ ہے پھندا ترا، زيرک ہے مرغ تيز پر
اس دور ميں تعليم ہے امراض ملت کي دوا
ہے خون فاسد کے ليے تعليم مثل نيشتر
رہبر کے ايما سے ہوا تعليم کا سودا مجھے
واجب ہے صحرا گرد پر تعميل فرمان خضر
ليکن نگاہ نکتہ بيں ديکھے زبوں بختي مري
رفتم کہ خار از پا کشم ،محمل نہاں شد از نظر ''
کلي سے کہہ رہي تھي ايک دن شبنم گلستاں ميں
رہي ميں ايک مدت غنچہ ہائے باغ رضواں ميں
تمھارے گلستاں کي کيفيت سرشار ہے ايسي
نگہ فردوس در دامن ہے ميري چشم حيراں ميں
سنا ہے کوئي شہزادي ہے حاکم اس گلستاں کي
کہ جس کے نقش پا سے پھول ہوں پيدا بياباں ميں
کبھي ساتھ اپنے اس کے آستاں تک مجھ کو تو لے چل
چھپا کر اپنے دامن ميں برنگ موج بو لے چل
کلي بولي، سرير آرا ہماري ہے وہ شہزادي
درخشاں جس کي ٹھوکر سے ہوں پتھر بھي نگيں بن کر
مگر فطرت تري افتندہ اور بيگم کي شان اونچي
نہيں ممکن کہ تو پہنچے ہماري ہم نشيں بن کر
پہنچ سکتي ہے تو ليکن ہماري شاہزادي تک
کسي دکھ درد کے مارے کا اشک آتشيں بن کر
نظر اس کي پيام عيد ہے اہل محرم کو
بنا ديتي ہے گوہر غم زدوں کے اشک پيہم کو
کہاں اقبال تو نے آ بنايا آشياں اپنا
نوا اس باغ ميں بلبل کو ہے سامان رسوائي
شرارے وادي ايمن کے تو بوتا تو ہے ليکن
نہيں ممکن کہ پھوٹے اس زميں سے تخم سينائي
کلي زور نفس سے بھي وہاں گل ہو نہيں سکتي
جہاں ہر شے ہو محروم تقاضائے خود افزائي
قيامت ہے کہ فطرت سو گئي اہل گلستاں کي
نہ ہے بيدار دل پيري، نہ ہمت خواہ برنائي
دل آگاہ جب خوابيدہ ہو جاتے ہيں سينوں ميں
نو اگر کے ليے زہراب ہوتي ہے شکر خائي
نہيں ضبط نوا ممکن تو اڑ جا اس گلستاں سے
کہ اس محفل سے خوشتر ہے کسي صحرا کي تنہائي
ہماں بہتر کہ ليلي در بياباں جلوہ گر باشد ''
''ندارد تنگناے شہر تاب حسن صحرائي
ہاتف نے کہا مجھ سے کہ فردوس ميں اک روز
حالي سے مخاطب ہوئے يوں سعدي شيراز
اے آنکہ ز نور گہر نظم فلک تاب
!دامن بہ چراغ مہ اختر زدہ اي باز
کچھ کيفيت مسلم ہندي تو بياں کر
واماندئہ منزل ہے کہ مصروف تگ و تاز
مذہب کي حرارت بھي ہے کچھ اس کي رگوں ميں؟
تھي جس کي فلک سوز کبھي گرمي آواز
باتوں سے ہوا شيخ کي حالي متاثر
،رو رو کے لگا کہنے کہ ''اے صاحب اعجاز
جب پير فلک نے ورق ايام کا الٹا
آئي يہ صدا ، پائوگے تعليم سے اعزاز
آيا ہے مگر اس سے عقيدوں ميں تزلزل
دنيا تو ملي، طائر ديں کر گيا پرواز
ديں ہو تو مقاصد ميں بھي پيدا ہو بلندي
فطرت ہے جوانوں کي زميں گير زميں تاز
مذہب سے ہم آہنگي افراد ہے باقي
ديں زخمہ ہے ، جمعيت ملت ہے اگر ساز
بنياد لرز جائے جو ديوار چمن کي
ظاہر ہے کہ انجام گلستاں کا ہے آغاز
پاني نہ ملا زمزم ملت سے جو اس کو
پيدا ہيں نئي پود ميں الحاد کے انداز
يہ ذکر حضور شہ يثرب ميں نہ کرنا
سمجھيں نہ کہيں ہند کے مسلم مجھے غماز
خرما نتواں يافت ازاں خار کہ کشتيم ''
''ديبا نتواں بافت ازاں پشم کہ رشتيم
تعليم پير فلسفہء مغربي ہے يہ
ناداں ہيں جن کو ہستي غائب کي ہے تلاش
پيکر اگر نظر سے نہ ہو آشنا تو کيا
ہے شيخ بھي مثال برہمن صنم تراش
محسوس پر بنا ہے علوم جديد کي
اس دور ميں ہے شيشہ عقائد کا پاش پاش
مذہب ہے جس کا نام، وہ ہے اک جنون خام
ہے جس سے آدمي کے تخيل کو انتعاش
کہتا مگر ہے فلسفہء زندگي کچھ اور
مجھ پر کيا يہ مرشد کامل نے راز فاش
با ہر کمال اند کے آشفتگي خوش است ''
''ہر چند عقل کل شدہ اي بے جنوں مباش
صف بستہ تھے عرب کے جوانان تيغ بند
تھي منتظر حنا کي عروس زمين شام
اک نوجوان صورت سيماب مضطرب
آ کر ہوا امير عساکر سے ہم کلام
اے بوعبيدہ رخصت پيکار دے مجھے
لبريز ہو گيا مرے صبر و سکوں کو جام
بے تاب ہو رہا ہوں فراق رسول ميں
اک دم کي زندگي بھي محبت ميں ہے حرام
جاتا ہوں ميں حضور رسالت پناہ ميں
لے جائوں گا خوشي سے اگر ہو کوئي پيام
يہ ذوق و شوق ديکھ کے پرنم ہوئي وہ آنکھ
جس کي نگاہ تھي صفت تيغ بے نيام
بولا امير فوج کہ ''وہ نوجواں ہے تو
پيروں پہ تيرے عشق کا واجب ہے احترام
پوري کرے خدائے محمد تري مراد
!کتنا بلند تيري محبت کا ہے مقام
پہنچے جو بارگاہ رسول اميں ميں تو
کرنا يہ عرض ميري طرف سے پس از سلام
ہم پہ کرم کيا ہے خدائے غيور نے
پورے ہوئے جو وعدے کيے تھے حضور نے
اپني ملت پر قياس اقوام مغرب سے نہ کر
خاص ہے ترکيب ميں قوم رسول ہاشمي
ان کي جمعيت کا ہے ملک و نسب پر انحصار
قوت مذہب سے مستحکم ہے جمعيت تري
دامن ديں ہاتھ سے چھوٹا تو جمعيت کہاں
اور جمعيت ہوئي رخصت تو ملت بھي گئي
ڈالي گئي جو فصل خزاں ميں شجر سے ٹوٹ
ممکن نہيں ہري ہو سحاب بہار سے
ہے لازوال عہد خزاں اس کے واسطے
کچھ واسطہ نہيں ہے اسے برگ و بار سے
ہے تيرے گلستاں ميں بھي فصل خزاں کا دور
خالي ہے جيب گل زر کامل عيار سے
جو نغمہ زن تھے خلوت اوراق ميں طيور
رخصت ہوئے ترے شجر سايہ دار سے
شاخ بريدہ سے سبق اندوز ہو کہ تو
ناآشنا ہے قاعدئہ روزگار سے
ملت کے ساتھ رابطہء استوار رکھ
!پيوستہ رہ شجر سے ، اميد بہار رکھ
اختر شام کي آتي ہے فلک سے آواز
سجدہ کرتي ہے سحر جس کو، وہ ہے آج کي رات
رہ يک گام ہے ہمت کے ليے عرش بريں
کہہ رہي ہے يہ مسلمان سے معراج کي رات
تجھے کيوں فکر ہے اے گل دل صد چاک بلبل کي
تو اپنے پيرہن کے چاک تو پہلے رفو کر لے
تمنا آبرو کي ہو اگر گلزار ہستي ميں
تو کانٹوں ميں الجھ کر زندگي کرنے کي خو کرلے
صنوبر باغ ميں آزاد بھي ہے، پا بہ گل بھي ہے
انھي پابنديوں ميں حاصل آزادي کو تو کر لے
تنک بخشي کو استغنا سے پيغام خجالت دے
نہ رہ منت کش شبنم نگوں جام وسبو کر لے
نہيں يہ شان خودداري ، چمن سے توڑ کر تجھ کو
کوئي دستار ميں رکھ لے ، کوئي زيب گلو کر لے
چمن ميں غنچہ گل سے يہ کہہ کر اڑ گئي شبنم
مذاق جور گلچيں ہو تو پيدا رنگ و بو کر لے
اگر منظور ہو تجھ کو خزاں ناآشنا رہنا
جہان رنگ و بو سے، پہلے قطع آرزو کر لے
اسي ميں ديکھ ، مضمر ہے کمال زندگي تيرا
جو تجھ کو زينت دامن کوئي آئينہ رو کر لے
شفق صبح کو دريا کا خرام آئينہ
نغمہ شام کو خاموشي شام آئينہ
برگ گل آئنہ عارض زبيائے بہار
شاہد مے کے ليے حجلہ جام آئينہ
حسن آئنہ حق اور دل آئنہ حسن
دل انساں کو ترا حسن کلام آئينہ
ہے ترے فکر فلک رس سے کمال ہستي
کيا تري فطرت روشن تھي مآل ہستي
تجھ کو جب ديدئہ ديدار طلب نے ڈھونڈا
تاب خورشيد ميں خورشيد کو پنہاں ديکھا
چشم عالم سے تو ہستي رہي مستور تري
اور عالم کو تري آنکھ نے عرياں ديکھا
حفظ اسرار کا فطرت کو ہے سودا ايسا
رازداں پھر نہ کرے گي کوئي پيدا ايسا
نہ سليقہ مجھ ميں کليم کا نہ قرينہ تجھ ميں خليل کا
ميں ہلاک جادوئے سامري، تو قتيل شيوئہ آزري
ميں نوائے سوختہ در گلو ، تو پريدہ رنگ، رميدہ بو
ميں حکايت غم آرزو ، تو حديث ماتم دلبري
مرا عيش غم ،مرا شہد سم ، مري بود ہم نفس عدم
ترا دل حرم، گرو عجم ترا ديں خريدہ کافري
دم زندگي رم زندگي، غم زندگي سم زندگي
غم رم نہ کر، سم غم نہ کھا کہ يہي ہے شان قلندري
تري خاک ميں ہے اگر شرر تو خيال فقر و غنا نہ کر
کہ جہاں ميں نان شعير پر ہے مدار قوت حيدري
!کوئي ايسي طرز طواف تو مجھے اے چراغ حرم بتا
کہ ترے پتنگ کو پھر عطا ہو وہي سرشت سمندري
گلہء جفائے وفا نما کہ حرم کو اہل حرم سے ہے
'کسي بت کدے ميں بياں کروں تو کہے صنم بھي 'ہري ہري
نہ ستيزہ گاہ جہاں نئي نہ حريف پنجہ فگن نئے
وہي فطرت اسد اللہي وہي مرحبي، وہي عنتري
کرم اے شہ عرب و عجم کہ کھڑے ہيں منتظر کرم
وہ گدا کہ تو نے عطا کيا ہے جنھيں دماغ سکندري
ہے اسيري اعتبار افزا جو ہو فطرت بلند
قطرئہ نيساں ہے زندان صدف سے ارجمند
مشک اذفر چيز کيا ہے ، اک لہو کي بوند ہے
مشک بن جاتي ہے ہو کر نافہ آہو ميں بند
ہر کسي کي تربيت کرتي نہيں قدرت، مگر
کم ہيں وہ طائر کہ ہيں دام وقفس سے بہرہ مند
شہپر زاغ و زغن در بند قيد و صيد نيست ''
''ايں سعادت قسمت شہباز و شاہيں کردہ اند
اگر ملک ہاتھوں سے جاتا ہے، جائے
تو احکام حق سے نہ کر بے وفائي
نہيں تجھ کو تاريخ سے آگہي کيا
خلافت کي کرنے لگا تو گدائي
خريديں نہ جس کو ہم اپنے لہو سے
مسلماں کو ہے ننگ وہ پادشائي
مرا از شکستن چناں عار نايد ''
''کہ از ديگراں خواستن موميائي
اے ہمايوں! زندگي تيري سراپا سوز تھي
تيري چنگاري چراغ انجمن افروز تھي
گرچہ تھا تيرا تن خاکي نزار و دردمند
تھي ستارے کي طرح روشن تري طبع بلند
کس قدر بے باک دل اس ناتواں پيکر ميں تھا
شعلہ گردوں نورد اک مشت خاکستر ميں تھا
موت کي ليکن دل دانا کو کچھ پروا نہيں
شب کي خاموشي ميں جز ہنگامہ فردا نہيں
موت کو سمجھے ہيں غافل اختتام زندگي
ہے يہ شام زندگي، صبح دوام زندگي
ساحل دريا پہ ميں اک رات تھا محو نظر
گوشہ دل ميں چھپائے اک جہان اضطراب
شب سکوت افزا، ہوا آسودہ، دريا نرم سير
تھي نظر حيراں کہ يہ دريا ہے يا تصوير آب
جيسے گہوارے ميں سو جاتا ہے طفل شير خوار
موج مضطر تھي کہيں گہرائيوں ميں مست خواب
رات کے افسوں سے طائر آشيانوں ميں اسير
انجم کم ضو گرفتار طلسم ماہتاب
ديکھتا کيا ہوں کہ وہ پيک جہاں پيما خضر
جس کي پيري ميں ہے مانند سحر رنگ شباب
!کہہ رہا ہے مجھ سے، اے جويائے اسرار ازل
چشم دل وا ہو تو ہے تقدير عالم بے حجاب
دل ميں يہ سن کر بپا ہنگامہ محشر ہوا
ميں شہيد جستجو تھا، يوں سخن گستر ہوا
اے تري چشم جہاں بيں پر وہ طوفاں آشکار
جن کے ہنگامے ابھي دريا ميں سوتے ہيں خموش
،'کشتي مسکين، و 'جان پاک' و 'ديوار يتيم
علم موسي بھي ہے تيرے سامنے حيرت فروش
چھوڑ کر آبادياں رہتا ہے تو صحرا نورد
زندگي تيري ہے بے روز و شب و فردا دوش
زندگي کا راز کيا ہے، سلطنت کيا چيز ہے
اور يہ سرمايہ و محنت ميں ہے کيسا خروش
ہو رہا ہے ايشيا کا خرقہ ديرينہ چاک
نوجواں اقوام نو دولت کے ہيں پيرايہ پوش
گرچہ اسکندر رہا محروم آب زندگي
فطرت اسکندري اب تک ہے گرم نائونوش
بيچتا ہے ہاشمي ناموس دين مصطفي
خاک و خوں ميں مل رہا ہے ترکمان سخت کوش
آگ ہے، اولاد ابراہيم ہے، نمرود ہے
!کيا کسي کو پھر کسي کا امتحاں مقصود ہے
جواب خضر
صحرا نوردي
کيوں تعجب ہے مري صحرا نوردي پر تجھے
يہ تگا پوئے دمادم زندگي کي ہے دليل
اے رہين خانہ تو نے وہ سماں ديکھا نہيں
گونجتي ہے جب فضائے دشت ميں بانگ رحيل
ريت کے ٹيلے پہ وہ آہو کا بے پروا خرام
وہ حضر بے برگ و ساماں، وہ سفر بے سنگ و ميل
وہ نمود اختر سيماب پا ہنگام صبح
يا نماياں بام گردوں سے جبين جبرئيل
وہ سکوت شام صحرا ميں غروب آفتاب
جس سے روشن تر ہوئي چشم جہاں بين خليل
اور وہ پاني کے چشمے پر مقام کارواں
اہل ايماں جس طرح جنت ميں گرد سلسبيل
تازہ ويرانے کي سودائے محبت کو تلاش
اور آبادي ميں تو زنجيري کشت و نخيل
پختہ تر ہے گردش پہيم سے جام زندگي
ہے يہي اے بے خبر راز دوام زندگي
زندگي
برتر از انديشہء سود و زياں ہے زندگي
ہے کبھي جاں اور کبھي تسليم جاں ہے زندگي
تو اسے پيمانہ امروز و فردا سے نہ ناپ
جاوداں پيہم دواں، ہر دم جواں ہے زندگي
اپني دنيا آپ پيدا کر اگر زندوں ميں ہے
سر آدم ہے، ضمير کن فکاں ہے زندگي
زندگاني کي حقيقت کوہکن کے دل سے پوچھ
جوئے شير و تيشہ و سنگ گراں ہے زندگي
بندگي ميں گھٹ کے رہ جاتي ہے اک جوئے کم آب
اور آزادي ميں بحر بے کراں ہے زندگي
آشکارا ہے يہ اپني قوت تسخير سے
گرچہ اک مٹي کے پيکر ميں نہاں ہے زندگي
قلزم ہستي سے تو ابھرا ہے مانند حباب
اس زياں خانے ميں تيرا امتحاں ہے زندگي
خام ہے جب تک تو ہے مٹي کا اک انبار تو
پختہ ہو جائے تو ہے شمشير بے زنہار تو
ہو صداقت کے ليے جس دل ميں مرنے کي تڑپ
پہلے اپنے پيکر خاکي ميں جاں پيدا کرے
پھونک ڈالے يہ زمين و آسمان مستعار
اور خاکستر سے آپ اپنا جہاں پيدا کرے
زندگي کي قوت پنہاں کو کر دے آشکار
تا يہ چنگاري فروغ جاوداں پيدا کرے
خاک مشرق پر چمک جائے مثال آفتاب
تا بدخشاں پھر وہي لعل گراں پيدا کرے
سوئے گردوں نالہ شب گير کا بھيجے سفير
رات کے تارں ميں اپنے رازداں پيدا کرے
يہ گھڑي محشر کي ہے ، تو عرصہء محشر ميں ہے
پيش کر غافل ، عمل کوئي اگر دفتر ميں ہے
سلطنت
'آبتائوں تجھ کو رمز آيہء 'ان الملوک
سلطنت اقوام غالب کي ہے اک جادوگري
خواب سے بيدار ہوتا ہے ذرا محکوم اگر
پھر سلا ديتي ہے اس کو حکمراں کي ساحري
جادوئے محمود کي تاثير سے چشم اياز
ديکھتي ہے حلقہء گردن ميں ساز دلبري
خون اسرائيل آجاتا ہے آخر جوش ميں
توڑ ديتا ہے کوئي موسي طلسم سامري
سروري زيبا فقط اس ذات بے ہمتا کو ہے
حکمراں ہے اک وہي، باقي بتان آزري
از غلامي فطرت آزاد را رسوا مکن
تا تراشي خواجہ ے از برہمن کافر تري
ہے وہي ساز کہن مغرب کا جمہوري نظام
جس کے پردوں ميں نہيں غير از نوائے قيصري
ديو استبداد جمہوري قبا ميں پاے کوب
تو سمجھتا ہے يہ آزادي کي ہے نيلم پري
مجلس آئين و اصلاح و رعايات و حقوق
طب مغرب ميں مزے ميٹھے، اثر خواب آوري
!گرمي گفتار اعضائے مجالس، الاماں
يہ بھي اک سرمايہ داروں کي ہے جنگ زرگري
اس سراب رنگ و بو کو گلستاں سمجھا ہے تو
آہ اے ناداں! قفس کو آشياں سمجھا ہے تو
سرمايہ ومحنت
بندئہ مزدور کو جا کر مرا پيغام دے
خضر کا پيغام کيا، ہے يہ پيام کائنات
اے کہ تجھ کو کھا گيا سرمايہ دار حيلہ گر
شاخ آہو پر رہي صديوں تلک تيري برات
دست دولت آفريں کو مزد يوں ملتي رہي
اہل ثروت جيسے ديتے ہيں غريبوں کو زکات
ساحر الموط نے تجھ کو ديا برگ حشيش
اور تو اے بے خبر سمجھا اسے شاخ نبات
نسل، قوميت، کليسا، سلطنت، تہذيب، رنگ
خواجگي نے خوب چن چن کے بنائے مسکرات
کٹ مرا ناداں خيالي ديوتائوں کے ليے
سکرکي لذت ميں تو لٹوا گيا نقد حيات
مکر کي چالوں سے بازي لے گيا سرمايہ دار
انتہائے سادگي سے کھا گيا مزدور مات
اٹھ کہ اب بزم جہاں کا اور ہي اندازہے
مشرق و مغرب ميں تيرے دور کا آغاز ہے
ہمت عالي تو دريا بھي نہيں کرتي قبول
غنچہ ساں غافل ترے دامن ميں شبنم کب تلک
نغمہ بيداري جمہور ہے سامان عيش
قصہ خواب آور اسکندر و جم کب تلک
آفتاب تازہ پيدا بطن گيتي سے ہوا
آسمان! ڈوبے ہوئے تاروں کا ماتم کب تلک
توڑ ڈاليں فطرت انساں نے زنجيريں تمام
دوري جنت سے روتي چشم آدم کب تلک
باغبان چارہ فرما سے يہ کہتي ہے بہار
زخم گل کے واسطے تدبير مرہم کب تلک
کرمک ناداں! طواف شمع سے آزاد ہو
اپني فطرت کے تجلي زار ميں آباد ہو
دنيائے اسلام
کيا سناتا ہے مجھے ترک و عرب کي داستاں
مجھ سے کچھ پنہاں نہيں اسلاميوں کا سوز و ساز
لے گئے تثليث کے فرزند ميراث خليل
خشت بنياد کليسا بن گئي خاک حجاز
ہوگئي رسوا زمانے ميں کلاہ لالہ رنگ
جو سراپا ناز تھے، ہيں آج مجبور نياز
لے رہا ہے مے فروشان فرنگستاں سے پارس
وہ مےء سرکش حرارت جس کي ہے مينا گداز
حکمت مغرب سے ملت کي يہ کيفيت ہوئي
ٹکڑے ٹکڑے جس طرح سونے کو کر ديتا ہے گاز
ہوگيا مانند آب ارزاں مسلماں کا لہو
مضطرب ہے تو کہ تيرا دل نہيں دانائے راز
''گفت رومي ''ہر بناے کہنہ کآباداں کنند
''مي نداني ''اول آں بنياد را ويراں کنند
''ملک ہاتھوں سے گيا ملت کي آنکھيں کھل گئيں''
حق ترا چشمے عطا کردست غافل در نگر
موميائي کي گدائي سے تو بہتر ہے شکست
مور بے پر! حاجتے پيش سليمانے مبر
ربط و ضبط ملت بيضا ہے مشرق کي نجات
ايشيا والے ہيں اس نکتے سے اب تک بے خبر
پھر سياست چھوڑ کر داخل حصار ديں ميں ہو
ملک و دولت ہے فقط حفظ حرم کا اک ثمر
ايک ہوں مسلم حرم کي پاسباني کے ليے
نيل کے ساحل سے لے کر تا بخاک کاشغر
جو کرے گا امتياز رنگ و خوں ، مٹ جائے گا
ترک خرگاہي ہو يا اعرابي والا گہر
نسل اگر مسلم کي مذہب پر مقدم ہوگئي
اڑ گيا دنيا سے تو مانند خاک رہ گزر
تا خلافت کي بنا دنيا ميں ہو پھر استور
لا کہيں سے ڈھونڈ کر اسلاف کا قلب و جگر
اے کہ نشناسي خفي را از جلي ہشيار باش
اے گرفتار ابوبکر و علي ہشيار باش
شاعر
عشق کو فرياد لازم تھي سو وہ بھي ہو چکي
اب ذرا دل تھام کر فرياد کي تاثير ديکھ
تو نے ديکھا سطوت رفتار دريا کا عروج
موج مضطر کس طرح بنتي ہے اب زنجير ديکھ
عام حريت کا جو ديکھا تھا خواب اسلام نے
اے مسلماں آج تو اس خواب کي تعبير ديکھ
اپني خاکستر سمندر کو ہے سامان وجود
مر کے پھر ہوتا ہے پيدا يہ جہان پير، ديکھ
کھول کر آنکھيں مرے آئينہء گفتار ميں
آنے والے دور کي دھندلي سي اک تصوير ديکھ
آزمودہ فتنہ ہے اک اور بھي گردوں کے پاس
سامنے تقدير کے رسوائي تدبير ديکھ
مسلم استي سينہ را از آرزو آباد دار
ہر زماں پيش نظر، 'لايخلف الميعاد' دار
دليل صبح روشن ہے ستاروں کي تنک تابي
افق سے آفتاب ابھرا ،گيا دور گراں خوابي
عروق مردئہ مشرق ميں خون زندگي دوڑا
سمجھ سکتے نہيں اس راز کو سينا و فارابي
مسلماں کو مسلماں کر ديا طوفان مغرب نے
تلاطم ہائے دريا ہي سے ہے گوہر کي سيرابي
عطا مومن کو پھر درگاہ حق سے ہونے والا ہے
شکوہ ترکماني، ذہن ہندي، نطق اعرابي
!اثر کچھ خواب کا غنچوں ميں باقي ہے تو اے بلبل
''نوا را تلخ تر مي زن چو ذوق نغمہ کم يابي''
تڑپ صحن چمن ميں، آشياں ميں ، شاخساروں ميں
جدا پارے سے ہو سکتي نہيں تقدير سيمابي
وہ چشم پاک بيں کيوں زينت برگستواں ديکھے
نظر آتي ہے جس کو مرد غازي کي جگر تابي
ضمير لالہ ميں روشن چراغ آرزو کر دے
چمن کے ذرے ذرے کو شہيد جستجو کر دے
سرشک چشم مسلم ميں ہے نيساں کا اثر پيدا
خليل اللہ کے دريا ميں ہوں گے پھر گہر پيدا
کتاب ملت بيضا کي پھر شيرازہ بندي ہے
يہ شاخ ہاشمي کرنے کو ہے پھر برگ و بر پيدا
ربود آں ترک شيرازي دل تبريز و کابل را
صبا کرتي ہے بوئے گل سے اپنا ہم سفر پيدا
اگر عثمانيوں پر کوہ غم ٹوٹا تو کيا غم ہے
کہ خون صد ہزار انجم سے ہوتي ہے سحر پيدا
جہاں باني سے ہے دشوار تر کار جہاں بيني
جگر خوں ہو تو چشم دل ميں ہوتي ہے نظر پيدا
ہزاروں سال نرگس اپني بے نوري پہ روتي ہے
بڑي مشکل سے ہوتا ہے چمن ميں ديدہ ور پيدا
نوا پيرا ہو اے بلبل کہ ہو تيرے ترنم سے
کبوتر کے تن نازک ميں شاہيں کا جگر پيدا
ترے سينے ميں ہے پوشيدہ راز زندگي کہہ دے
مسلماں سے حديث سوز و ساز زندگي کہہ دے
خدائے لم يزل کا دست قدرت تو، زباں تو ہے
يقيں پيدا کر اے غافل کہ مغلوب گماں تو ہے
پرے ہے چرخ نيلي فام سے منزل مسلماں کي
ستارے جس کي گرد راہ ہوں، وہ کارواں تو ہے
مکاں فاني ، مکيں آني، ازل تيرا، ابد تيرا
خدا کا آخري پيغام ہے تو، جاوداں تو ہے
حنا بند عروس لالہ ہے خون جگر تيرا
تري نسبت براہيمي ہے، معمار جہاں تو ہے
تري فطرت اميں ہے ممکنات زندگاني کي
جہاں کے جوہر مضمر کا گويا امتحاں تو ہے
جہان آب و گل سے عالم جاويد کي خاطر
نبوت ساتھ جس کو لے گئي وہ ارمغاں تو ہے
يہ نکتہ سرگزشت ملت بيضا سے ہے پيدا
کہ اقوام زمين ايشيا کا پاسباں تو ہے
سبق پھر پڑھ صداقت کا ، عدالت کا ، شجاعت کا
ليا جائے گا تجھ سے کام دنيا کي امامت کا
يہي مقصود فطرت ہے، يہي رمز مسلماني
اخوت کي جہاں گيري، محبت کي فراواني
بتان رنگ و خوں کو توڑ کر ملت ميں گم ہو جا
نہ توراني رہے باقي، نہ ايراني، نہ افغاني
!ميان شاخساراں صحبت مرغ چمن کب تک
ترے بازو ميں ہے پرواز شاہين قہستاني
گمان آباد ہستي ميں يقيں مرد مسلماں کا
بياباں کي شب تاريک ميں قنديل رہباني
مٹايا قيصر و کسري کے استبداد کو جس نے
وہ کيا تھا، زور حيدر، فقر بوذر، صدق سلماني
ہوئے احرار ملت جادہ پيما کس تجمل سے
تماشائي شگاف در سے ہيں صديوں کے زنداني
ثبات زندگي ايمان محکم سے ہے دنيا ميں
کہ الماني سے بھي پائندہ تر نکلا ہے توراني
جب اس انگارئہ خاکي ميں ہوتا ہے يقيں پيدا
تو کر ليتا ہے يہ بال و پر روح الاميں پيدا
غلامي ميں نہ کام آتي ہيں شمشيريں نہ تدبيريں
جو ہو ذوق يقيں پيدا تو کٹ جاتي ہيں زنجيريں
کوئي اندازہ کر سکتا ہے اس کے زور بازو کا
نگاہ مرد مومن سے بدل جاتي ہيں تقديريں
ولايت ، پادشاہي ، علم اشيا کي جہاں گيري
يہ سب کيا ہيں، فقط اک نکتہء ايماں کي تفسيريں
براہيمي نظر پيدا مگر مشکل سے ہوتي ہے
ہوس چھپ چھپ کے سينوں ميں بنا ليتي ہے تصويريں
تميز بندہ و آقا فساد آدميت ہے
حذر اے چيرہ دستاں! سخت ہيں فطرت کي تغريريں
حقيقت ايک ہے ہر شے کي، خاکي ہو کہ نوري ہو
لہو خورشيد کا ٹپکے اگر ذرے کا دل چيريں
يقيں محکم، عمل پيہم، محبت فاتح عالم
جہاد زندگاني ميں ہيں يہ مردوں کي شمشيريں
چہ بايد مرد را طبع بلندے ، مشرب نابے
دل گرمے ، نگاہ پاک بينے ، جان بيتابے
عقابي شان سے جھپٹے تھے جو ، بے بال و پر نکلے
ستارے شام کے خون شفق ميں ڈوب کر نکلے
ہوئے مدفون دريا زير دريا تيرنے والے
طمانچے موج کے کھاتے تھے ، جو ، بن کر گہر نکلے
غبار رہ گزر ہيں، کيميا پر ناز تھا جن کو
جبينيں خاک پر رکھتے تھے جو، اکسير گر نکلے
ہمارا نرم رو قاصد پيام زندگي لايا
خبر ديتي تھيں جن کو بجلياں وہ بے خبر نکلے
حرم رسوا ہوا پير حرم کي کم نگاہي سے
جوانان تتاري کس قدر صاحب نظر نکلے
زميں سے نوريان آسماں پرواز کہتے تھے
يہ خاکي زندہ تر، پائندہ تر، تابندہ تر نکلے
جہاں ميں اہل ايماں صورت خورشيد جيتے ہيں
ادھر ڈوبے ، ادھر نکلے ادھر ڈوبے ، ادھر نکلے
يقيں افراد کا سرمايہ تعمير ملت ہے
يہي قوت ہے جو صورت گر تقدير ملت ہے
تو راز کن فکاں ہے، اپني انکھوں پر عياں ہو جا
خودي کا راز داں ہو جا، خدا کا ترجماں ہو جا
ہوس نے کر ديا ہے ٹکڑے ٹکڑے نوع انساں کو
اخوت کا بياں ہو جا، محبت کي زباں ہو جا
يہ ہندي، وہ خراساني، يہ افغاني، وہ توراني
تو اے شرمندئہ ساحل! اچھل کر بے کراں ہو جا
غبار آلودئہ رنگ ونسب ہيں بال و پر تيرے
تو اے مرغ حرم! اڑنے سے پہلے پرفشاں ہو جا
خودي ميں ڈوب جا غافل! يہ سر زندگاني ہے
نکل کر حلقہ شام و سحر سے جاوداں ہو جا
مصاف زندگي ميں سيرت فولاد پيدا کر
شبستان محبت ميں حرير و پرنياں ہو جا
گزر جا بن کے سيل تند رو کوہ و بياباں سے
گلستاں راہ ميں آئے تو جوئے نغمہ خواں ہو جا
ترے علم و محبت کي نہيں ہے انتہا کوئي
نہيں ہے تجھ سے بڑھ کر ساز فطرت ميں نوا کوئي
ابھي تک آدمي صيد زبون شہرياري ہے
قيامت ہے کہ انساں نوع انساں کا شکاري ہے
نظر کو خيرہ کرتي ہے چمک تہذيب حاضر کي
يہ صناعي مگر جھوٹے نگوں کي ريزہ کاري ہے
وہ حکمت ناز تھا جس پر خرو مندان مغرب کو
ہوس کے پنچہ خونيں ميں تيغ کارزاري ہے
تدبر کي فسوں کاري سے محکم ہو نہيں سکتا
جہاں ميں جس تمدن کي بنا سرمايہ داري ہے
عمل سے زندگي بنتي ہے جنت بھي، جہنم بھي
يہ خاکي اپني فطرت ميں نہ نوري ہے نہ ناري ہے
خروش آموز بلبل ہو ، گرہ غنچے کي وا کر دے
کہ تو اس گلستاں کے واسطے باد بہاري ہے
پھر اٹھي ايشيا کے دل سے چنگاري محبت کي
زميں جولاں گہ اطلس قبايان تتاري ہے
بيا پيدا خريدارست جان ناتوانے را
''پس از مدت گذار افتاد بر ما کاروانے را''
بيا ساقي نواے مرغ زار از شاخسار آمد
بہار آمد نگار آمد نگار آمد قرار آمد
کشيد ابر بہاري خيمہ اندر وادي و صحرا
صداے آبشاراں از فراز کوہسار آمد
سرت گردم تو ہم قانون پيشيں سازدہ ساقي
کہ خيل نغمہ پردازاں قطار اندر قطار آمد
کنار از زاہداں برگيروبے باکانہ ساغر کش
پس از مدت ازيں شاخ کہن بانگ ہزار آمد
بہ مشتاقاں حديث خواجہ بدر و حنين آور
تصرف ہاے پنہانش بچشمم آشکار آمد
دگر شاخ خليل از خون ما نم ناک مي گرد
بيازار محبت نقد ما کامل عيار آمد
سر خاک شہيدے برگہاے لالہ مي پاشم
کہ خونش با نہال ملت ما سازگار آمد
بيا تا گل بيفشانيم و مے در ساغر اندازيم ''
''فلک را سقف بشگافيم و طرح ديگر اندازيم
اے باد صبا! کملي والے سے جا کہيو پيغام مرا
قبضے سے امت بيچاري کے ديں بھي گيا، دنيا بھي گئي
يہ موج پريشاں خاطر کو پيغام لب ساحل نے ديا
!ہے دور وصال بحر بھي، تو دريا ميں گھبرا بھي گئي
عزت ہے محبت کي قائم اے قيس! حجاب محمل سے
محمل جو گيا عزت بھي گئي، غيرت بھي گئي ليلا بھي گئي
کي ترک تگ و دو قطرے نے تو آبروئے گوہر بھي ملي
آوارگي فطرت بھي گئي اور کشمکش دريا بھي گئي
نکلي تو لب اقبال سے ہے، کيا جانيے کس کي ہے يہ صدا
پيغام سکوں پہنچا بھي گئي ، دل محفل کا تڑپا بھي گئي
يہ سرود قمري و بلبل فريب گوش ہے
باطن ہنگامہ آباد چمن خاموش ہے
تيرے پيمانوں کا ہے يہ اے مےء مغرب اثر
خندہ زن ساقي ہے، ساري انجمن بے ہوش ہے
دہر کے غم خانے ميں تيرا پتا ملتا نہيں
جرم تھا کيا آفرينش بھي کہ تو روپوش ہے
آہ! دنيا دل سمجھتي ہے جسے، وہ دل نہيں
پہلوئے انساں ميں اک ہنگامہء خاموش ہے
زندگي کي رہ ميں چل، ليکن ذرا بچ بچ کے چل
يہ سمجھ لے کوئي مينا خانہ بار دوش ہے
جس کے دم سے دلي و لاہور ہم پہلو ہوئے
آہ، اے اقبال وہ بلبل بھي اب خاموش ہے
نالہ ہے بلبل شوريدہ ترا خام ابھي
اپنے سينے ميں اسے اور ذرا تھام ابھي
پختہ ہوتي ہے اگر مصلحت انديش ہو عقل
عشق ہو مصلحت انديش تو ہے خام ابھي
بے خطر کود پڑا آتش نمردو ميں عشق
عقل ہے محو تماشائے لب بام ابھي
عشق فرمودئہ قاصد سے سبک گام عمل
عقل سمجھي ہي نہيں معني پيغام ابھي
شيوئہ عشق ہے آزادي و دہر آشوبي
تو ہے زناري بت خانہء ايام ابھي
عذر پرہيز پہ کہتا ہے بگڑ کر ساقي
ہے ترے دل ميں وہي کاوش انجام ابھي
سعي پيہم ہے ترازوئے کم و کيف حيات
تيري ميزاں ہے شمار سحر و شام ابھي
ابر نيساں! يہ تنک بخشي شبنم کب تک
مرے کہسار کے لالے ہيں تہي جام ابھي
بادہ گردان عجم وہ ، عربي ميري شراب
مرے ساغر سے جھجکتے ہيں مے آشام ابھي
خبر اقبال کي لائي ہے گلستاں سے نسيم
نو گرفتار پھڑکتا ہے تہ دام ابھي
پردہ چہرے سے اٹھا ، انجمن آرائي کر
چشم مہر و مہ و انجم کو تماشائي کر
تو جو بجلي ہے تو يہ چشمک پنہاں کب تک
بے حجابانہ مرے دل سے شناسائي کر
نفس گرم کي تاثير ہے اعجاز حيات
تيرے سينے ميں اگر ہے تو مسيحائي کر
کب تلک طور پہ دريوزہ گرمي مثل کليم
اپني ہستي سے عياں شعلہ سينائي کر
ہو تري خاک کے ہر ذرے سے تعمير حرم
دل کو بيگانہ انداز کليسائي کر
اس گلستاں ميں نہيں حد سے گزرنا اچھا
ناز بھي کر تو بہ اندازئہ رعنائي کر
پہلے خوددار تو مانند سکندر ہو لے
پھر جہاں ميں ہوس شوکت دارائي کر
!مل ہي جائے گي کبھي منزل ليلي اقبال
کوئي دن اور ابھي باديہ پيمائي کر
پھر باد بہار آئي ، اقبال غزل خواں ہو
غنچہ ہے اگر گل ہو ، گل ہے تو گلستاں ہو
تو خاک کي مٹھي ہے ، اجزا کي حرارت سے
برہم ہو، پريشاں ہو ، وسعت ميں بياباں ہو
تو جنس محبت ہے ، قيمت ہے گراں تيري
کم مايہ ہيں سوداگر ، اس ديس ميں ارزاں ہو
کيوں ساز کے پردے ميں مستور ہو لے تيري
تو نغمہ رنگيں ہے ، ہر گوش پہ عرياں ہو
اے رہرو فرزانہ! رستے ميں اگر تيرے
گلشن ہے تو شبنم ہو، صحرا ہے تو طوفاں ہو
ساماں کي محبت ميں مضمر ہے تن آساني
مقصد ہے اگر منزل ، غارت گر ساماں ہو
بھي اے حقيقت منتظر نظر لباس مجاز ميں
کہ ہزاروں سجدے تڑپ رہے ہيں مري جبين نياز ميں
طرب آشنائے خروش ہو، تو نوا ہے محرم گوش ہو
وہ سرود کيا کہ چھپا ہوا ہو سکوت پردئہ ساز ميں
تو بچابچا کے نہ رکھ اسے، ترا آئنہ ہے وہ آئنہ
کہ شکستہ ہو تو عزيز تر ہے نگاہ آئنہ ساز ميں
دم طوف کرمک شمع نے يہ کہا کہ وہ اثرکہن
نہ تري حکايت سوز ميں، نہ مري حديث گداز ميں
نہ کہيں جہاں ميں اماں ملي، جو اماں ملي تو کہاں ملي
مرے جرم خانہ خراب کو ترے عفو بندہ نواز ميں
نہ وہ عشق ميں رہيں گرمياں،نہ وہ حسن ميں رہيں شوخياں
نہ وہ غزنوي ميں تڑپ رہي، نہ وہ خم ہے زلف اياز ميں
جو ميں سر بسجدہ ہوا کبھي تو زميں سے آنے لگي صدا
ترا دل تو ہے صنم آشنا، تجھے کيا ملے گا نماز ميں
تہ دام بھي غزل آشنا رہے طائران چمن تو کيا
جو فغاں دلوں ميں تڑپ رہي تھي، نوائے زير لبي رہي
ترا جلوہ کچھ بھي تسلي دل ناصبور نہ کر سکا
وہ گريہ سحري رہا ، وہي آہ نيم شبي رہي
نہ خدا رہا نہ صنم رہے ، نہ رقيب دير حرم رہے
نہ رہي کہيں اسد اللہي، نہ کہيں ابولہبي رہي
مرا ساز اگرچہ ستم رسيدئہ زخمہ ہائے عجم رہا
وہ شہيد ذوق وفا ہوں ميں کہ نوا مري عربي رہي
گرچہ تو زنداني اسباب ہے
قلب کو ليکن ذرا آزاد رکھ
عقل کو تنقيد سے فرصت نہيں
عشق پر اعمال کي بنياد رکھ
اے مسلماں! ہر گھڑي پيش نظر
آيہ 'لا يخلف الميعاد' رکھ
يہ 'لسان العصر' کا پيغام ہے
''ان وعد اللہ حق'' ياد رکھ''
مشرق ميں اصول دين بن جاتے ہيں
مغرب ميں مگر مشين بن جاتے ہيں
رہتا نہيں ايک بھي ہمارے پلے
واں ايک کے تين تين بن جاتے ہيں
لڑکياں پڑھ رہي ہيں انگريزي
ڈھونڈلي قوم نے فلاح کي راہ
روش مغربي ہے مدنظر
وضع مشرق کو جانتے ہيں گناہ
يہ ڈراما دکھائے گا کيا سين
پردہ اٹھنے کي منتظر ہے نگاہ
شيخ صاحب بھي تو پردے کے کوئي حامي نہيں
مفت ميں کالج کے لڑکے ان سے بدظن ہو گئے
وعظ ميں فرما ديا کل آپ نے يہ صاف صاف
''پروہ آخر کس سے ہو جب مرد ہي زن ہو گئے''
!يہ کوئي دن کي بات ہے اے مرد ہوش مند
غيرت نہ تجھ ميں ہو گي، نہ زن اوٹ چاہے گي
آتا ہے اب وہ دور کہ اولاد کے عوض
کونسل کي ممبري کے ليے ووٹ چاہے گي
تعليم مغربي ہے بہت جرات آفريں
پہلا سبق ہے، بيٹھ کے کالج ميں مار ڈينگ
بستے ہيں ہند ميں جو خريدار ہي فقط
آغا بھي لے کے آتے ہيں اپنے وطن سے ہينگ
ميرا يہ حال، لوٹ کي ٹو چاٹتا ہوں ميں
ان کا يہ حکم، ديکھ! مرے فرش پر نہ رينگ
کہنے لگے کہ اونٹ ہے بھدا سا جانور
اچھي ہے گائے، رکھتي ہے کيا نوک دار سينگ
کچھ غم نہيں جو حضرت واعظ ہيں تنگ دست
تہذيب نو کے سامنے سر اپنا خم کريں
رد جہاد ميں تو بہت کچھ لکھا گيا
ترديد حج ميں کوئي رسالہ رقم کريں
!تہذيب کے مريض کو گولي سے فائدہ
دفع مرض کے واسطے پل پيش کيجيے
تھے وہ بھي دن کہ خدمت استاد کے عوض
دل چاہتا تھا ہديہء دل پيش کيجيے
بدلا زمانہ ايسا کہ لڑکا پس از سبق
!''کہتا ہے ماسٹر سے کہ ''بل پيش کيجيے
انتہا بھي اس کي ہے؟ آخر خريديں کب تلک
چھترياں، رومال، مفلر، پيرہن جاپان سے
اپني غفلت کي يہي حالت اگر قائم رہي
آئيں گے غسال کابل سے ،کفن جاپان سے
ہم مشرق کے مسکينوں کا دل مغرب ميں جا اٹکا ہے
واں کنڑ سب بلوري ہيں ياں ايک پرانا مٹکا ہے
اس دور ميں سب مٹ جائيں گے، ہاں! باقي وہ رہ جائے گا
جو قائم اپني راہ پہ ہے اور پکا اپني ہٹ کا ہے
اے شيخ و برہمن، سنتے ہو! کيا اہل بصيرت کہتے ہيں
گردوں نے کتني بلندي سے ان قوموں کو دے پٹکا ہے
يا باہم پيار کے جلسے تھے ، دستور محبت قائم تھا
يا بحث ميں اردو ہندي ہے يا قرباني يا جھٹکا ہے
''اصل شہود و شاہد و مشہود ايک ہے''
غالب کا قول سچ ہے تو پھر ذکر غير کيا
کيوں اے جناب شيخ! سنا آپ نے بھي کچھ
کہتے تھے کعبے والوں سے کل اہل دير کيا
ہم پوچھتے ہيں مسلم عاشق مزاج سے
!الفت بتوں سے ہے تو برہمن سے بير کيا
ہاتھوں سے اپنے دامن دنيا نکل گيا
رخصت ہوا دلوں سے خيال معاد بھي
قانوں وقف کے ليے لڑتے تھے شيخ جي
!پوچھو تو، وقف کے ليے ہے جائداد بھي
وہ مس بولي ارادہ خودکشي کا جب کيا ميں نے
مہذب ہے تو اے عاشق! قدم باہر نہ دھر حد سے
نہ جرات ہے ، نہ خنجر ہے تو قصد خودکشي کيسا
يہ مانا درد ناکامي گيا تيرا گزر حد سے
کہا ميں نے کہ اے جاں جہاں کچھ نقد دلوا دو
کرائے پر منگالوں گا کوئي افغان سرحد سے
ناداں تھے اس قدر کہ نہ جاني عرب کي قدر
حاصل ہوا يہي، نہ بچے مار پيٹ سے
مغرب ميں ہے جہاز بياباں شتر کا نام
ترکوں نے کام کچھ نہ ليا اس فليٹ سے
ہندوستاں ميں جزو حکومت ہيں کونسليں
آغاز ہے ہمارے سياسي کمال کا
ہم تو فقير تھے ہي، ہمارا تو کام تھا
سيکھيں سليقہ اب امرا بھي 'سوال' کا
ممبري امپيريل کونسل کي کچھ مشکل نہيں
ووٹ تو مل جائيں گے ، پيسے بھي دلوائيں گے کيا؟
ميرزا غالب خدا بخشے ، بجا فرما گئے
''ہم نے يہ ماناکہ دلي ميں رہيں، کھائيں گے کيا؟''
دليل مہر و وفا اس سے بڑھ کے کيا ہوگي
نہ ہو حضور سے الفت تو يہ ستم نہ سہيں
مصر ہے حلقہ ،کميٹي ميں کچھ کہيں ہم بھي
مگر رضائے کلکٹر کو بھانپ ليں تو کہيں
سند تو ليجيے ، لڑکوں کے کام آئے گي
وہ مہربان ہيں اب، پھر رہيں، رہيں نہ رہيں
زمين پر تو نہيں ہنديوں کو جا ملتي
مگر جہاں ميں ہيں خالي سمندروں کي تہيں
مثال کشتي بے حس مطيع فرماں ہيں
کہو تو بستہ ساحل رہيں ، کہو تو بہيں
فرما رہے تھے شيخ طريق عمل پہ وعظ
کفار ہند کے ہيں تجارت ميں سخت کوش
مشرک ہيں وہ جو رکھتے ہيں مشرک سے لين دين
ليکن ہماري قوم ہے محروم عقل و ہوش
ناپاک چيز ہوتي ہے کافر کے ہاتھ کي
سن لے، اگر ہے گوش مسلماں کا حق نيوش
اک بادہ کش بھي وعظ کي محفل ميں تھا شريک
جس کے ليے نصيحت واعظ تھي بار گوش
کہنے لگا ستم ہے کہ ايسے قيود کي
پابند ہو تجارت سامان خورد و نوش
ميں نے کہا کہ آپ کو مشکل نہيں کوئي
ہندوستاں ميں ہيں کلمہ گو بھي مے فروش
ديکھے چلتي ہے مشرق کي تجارت کب تک
شيشہ ديں کے عوض جام و سبو ليتا ہے
ہے مداوائے جنون نشتر تعليم جديد
ميرا سرجن رگ ملت سے لہو ليتا ہے
گائے اک روز ہوئي اونٹ سے يوں گرم سخن
نہيں اک حال پہ دنيا ميں کسي شے کو قرار
ميں تو بد نام ہوئي توڑ کے رسي اپني
سنتي ہوں آپ نے بھي توڑکے رکھ دي ہے مہار
ہند ميں آپ تو از روئے سياست ہيں اہم
ريل چلنے سے مگر دشت عرب ميں بيکار
کل تلک آپ کو تھا گائے کي محفل سے حذر
تھي لٹکتے ہوئے ہونٹوں پہ صدائے زنہار
آج يہ کيا ہے کہ ہم پر ہے عنايت اتني
نہ رہا آئنہء دل ميں وہ ديرينہ غبار
جب يہ تقرير سني اونٹ نے، شرما کے کہا
ہے ترے چاہنے والوں ميں ہمارا بھي شمار
رشک صد غمزئہ اشتر ہے تري ايک کليل
ہم تو ہيں ايسي کليلوں کے پرانے بيمار
ترے ہنگاموں کي تاثير يہ پھيلي بن ميں
بے زبانوں ميں بھي پيدا ہے مذاق گفتار
ايک ہي بن ميں ہے مدت سے بسيرا اپنا
گرچہ کچھ پاس نہيں، چارا بھي کھاتے ہيں ادھار
گوسفند و شتر و گاو و پلنگ و خر لنگ
ايک ہي رنگ ميں رنگيں ہوں تو ہے اپنا وقار
باغباں ہو سبق آموز جو يکرنگي کا
ہمزباں ہو کے رہيں کيوں نہ طيور گلزار
دے وہي جام ہميں بھي کہ مناسب ہے يہي
تو بھي سرشار ہو، تيرے رفقا بھي سرشار
دلق حافظ بچہ ارزد بہ ميش رنگيں کن ''
''وانگہش مست و خراب از رہ بازار بيار
رات مچھر نے کہہ ديا مجھ سے
ماجرا اپني ناتمامي کا
مجھ کو ديتے ہيں ايک بوند لہو
صلہ شب بھر کي تشنہ کامي کا
اور يہ بسوہ دار، بے زحمت
پي گيا سب لہو اسامي کا
يہ آيہ نو ، جيل سے نازل ہوئي مجھ پر
گيتا ميں ہے قرآن تو قرآن ميں گيتا
کيا خوب ہوئي آشتي شيخ و برہمن
اس جنگ ميں آخر نہ يہ ہارا نہ وہ جيتا
'مندر سے تو بيزار تھا پہلے ہي سے 'بدري
مسجد سے نکلتا نہيں، ضدي ہے مسيتا
جان جائے ہاتھ سے جائے نہ ست
ہے يہي اک بات ہر مذہب کا تت
چٹے بٹے ايک ہي تھيلي کے ہيں
ساہو کاري، بسوہ داري، سلطنت
محنت و سرمايہ دنيا ميں صف آرا ہو گئے
ديکھے ہوتا ہے کس کس کي تمنائوں کا خون
حکمت و تدبير سے يہ فتنہ آشوب خيز
،ٹل نہيں سکتا ، وقد کنتم بہ تستعجلون
کھل گئے، ياجوج اور ماجوج کے لشکر تمام
'چشم مسلم ديکھ لے تفسير حرف 'ينسلون
شام کي سرحد سے رخصت ہے وہ رند لم يزل
رکھ کے ميخانے کے سارے قاعدے بالائے طاق
يہ اگر سچ ہے تو ہے کس درجہ عبرت کا مقام
رنگ اک پل ميں بدل جاتا ہے يہ نيلي رواق
حضرت کرزن کو اب فکر مداوا ہے ضرور
حکم برداري کے معدے ميں ہے درد لايطاق
وفد ہندستاں سے کرتے ہيں سرآغا خاں طلب
کيا يہ چورن ہے پےء ہضم فلسطين و عراق؟
تکرار تھي مزارع و مالک ميں ايک روز
دونوں يہ کہہ رہے تھے، مرا مال ہے زميں
کہتا تھا وہ، کرے جو زراعت اسي کا کھيت
کہتا تھا يہ کہ عقل ٹھکانے تري نہيں
پوچھا زميں سے ميں نے کہ ہے کس کا مال تو
بولي مجھے تو ہے فقط اس بات کا يقيں
مالک ہے يا مزارع شوريدہ حال ہے
جو زير آسماں ہے ، وہ دھرتي کا مال ہے
اٹھا کر پھينک دو باہر گلي ميں
نئي تہذيب کے انڈے ہيں گندے
الکشن، ممبري، کونسل، صدارت
بنائے خوب آزادي نے پھندے
مياں نجار بھي چھيلے گئے ساتھ
نہايت تيز ہيں يورپ کے رندے
کارخانے کا ہے مالک مردک ناکردہ کار
عيش کا پتلا ہے، محنت ہے اسے ناسازگار
حکم حق ہے ليس للا نسان الا ماسعي
کھائے کيوں مزدور کي محنت کا پھل سرمايہ دار
سنا ہے ميں نے، کل يہ گفتگو تھي کارخانے ميں
پرانے جھونپڑوں ميں ہے ٹھکانا دست کاروں کا
مگر سرکار نے کيا خوب کونسل ہال بنوايا
کوئي اس شہر ميں تکيہ نہ تھا سرمايہ داروں کا
مسجد تو بنا دي شب بھر ميں ايماں کي حرارت والوں نے
من اپنا پرانا پاپي ہے، برسوں ميں نمازي بن نہ سکا
کيا خوب امير فيصل کو سنوسي نے پيغام ديا
تو نام و نسب کا حجازي ہے پر دل کا حجازي بن نہ سکا
تر آنکھيں تو ہو جاتي ہيں، پر کيا لذت اس رونے ميں
جب خون جگر کي آميزش سے اشک پيازي بن نہ سکا
اقبال بڑا اپديشک ہے من باتوں ميں موہ ليتا ہے
گفتارکا يہ غازي تو بنا ،کردار کا غازي بن نہ سکا
ميري نوائے شوق سے شور حريم ذات ميں
غلغلہ ہائے الاماں بت کدئہ صفات ميں
حور و فرشتہ ہيں اسير ميرے تخيلات ميں
ميري نگاہ سے خلل تيري تجليات ميں
گرچہ ہے ميري جستجو دير و حرم کي نقش بند
ميري فغاں سے رستخيز کعبہ و سومنات ميں
گاہ مري نگاہ تيز چير گئي دل وجود
گاہ الجھ کے رہ گئي ميرے توہمات ميں
تو نے يہ کيا غضب کيا، مجھ کو بھي فاش کر ديا
!ميں ہي تو اک راز تھا سينہء کائنات ميں
اگر کج رو ہيں انجم ، آسماں تيرا ہے يا ميرا
مجھے فکر جہاں کيوں ہو ، جہاں تيرا ہے يا ميرا؟
اگر ہنگامہ ہائے شوق سے ہے لامکاں خالي
خطا کس کي ہے يا رب! لامکاں تيرا ہے يا ميرا؟
اسے صبح ازل انکار کي جرات ہوئي کيونکر
مجھے معلوم کيا ، وہ راز داں تيرا ہے يا ميرا؟
محمد بھي ترا ، جبريل بھي ، قرآن بھي تيرا
مگر يہ حرف شيريں ترجماں تيرا ہے يا ميرا؟
اسي کوکب کي تاباني سے ہے تيرا جہاں روشن
زوال آدم خاکي زياں تيرا ہے يا ميرا؟
ترے شيشے ميں مے باقي نہيں ہے
بتا ، کيا تو مرا ساقي نہيں ہے
سمندر سے ملے پياسے کو شبنم
بخيلي ہے يہ رزاقي نہيں ہے
گيسوئے تاب دار کو اور بھي تاب دار کر
ہوش و خرد شکار کر ، قلب و نظر شکار کر
عشق بھي ہو حجاب ميں ، حسن بھي ہو حجاب ميں
يا تو خود آشکار ہو يا مجھے آشکار کر
تو ہے محيط بے کراں ، ميں ہوں ذرا سي آبجو
يا مجھے ہمکنار کر يا مجھے بے کنار کر
ميں ہوں صدف تو تيرے ہاتھ ميرے گہر کي آبرو
ميں ہوں خزف تو تو مجھے گوہر شاہوار کر
نغمہء نو بہار اگر ميرے نصيب ميں نہ ہو
اس دم نيم سوز کو طائرک بہار کر
باغ بہشت سے مجھے حکم سفر ديا تھا کيوں
کار جہاں دراز ہے ، اب مرا انتظار کر
روز حساب جب مرا پيش ہو دفتر عمل
آپ بھي شرمسار ہو ، مجھ کو بھي شرمسار کر
اثر کرے نہ کرے ، سن تو لے مري فرياد
نہيں ہے داد کا طالب يہ بندہء آزاد
يہ مشت خاک ، يہ صرصر ، يہ وسعت افلاک
!کرم ہے يا کہ ستم تيري لذت ايجاد
ٹھہر سکا نہ ہوائے چمن ميں خيمہء گل
يہي ہے فصل بہاري ، يہي ہے باد مراد؟
قصور وار ، غريب الديار ہوں ليکن
ترا خرابہ فرشتے نہ کر سکے آباد
مري جفا طلبي کو دعائيں ديتا ہے
وہ دشت سادہ ، وہ تيرا جہان بے بنياد
خطر پسند طبيعت کو ساز گار نہيں
وہ گلستاں کہ جہاں گھات ميں نہ ہو صياد
مقام شوق ترے قدسيوں کے بس کا نہيں
انھي کا کام ہے يہ جن کے حوصلے ہيں زياد
کيا عشق ايک زندگي مستعار کا
کيا عشق پائدار سے ناپائدار کا
وہ عشق جس کي شمع بجھا دے اجل کي پھونک
اس ميں مزا نہيں تپش و انتظار کا
ميري بساط کيا ہے ، تب و تاب يک نفس
شعلے سے بے محل ہے الجھنا شرار کا
کر پہلے مجھ کو زندگي جاوداں عطا
پھر ذوق و شوق ديکھ دل بے قرار کا
کانٹا وہ دے کہ جس کي کھٹک لازوال ہو
!يارب ، وہ درد جس کي کسک لازوال ہو
دلوں کو مرکز مہر و وفا کر
حريم کبريا سے آشنا کر
جسے نان جويں بخشي ہے تو نے
اسے بازوئے حيدر بھي عطا کر
پريشاں ہوکے ميري خاک آخر دل نہ بن جائے
جو مشکل اب ہے يارب پھر وہي مشکل نہ بن جائے
نہ کر ديں مجھ کو مجبور نوا فردوس ميں حوريں
مرا سوز دروں پھر گرمي محفل نہ بن جائے
کبھي چھوڑي ہوئي منزل بھي ياد آتي ہے راہي کو
کھٹک سي ہے ، جو سينے ميں ، غم منزل نہ بن جائے
بنايا عشق نے دريائے ناپيدا کراں مجھ کو
يہ ميري خود نگہداري مرا ساحل نہ بن جائے
کہيں اس عالم بے رنگ و بو ميں بھي طلب ميري
وہي افسانہ دنبالہ محمل نہ بن جائے
عروج آدم خاکي سے انجم سہمے جاتے ہيں
کہ يہ ٹوٹا ہوا تارا مہ کامل نہ بن جائے
دگرگوں ہے جہاں ، تاروں کي گردش تيز ہے ساقي
دل ہر ذرہ ميں غوغائے رستا خيز ہے ساقي
متاع دين و دانش لٹ گئي اللہ والوں کي
يہ کس کافر ادا کا غمزئہ خوں ريز ہے ساقي
وہي ديرينہ بيماري ، وہي نا محکمي دل کي
علاج اس کا وہي آب نشاط انگيز ہے ساقي
حرم کے دل ميں سوز آرزو پيدا نہيں ہوتا
کہ پيدائي تري اب تک حجاب آميز ہے ساقي
نہ اٹھا پھر کوئي رومي عجم کے لالہ زاروں سے
وہي آب و گل ايراں ، وہي تبريز ہے ساقي
نہيں ہے نااميد اقبال اپني کشت ويراں سے
ذرا نم ہو تو يہ مٹي بہت زرخيز ہے ساقي
فقير راہ کو بخشے گئے اسرار سلطاني
بہا ميري نوا کي دولت پرويز ہے ساقي
لا پھر اک بار وہي بادہ و جام اے ساقي
!ہاتھ آ جائے مجھے ميرا مقام اے ساقي
تين سو سال سے ہيں ہند کے ميخانے بند
اب مناسب ہے ترا فيض ہو عام اے ساقي
مري مينائے غزل ميں تھي ذرا سي باقي
شيخ کہتا ہے کہ ہے يہ بھي حرام اے ساقي
شير مردوں سے ہوا بيشہء تحقيق تہي
رہ گئے صوفي و ملا کے غلام اے ساقي
عشق کي تيغ جگردار اڑا لي کس نے
علم کے ہاتھ ميں خالي ہے نيام اے ساقي
سينہ روشن ہو تو ہے سوز سخن عين حيات
ہو نہ روشن ، تو سخن مرگ دوام اے ساقي
تو مري رات کو مہتاب سے محروم نہ رکھ
!ترے پيمانے ميں ہے ماہ تمام اے ساقي
مٹا ديا مرے ساقي نے عالم من و تو
پلا کے مجھ کو مے لا الہ الا ھو
نہ مے ،نہ شعر ، نہ ساقي ، نہ شور چنگ و رباب
!سکوت کوہ و لب جوے و لالہ خود رو
گدائے مے کدہ کي شان بے نيازي ديکھ
!پہنچ کے چشمہ حيواں پہ توڑتا ہے سبو
مرا سبوچہ غنيمت ہے اس زمانے ميں
کہ خانقاہ ميں خالي ہيں صوفيوں کے کدو
ميں نو نياز ہوں ، مجھ سے حجاب ہي اولي
کہ دل سے بڑھ کے ہے ميري نگاہ بے قابو
اگرچہ بحر کي موجوں ميں ہے مقام اس کا
صفائے پاکي طينت سے ہے گہر کا وضو
جميل تر ہيں گل و لالہ فيض سے اس کے
نگاہ شاعر رنگيں نوا ميں ہے جادو
متاع بے بہا ہے درد و سوز آرزو مندي
مقام بندگي دے کر نہ لوں شان خداوندي
ترے آزاد بندوں کي نہ يہ دنيا ، نہ وہ دنيا
يہاں مرنے کي پابندي ، وہاں جينے کي پابندي
حجاب اکسير ہے آوارہ کوئے محبت کو
ميري آتش کو بھڑکاتي ہے تيري دير پيوندي
گزر اوقات کر ليتا ہے يہ کوہ و بياباں ميں
کہ شاہيں کے ليے ذلت ہے کار آشياں بندي
يہ فيضان نظر تھا يا کہ مکتب کي کرامت تھي
سکھائے کس نے اسمعيل کو آداب فرزندي
زيارت گاہ اہل عزم و ہمت ہے لحد ميري
کہ خاک راہ کو ميں نے بتايا راز الوندي
مري مشاطگي کي کيا ضرورت حسن معني کو
کہ فطرت خود بخود کرتي ہے لالے کي حنا بندي
تجھے ياد کيا نہيں ہے مرے دل کا وہ زمانہ
وہ ادب گہ محبت ، وہ نگہ کا تازيانہ
يہ بتان عصر حاضر کہ بنے ہيں مدرسے ميں
نہ ادائے کافرانہ ، نہ تراش آزرانہ
نہيں اس کھلي فضا ميں کوئي گوشہء فراغت
يہ جہاں عجب جہاں ہے ، نہ قفس نہ آشيانہ
رگ تاک منتظر ہے تري بارش کرم کي
کہ عجم کے مے کدوں ميں نہ رہي مے مغانہ
مرے ہم صفير اسے بھي اثر بہار سمجھے
انھيں کيا خبر کہ کيا ہے يہ نوائے عاشقانہ
مرے خاک و خوں سے تونے يہ جہاں کيا ہے پيدا
صلہ شہيد کيا ہے ، تب و تاب جاودانہ
تري بندہ پروري سے مرے دن گزر رہے ہيں
نہ گلہ ہے دوستوں کا ، نہ شکايت زمانہ
ضمير لالہ مے لعل سے ہوا لبريز
اشارہ پاتے ہي صوفي نے توڑ دي پرہيز
بچھائي ہے جو کہيں عشق نے بساط اپني
کيا ہے اس نے فقيروں کو وارث پرويز
پرانے ہيں يہ ستارے ، فلک بھي فرسودہ
جہاں وہ چاہيے مجھ کو کہ ہو ابھي نوخيز
کسے خبر ہے کہ ہنگامہ نشور ہے کيا
تري نگاہ کي گردش ہے ميري رستاخيز
نہ چھين لذت آہ سحر گہي مجھ سے
نہ کر نگہ سے تغافل کو التفات آميز
دل غميں کے موافق نہيں ہے موسم گل
صدائے مرغ چمن ہے بہت نشاط انگيز
حديث بے خبراں ہے ، تو با زمانہ بساز
زمانہ با تو نسازد ، تو با زمانہ ستيز
وہي ميري کم نصيبي ، وہي تيري بے نيازي
ميرے کام کچھ نہ آيا يہ کمال نے نوازي
ميں کہاں ہوں تو کہاں ہے ، يہ مکاں کہ لامکاں ہے؟
يہ جہاں مرا جہاں ہے کہ تري کرشمہ سازي
اسي کشمکش ميں گزريں مري زندگي کي راتيں
کبھي سوزو ساز رومي ، کبھي پيچ و تاب رازي
وہ فريب خوردہ شاہيں کہ پلا ہو کرگسوں ميں
اسے کيا خبر کہ کيا ہے رہ و رسم شاہبازي
نہ زباں کوئي غزل کي ، نہ زباں سے باخبر ميں
کوئي دلکشا صدا ہو ، عجمي ہو يا کہ تازي
نہيں فقر و سلطنت ميں کوئي امتياز ايسا
يہ سپہ کي تيغ بازي ، وہ نگہ کي تيغ بازي
کوئي کارواں سے ٹوٹا ، کوئي بدگماں حرم سے
کہ امير کارواں ميں نہيں خوئے دل نوازي
اپني جولاں گاہ زير آسماں سمجھا تھا ميں
آب و گل کے کھيل کو اپنا جہاں سمجھا تھا ميں
بے حجابي سے تري ٹوٹا نگاہوں کا طلسم
اک ردائے نيلگوں کو آسماں سمجھا تھا ميں
کارواں تھک کر فضا کے پيچ و خم ميں رہ گيا
مہروماہ و مشتري کو ہم عناں سمجھا تھا ميں
عشق کي اک جست نے طے کر ديا قصہ تمام
اس زمين و آسماں کو بے کراں سمجھا تھا ميں
کہہ گئيں راز محبت پردہ دار يہاے شوق
تھي فغاں وہ بھي جسے ضبط فغاں سمجھا تھا ميں
تھي کسي درماندہ رہرو کي صداے درد ناک
جس کو آواز رحيل کارواں سمجھا تھا ميں
اک دانش نوراني ، اک دانش برہاني
ہے دانش برہاني ، حيرت کي فراواني
اس پيکر خاکي ميں اک شے ہے ، سو وہ تيري
ميرے ليے مشکل ہے اس شے کي نگہباني
اب کيا جو فغاں ميري پہنچي ہے ستاروں تک
تو نے ہي سکھائي تھي مجھ کو يہ غزل خواني
ہو نقش اگر باطل ، تکرار سے کيا حاصل
کيا تجھ کو خوش آتي ہے آدم کي يہ ارزاني؟
مجھ کو تو سکھا دي ہے افرنگ نے زنديقي
!اس دور کے ملا ہيں کيوں ننگ مسلماني
تقدير شکن قوت باقي ہے ابھي اس ميں
ناداں جسے کہتے ہيں تقدير کا زنداني
تيرے بھي صنم خانے ، ميرے بھي صنم خانے
دونوں کے صنم خاکي ، دونوں کے صنم فاني
يارب! يہ جہان گزراں خوب ہے ليکن
کيوں خوار ہيں مردان صفا کيش و ہنرمند
گو اس کي خدائي ميں مہاجن کا بھي ہے ہاتھ
دنيا تو سمجھتي ہے فرنگي کو خداوند
تو برگ گيا ہے ندہي اہل خرد را
او کشت گل و لالہ بنجشد بہ خرے چند
حاضر ہيں کليسا ميں کباب و مے گلگوں
مسجد ميں دھرا کيا ہے بجز موعظہ و پند
احکام ترے حق ہيں مگر اپنے مفسر
تاويل سے قرآں کو بنا سکتے ہيں پاژند
فردوس جو تيرا ہے ، کسي نے نہيں ديکھا
افرنگ کا ہر قريہ ہے فردوس کي مانند
مدت سے ہے آوارہ افلاک مرا فکر
کر دے اسے اب چاند کي غاروں ميں نظر بند
فطرت نے مجھے بخشے ہيں جوہر ملکوتي
خاکي ہوں مگر خاک سے رکھتا نہيں پيوند
درويش خدا مست نہ شرقي ہے نہ غربي
گھر ميرا نہ دلي ، نہ صفاہاں ، نہ سمرقند
کہتا ہوں وہي بات سمجھتا ہوں جسے حق
نے ابلہ مسجد ہوں ، نہ تہذيب کا فرزند
اپنے بھي خفا مجھ سے ہيں ، بيگانے بھي ناخوش
ميں زہر ہلاہل کو کبھي کہہ نہ سکا قند
مشکل ہے کہ اک بندہ حق بين و حق انديش
خاشاک کے تودے کو کہے کوہ دماوند
ہوں آتش نمرود کے شعلوں ميں بھي خاموش
ميں بندہ مومن ہوں ، نہيں دانہ اسپند
پر سوز و نظرباز و نکوبين و کم آزار
آزاد و گرفتار و تہي کيسہ و خورسند
ہر حال ميں ميرا دل بے قيد ہے خرم
!کيا چھينے گا غنچے سے کوئي ذوق شکر خند
چپ رہ نہ سکا حضرت يزداں ميں بھي اقبال
!کرتا کوئي اس بندہ گستاخ کا منہ بند
سما سکتا نہيں پہنائے فطرت ميں مرا سودا
غلط تھا اے جنوں شايد ترا اندازہ صحرا
خودي سے اس طلسم رنگ و بو کو توڑ سکتے ہيں
يہي توحيد تھي جس کو نہ تو سمجھا نہ ميں سمجھا
نگہ پيدا کر اے غافل تجلي عين فطرت ہے
کہ اپني موج سے بيگانہ رہ سکتا نہيں دريا
رقابت علم و عرفاں ميں غلط بيني ہے منبر کي
کہ وہ حلاج کي سولي کو سمجھا ہے رقيب اپنا
خدا کے پاک بندوں کو حکومت ميں ، غلامي ميں
زرہ کوئي اگر محفوظ رکھتي ہے تو استغنا
نہ کر تقليد اے جبريل ميرے جذب و مستي کي
!تن آساں عرشيوں کو ذکر و تسبيح و طواف اولي
بہت ديکھے ہيں ميں نے مشرق و مغرب کے ميخانے
يہاں ساقي نہيں پيدا ، وہاں بے ذوق ہے صہبا
نہ ايراں ميں رہے باقي ، نہ توراں ميں رہے باقي
وہ بندے فقر تھا جن کا ہلاک قيصر و کسري
يہي شيخ حرم ہے جو چرا کر بيچ کھاتا ہے
!گليم بوذر و دلق اويس و چادر زہرا
حضور حق ميں اسرافيل نے ميري شکايت کي
يہ بندہ وقت سے پہلے قيامت کر نہ دے برپا
ندا آئي کہ آشوب قيامت سے يہ کيا کم ہے
'!گرفتہ چينياں احرام و مکي خفتہ در بطحا '
لبالب شيشہ تہذيب حاضر ہے مے 'لا' سے
'مگر ساقي کے ہاتھوں ميں نہيں پيمانہ 'الا
دبا رکھا ہے اس کو زخمہ ور کي تيز دستي نے
بہت نيچے سروں ميں ہے ابھي يورپ کا واويلا
اسي دريا سے اٹھتي ہے وہ موج تند جولاں بھي
نہنگوں کے نشيمن جس سے ہوتے ہيں تہ و بالا
غلامي کيا ہے ؟ ذوق حسن و زيبائي سے محرومي
جسے زيبا کہيں آزاد بندے ، ہے وہي زيبا
بھروسا کر نہيں سکتے غلاموں کي بصيرت پر
کہ دنيا ميں فقط مردان حر کي آنکھ ہے بينا
وہي ہے صاحب امروز جس نے اپني ہمت سے
زمانے کے سمندر سے نکالا گوہر فردا
فرنگي شيشہ گر کے فن سے پتھر ہوگئے پاني
مري اکسير نے شيشے کو بخشي سختي خارا
رہے ہيں ، اور ہيں فرعون ميري گھات ميں اب تک
مگر کيا غم کہ ميري آستيں ميں ہے يد بيضا
وہ چنگاري خس و خاشاک سے کس طرح دب جائے
جسے حق نے کيا ہو نيستاں کے واسطے پيدا
محبت خويشتن بيني ، محبت خويشتن داري
محبت آستان قيصر و کسري سے بے پروا
عجب کيا رمہ و پرويں مرے نخچير ہو جائيں
'کہ برفتراک صاحب دولتے بستم سر خود را '
وہ دانائے سبل ، ختم الرسل ، مولائے کل جس نے
غبار راہ کو بخشا فروغ وادي سينا
نگاہ عشق و مستي ميں وہي اول ، وہي آخر
وہي قرآں ، وہي فرقاں ، وہي يسيں ، وہي طہ
سنائي کے ادب سے ميں نے غواصي نہ کي ورنہ
ابھي اس بحر ميں باقي ہيں لاکھوں لولوئے لالا
يہ کون غزل خواں ہے پرسوز و نشاط انگيز
انديشہ دانا کو کرتا ہے جنوں آميز
گو فقر بھي رکھتا ہے انداز ملوکانہ
نا پختہ ہے پرويزي بے سلطنت پرويز
اب حجرہ صوفي ميں وہ فقر نہيں باقي
خون دل شيراں ہو جس فقر کي دستاويز
اے حلقہ درويشاں! وہ مرد خدا کيسا
ہو جس کے گريباں ميں ہنگامہ رستا خيز
جو ذکر کي گرمي سے شعلے کي طرح روشن
!جو فکر کي سرعت ميں بجلي سے زيادہ تيز
کرتي ہے ملوکيت آثار جنوں پيدا
اللہ کے نشتر ہيں تيمور ہو يا چنگيز
يوں داد سخن مجھ کو ديتے ہيں عراق و پارس
يہ کافر ہندي ہے بے تيغ و سناں خوں ريز
وہ حرف راز کہ مجھ کو سکھا گيا ہے جنوں
خدا مجھے نفس جبرئيل دے تو کہوں
ستارہ کيا مري تقدير کي خبر دے گا
وہ خود فراخي افلاک ميں ہے خوار و زبوں
حيات کيا ہے ، خيال و نظر کي مجذوبي
خودي کي موت ہے انديشہ ہائے گونا گوں
عجب مزا ہے ، مجھے لذت خودي دے کر
وہ چاہتے ہيں کہ ميں اپنے آپ ميں نہ رہوں
ضمير پاک و نگاہ بلند و مستي شوق
نہ مال و دولت قاروں ، نہ فکر افلاطوں
سبق ملا ہے يہ معراج مصطفي سے مجھے
کہ عالم بشريت کي زد ميں ہے گردوں
يہ کائنات ابھي ناتمام ہے شايد
'کہ آرہي ہے دما دم صدائے 'کن فيکوں
علاج آتش رومي کے سوز ميں ہے ترا
تري خرد پہ ہے غالب فرنگيوں کا فسوں
اسي کے فيض سے ميري نگاہ ہے روشن
اسي کے فيض سے ميرے سبو ميں ہے جيحوں
عالم آب و خاک و باد! سر عياں ہے تو کہ ميں
وہ جو نظر سے ہے نہاں ، اس کا جہاں ہے تو کہ ميں
وہ شب درد و سوز و غم ، کہتے ہيں زندگي جسے
اس کي سحر ہے تو کہ ميں ، اس کي اذاں ہے تو کہ ميں
کس کي نمود کے ليے شام و سحر ہيں گرم سير
شانہ روزگار پر بار گراں ہے تو کہ ميں
تو کف خاک و بے بصر ، ميں کف خاک و خودنگر
کشت وجود کے ليے آب رواں ہے تو کہ ميں
تو ابھي رہ گزر ميں ہے ، قيد مقام سے گزر
مصر و حجاز سے گزر ، پارس و شام سے گزر
جس کا عمل ہے بے غرض ، اس کي جزا کچھ اور ہے
حور و خيام سے گزر ، بادہ و جام سے گزر
گرچہ ہے دلکشا بہت حسن فرنگ کي بہار
طائرک بلند بال ، دانہ و دام سے گزر
کوہ شگاف تيري ضرب ، تجھ سے کشاد شرق و غرب
تيغ ہلال کي طرح عيش نيام سے گزر
تيرا امام بے حضور ، تيري نماز بے سرور
!ايسي نماز سے گزر ، ايسے امام سے گزر
امين راز ہے مردان حر کي درويشي
کہ جبرئيل سے ہے اس کو نسبت خويشي
کسے خبر کہ سفينے ڈبو چکي کتنے
فقيہ و صوفي و شاعر کي نا خوش انديشي
نگاہ گرم کہ شيروں کے جس سے ہوش اڑ جائيں
نہ آہ سرد کہ ہے گوسفندي و ميشي
طبيب عشق نے ديکھا مجھے تو فرمايا
ترا مرض ہے فقط آرزو کي بے نيشي
وہ شے کچھ اور ہے کہتے ہيں جان پاک جسے
يہ رنگ و نم ، يہ لہو ، آب و ناں کي ہے بيشي
پھر چراغ لالہ سے روشن ہوئے کوہ و دمن
مجھ کو پھر نغموں پہ اکسانے لگا مرغ چمن
پھول ہيں صحرا ميں يا پرياں قطار اندر قطار
اودے اودے ، نيلے نيلے ، پيلے پيلے پيرہن
برگ گل پر رکھ گئي شبنم کا موتي باد صبح
اور چمکاتي ہے اس موتي کو سورج کي کرن
حسن بے پروا کو اپني بے نقابي کے ليے
ہوں اگر شہروں سے بن پيارے تو شہر اچھے کہ بن
اپنے من ميں ڈوب کر پا جا سراغ زندگي
تو اگر ميرا نہيں بنتا نہ بن ، اپنا تو بن
من کي دنيا ! من کي دنيا سوز و مستي ، جذب و شوق
تن کي دنيا! تن کي دنيا سود و سودا ، مکروفن
من کي دولت ہاتھ آتي ہے تو پھر جاتي نہيں
تن کي دولت چھاؤں ہے ، آتا ہے دھن جاتا ہے دھن
من کي دنيا ميں نہ پايا ميں نے افرنگي کا راج
من کي دنيا ميں نہ ديکھے ميں نے شيخ و برہمن
پاني پاني کر گئي مجھ کو قلندر کي يہ بات
تو جھکا جب غير کے آگے ، نہ من تيرا نہ تن
مسلماں کے لہو ميں ہے سليقہ دل نوازي کا
مروت حسن عالم گير ہے مردان غازي کا
شکايت ہے مجھے يا رب! خداوندان مکتب سے
سبق شاہيں بچوں کو دے رہے ہيں خاکبازي کا
بہت مدت کے نخچيروں کا انداز نگہ بدلا
کہ ميں نے فاش کر ڈالا طريقہ شاہبازي کا
قلندر جز دو حرف لاالہ کچھ بھي نہيں رکھتا
فقيہ شہر قاروں ہے لغت ہائے حجازي کا
حديث بادہ و مينا و جام آتي نہيں مجھ کو
نہ کر خارا شگافوں سے تقاضا شيشہ سازي کا
کہاں سے تونے اے اقبال سيکھي ہے يہ درويشي
کہ چرچا پادشاہوں ميں ہے تيري بے نيازي کا
عشق سے پيدا نوائے زندگي ميں زير و بم
عشق سے مٹي کي تصويروں ميں سوز وم بہ دم
آدمي کے ريشے ريشے ميں سما جاتا ہے عشق
شاخ گل ميں جس طرح باد سحر گاہي کا نم
اپنے رازق کو نہ پہچانے تو محتاج ملوک
اور پہچانے تو ہيں تيرے گدا دارا و جم
دل کي آزادي شہنشاہي ، شکم سامان موت
!فيصلہ تيرا ترے ہاتھوں ميں ہے ، دل يا شکم
اے مسلماں! اپنے دل سے پوچھ ، ملا سے نہ پوچھ
ہوگيا اللہ کے بندوں سے کيوں خالي حرم
دل سوز سے خالي ہے ، نگہ پاک نہيں ہے
پھر اس ميں عجب کيا کہ تو بے باک نہيں ہے
ہے ذوق تجلي بھي اسي خاک ميں پنہاں
غافل! تو نرا صاحب ادراک نہيں ہے
وہ آنکھ کہ ہے سرم ہ افرنگ سے روشن
پرکار و سخن ساز ہے ، نم ناک نہيں ہے
کيا صوفي و ملا کو خبر ميرے جنوں کي
ان کا سر دامن بھي ابھي چاک نہيں ہے
کب تک رہے محکومي انجم ميں مري خاک
يا ميں نہيں ، يا گردش افلاک نہيں ہے
بجلي ہوں ، نظر کوہ و بياباں پہ ہے مري
ميرے ليے شاياں خس و خاشاک نہيں ہے
عالم ہے فقط مومن جاں باز کي ميراث
!مومن نہيں جو صاحب لولاک نہيں ہے
ہزار خوف ہو ليکن زباں ہو دل کي رفيق
يہي رہا ہے ازل سے قلندروں کا طريق
ہجوم کيوں ہے زيادہ شراب خانے ميں
فقط يہ بات کہ پير مغاں ہے مرد خليق
علاج ضعف يقيں ان سے ہو نہيں سکتا
غريب اگرچہ ہيں رازي کے نکتہ ہائے دقيق
مريد سادہ تو رو رو کے ہو گيا تائب
خدا کرے کہ ملے شيخ کو بھي يہ توفيق
اسي طلسم کہن ميں اسير ہے آدم
بغل ميں اس کي ہيں اب تک بتان عہد عتيق
مرے ليے تو ہے اقرار باللساں بھي بہت
ہزار شکر کہ ملا ہيں صاحب تصديق
اگر ہو عشق تو ہے کفر بھي مسلماني
نہ ہو تو مرد مسلماں بھي کافر و زنديق
پوچھ اس سے کہ مقبول ہے فطرت کي گواہي
تو صاحب منزل ہے کہ بھٹکا ہوا راہي
کافر ہے مسلماں تو نہ شاہي نہ فقيري
مومن ہے تو کرتا ہے فقيري ميں بھي شاہي
کافر ہے تو شمشير پہ کرتا ہے بھروسا
مومن ہے تو بے تيغ بھي لڑتا ہے سپاہي
کافر ہے تو ہے تابع تقدير مسلماں
مومن ہے تو وہ آپ ہے تقدير الہي
ميں نے توکيا پردئہ اسرار کو بھي چاک
ديرينہ ہے تيرا مرض کور نگاہي
يہ حوريان فرنگي ، دل و نظر کا حجاب
بہشت مغربياں ، جلوہ ہائے پا بہ رکاب
دل و نظر کا سفينہ سنبھال کر لے جا
مہ و ستارہ ہيں بحر وجود ميں گرداب
جہان صوت و صدا ميں سما نہيں سکتي
لطيفہ ازلي ہے فغان چنگ و رباب
سکھا ديے ہيں اسے شيوہ ہائے خانقہي
فقيہ شہر کو صوفي نے کر ديا ہے خراب
وہ سجدہ ، روح زميں جس سے کانپ جاتي تھي
اسي کو آج ترستے ہيں منبر و محراب
سني نہ مصر و فلسطيں ميں وہ اذاں ميں نے
ديا تھا جس نے پہاڑوں کو رعشہ سيماب
ہوائے قرطبہ! شايد يہ ہے اثر تيرا
مري نوا ميں ہے سوز و سرور عہد شباب
دل بيدار فاروقي ، دل بيدار کراري
مس آدم کے حق ميں کيميا ہے دل کي بيداري
دل بيدار پيدا کر کہ دل خوابيدہ ہے جب تک
نہ تيري ضرب ہے کاري ، نہ ميري ضرب ہے کاري
مشام تيز سے ملتا ہے صحرا ميں نشاں اس کا
ظن و تخميں سے ہاتھ آتا نہيں آہوئے تاتاري
اس انديشے سے ضبط آہ ميں کرتا رہوں کب تک
کہ مغ زادے نہ لے جائيں تري قسمت کي چنگاري
خداوندا يہ تيرے سادہ دل بندے کدھر جائيں
کہ درويشي بھي عياري ہے ، سلطاني بھي عياري
مجھے تہذيب حاضر نے عطا کي ہے وہ آزادي
کہ ظاہر ميں تو آزادي ہے ، باطن ميں گرفتاري
تو اے مولائے يثرب! آپ ميري چارہ سازي کر
مري دانش ہے افرنگي ، مرا ايماں ہے زناري
خودي کي شوخي و تندي ميں کبر و ناز نہيں
جو ناز ہو بھي تو بے لذت نياز نہيں
نگاہ عشق دل زندہ کي تلاش ميں ہے
شکار مردہ سزاوار شاہباز نہيں
مري نوا ميں نہيں ہے ادائے محبوبي
کہ بانگ صور سرافيل دل نواز نہيں
سوال مے نہ کروں ساقي فرنگ سے ميں
کہ يہ طريقہ رندان پاک باز نہيں
ہوئي نہ عام جہاں ميں کبھي حکومت عشق
سبب يہ ہے کہ محبت زمانہ ساز نہيں
اک اضطراب مسلسل ، غياب ہو کہ حضور
ميں خود کہوں تو مري داستاں دراز نہيں
اگر ہو ذوق تو خلوت ميں پڑھ زبور عجم
فغان نيم شبي بے نوائے راز نہيں
مير سپاہ ناسزا ، لشکرياں شکستہ صف
آہ! وہ تير نيم کش جس کا نہ ہو کوئي ہدف
تيرے محيط ميں کہيں گوہر زندگي نہيں
ڈھونڈ چکا ميں موج موج ، ديکھ چکا صدف صدف
عشق بتاں سے ہاتھ اٹھا ، اپني خودي ميں ڈوب جا
نقش و نگار دير ميں خون جگر نہ کر تلف
کھول کے کيا بياں کروں سر مقام مرگ و عشق
عشق ہے مرگ با شرف ، مرگ حيات بے شرف
صحبت پير روم سے مجھ پہ ہوا يہ راز فاش
لاکھ حکيم سر بجيب ، ايک کليم سر بکف
مثل کليم ہو اگر معرکہ آزما کوئي
اب بھي درخت طور سے آتي ہے بانگ' لا تخف
خيرہ نہ کر سکا مجھے جلوہ دانش فرنگ
سرمہ ہے ميري آنکھ کا خاک مدينہ و نجف
زمستاني ہوا ميں گرچہ تھي شمشير کي تيزي
نہ چھوٹے مجھ سے لندن ميں بھي آداب سحر خيزي
کہيں سرمايہ محفل تھي ميري گرم گفتاري
کہيں سب کو پريشاں کر گئي ميري کم آميزي
!زمام کار اگر مزدور کے ہاتھوں ميں ہو پھر کيا
طريق کوہکن ميں بھي وہي حيلے ہيں پرويزي
جلال پادشاہي ہو کہ جمہوري تماشا ہو
جدا ہو ديں سياست سے تو رہ جاتي ہے چنگيزي
سواد رومة الکبرے ميں دلي ياد آتي ہے
وہي عبرت ، وہي عظمت ، وہي شان دل آويزي
يہ دير کہن کيا ہے ، انبار خس و خاشاک
مشکل ہے گزر اس ميں بے نالہ آتش ناک
نخچير محبت کا قصہ نہيں طولاني
لطف خلش پيکاں ، آسودگي فتراک
کھويا گيا جو مطلب ہفتاد و دو ملت ميں
سمجھے گا نہ تو جب تک بے رنگ نہ ہو ادراک
اک شرع مسلماني ، اک جذب مسلماني
ہے جذب مسلماني سر فلک الافلاک
اے رہرو فرزانہ ، بے جذب مسلماني
نے راہ عمل پيدا نے شاخ يقيں نم ناک
رمزيں ہيں محبت کي گستاخي و بے باکي
ہر شوق نہيں گستاخ ، ہر جذب نہيں بے باک
فارغ تو نہ بيٹھے گا محشر ميں جنوں ميرا
!يا اپنا گريباں چاک يا دامن يزداں چاک
کمال ترک نہيں آب و گل سے مہجوري
کمال ترک ہے تسخير خاکي و نوري
ميں ايسے فقر سے اے اہل حلقہ باز آيا
تمھارا فقر ہے بے دولتي و رنجوري
نہ فقر کے ليے موزوں ، نہ سلطنت کے ليے
وہ قوم جس نے گنوايا متاع تيموري
سنے نہ ساقي مہ وش تو اور بھي اچھا
عيار گرمي صحبت ہے حرف معذوري
حکيم و عارف و صوفي ، تمام مست ظہور
کسے خبر کہ تجلي ہے عين مستوري
وہ ملتفت ہوں تو کنج قفس بھي آزادي
نہ ہوں تو صحن چمن بھي مقام مجبوري
برا نہ مان ، ذرا آزما کے ديکھ اسے
فرنگ دل کي خرابي ، خرد کي معموري
عقل گو آستاں سے دور نہيں
اس کي تقدير ميں حضور نہيں
دل بينا بھي کر خدا سے طلب
آنکھ کا نور دل کا نور نہيں
علم ميں بھي سرور ہے ليکن
يہ وہ جنت ہے جس ميں حور نہيں
کيا غضب ہے کہ اس زمانے ميں
ايک بھي صاحب سرور نہيں
اک جنوں ہے کہ باشعور بھي ہے
اک جنوں ہے کہ باشعور نہيں
ناصبوري ہے زندگي دل کي
آہ وہ دل کہ ناصبور نہيں
بے حضوري ہے تيري موت کا راز
زندہ ہو تو تو بے حضور نہيں
ہر گہر نے صدف کو توڑ ديا
تو ہي آمادہ ظہور نہيں
ارني ميں بھي کہہ رہا ہوں ، مگر
يہ حديث کليم و طور نہيں
خودي وہ بحر ہے جس کا کوئي کنارہ نہيں
تو آبجو اسے سمجھا اگر تو چارہ نہيں
طلسم گنبد گردوں کو توڑ سکتے ہيں
زجاج کي يہ عمارت ہے ، سنگ خارہ نہيں
خودي ميں ڈوبتے ہيں پھر ابھر بھي آتے ہيں
مگر يہ حوصلہ مرد ہيچ کارہ نہيں
ترے مقام کو انجم شناس کيا جانے
کہ خاک زندہ ہے تو ، تابع ستارہ نہيں
يہيں بہشت بھي ہے ، حور و جبرئيل بھي ہے
تري نگہ ميں ابھي شوخي نظارہ نہيں
مرے جنوں نے زمانے کو خوب پہچانا
وہ پيرہن مجھے بخشا کہ پارہ پارہ نہيں
غضب ہے ، عين کرم ميں بخيل ہے فطرت
کہ لعل ناب ميں آتش تو ہے ، شرارہ نہيں
يہ پيام دے گئي ہے مجھے باد صبح گاہي
کہ خودي کے عارفوں کا ہے مقام پادشاہي
تري زندگي اسي سے ، تري آبرو اسي سے
جو رہي خودي تو شاہي ، نہ رہي تو روسياہي
نہ ديا نشان منزل مجھے اے حکيم تو نے
مجھے کيا گلہ ہو تجھ سے ، تو نہ رہ نشيں نہ راہي
مرے حلقہ سخن ميں ابھي زير تربيت ہيں
وہ گدا کہ جانتے ہيں رہ و رسم کجکلاہي
يہ معاملے ہيں نازک ، جو تري رضا ہو تو کر
کہ مجھے تو خوش نہ آيا يہ طريق خانقاہي
تو ہما کا ہے شکاري ، ابھي ابتدا ہے تيري
نہيں مصلحت سے خالي يہ جہان مرغ و ماہي
تو عرب ہو يا عجم ہو ، ترا لا الہ الا
لغت غريب ، جب تک ترا دل نہ دے گواہي
تري نگاہ فرومايہ ، ہاتھ ہے کوتاہ
ترا گنہ کہ نخيل بلند کا ہے گناہ
گلا تو گھونٹ ديا اہل مدرسہ نے ترا
'کہاں سے آئے صدا 'لا الہ الا اللہ
!خودي ميں گم ہے خدائي ، تلاش کر غافل
يہي ہے تيرے ليے اب صلاح کار کي راہ
حديث دل کسي درويش بے گليم سے پوچھ
خدا کرے تجھے تيرے مقام سے آگاہ
برہنہ سر ہے تو عزم بلند پيدا کر
يہاں فقط سر شاہيں کے واسطے ہے کلاہ
نہ ہے ستارے کي گردش ، نہ بازي افلاک
خودي کي موت ہے تيرا زوال نعمت و جاہ
اٹھا ميں مدرسہ و خانقاہ سے غم ناک
!نہ زندگي ، نہ محبت ، نہ معرفت ، نہ نگاہ
خرد کے پاس خبر کے سوا کچھ اور نہيں
ترا علاج نظر کے سوا کچھ اور نہيں
ہر اک مقام سے آگے مقام ہے تيرا
حيات ذوق سفر کے سوا کچھ اور نہيں
گراں بہا ہے تو حفظ خودي سے ہے ورنہ
گہر ميں آب گہر کے سوا کچھ اور نہيں
رگوں ميں گردش خوں ہے اگر تو کيا حاصل
حيات سوز جگر کے سوا کچھ اور نہيں
عروس لالہ! مناسب نہيں ہے مجھ سے حجاب
کہ ميں نسيم سحر کے سوا کچھ اور نہيں
جسے کساد سمجھتے ہيں تاجران فرنگ
وہ شے متاع ہنر کے سوا کچھ اور نہيں
بڑا کريم ہے اقبال بے نوا ليکن
عطائے شعلہ شرر کے سوا کچھ اور نہيں
نگاہ فقر ميں شان سکندري کيا ہے
!خراج کي جو گدا ہو ، وہ قيصري کيا ہے
بتوں سے تجھ کو اميديں ، خدا سے نوميدي
!مجھے بتا تو سہي اور کافري کيا ہے
فلک نے ان کو عطا کي ہے خواجگي کہ جنھيں
خبر نہيں روش بندہ پروري کيا ہے
فقط نگاہ سے ہوتا ہے فيصلہ دل کا
نہ ہو نگاہ ميں شوخي تو دلبري کيا ہے
اسي خطا سے عتاب ملوک ہے مجھ پر
کہ جانتا ہوں مآل سکندري کيا ہے
کسے نہيں ہے تمنائے سروري ، ليکن
!خودي کي موت ہو جس ميں وہ سروري کيا ہے
خوش آگئي ہے جہاں کو قلندري ميري
!وگرنہ شعر مرا کيا ہے ، شاعري کيا ہے
نہ تو زميں کے ليے ہے نہ آسماں کے ليے
جہاں ہے تيرے ليے ، تو نہيں جہاں کے ليے
يہ عقل و دل ہيں شرر شعلہ محبت کے
وہ خار و خس کے ليے ہے ، يہ نيستاں کے ليے
مقام پرورش آہ و نالہ ہے يہ چمن
نہ سير گل کے ليے ہے نہ آشياں کے ليے
رہے گا راوي و نيل و فرات ميں کب تک
!ترا سفينہ کہ ہے بحر بے کراں کے ليے
نشان راہ دکھاتے تھے جو ستاروں کو
ترس گئے ہيں کسي مرد راہ داں کے ليے
نگہ بلند ، سخن دل نواز ، جاں پرسوز
يہي ہے رخت سفر مير کارواں کے ليے
ذرا سي بات تھي ، انديشہ عجم نے اسے
بڑھا ديا ہے فقط زيب داستاں کے ليے
مرے گلو ميں ہے اک نغمہ جبرئيل آشوب
سنبھال کر جسے رکھا ہے لامکاں کے ليے
تو اے اسير مکاں! لامکاں سے دور نہيں
وہ جلوہ گاہ ترے خاک داں سے دور نہيں
وہ مرغزار کہ بيم خزاں نہيں جس ميں
غميں نہ ہو کہ ترے آشياں سے دور نہيں
يہ ہے خلاصہ علم قلندري کہ حيات
خدنگ جستہ ہے ليکن کماں سے دور نہيں
فضا تري مہ و پرويں سے ہے ذرا آگے
قدم اٹھا ، يہ مقام آسماں سے دور نہيں
کہے نہ راہ نما سے کہ چھوڑ دے مجھ کو
يہ بات راہرو نکتہ داں سے دور نہيں
خرد نے مجھ کو عطا کي نظر حکيمانہ
سکھائي عشق نے مجھ کو حديث رندانہ
نہ بادہ ہے ، نہ صراحي ، نہ دور پيمانہ
فقط نگاہ سے رنگيں ہے بزم جانانہ
مري نوائے پريشاں کو شاعري نہ سمجھ
کہ ميں ہوں محرم راز درون ميخانہ
کلي کو ديکھ کہ ہے تشنہ نسيم سحر
اسي ميں ہے مرے دل کا تمام افسانہ
کوئي بتائے مجھے يہ غياب ہے کہ حضور
سب آشنا ہيں يہاں ، ايک ميں ہوں بيگانہ
فرنگ ميں کوئي دن اور بھي ٹھہر جاؤں
مرے جنوں کو سنبھالے اگر يہ ويرانہ
مقام عقل سے آساں گزر گيا اقبال
مقام شوق ميں کھويا گيا وہ فرزانہ
افلاک سے آتا ہے نالوں کا جواب آخر
کرتے ہيں خطاب آخر ، اٹھتے ہيں حجاب آخر
احوال محبت ميں کچھ فرق نہيں ايسا
سوز و تب و تاب اول ، سوزو تب و تاب آخر
ميں تجھ کو بتاتا ہوں ، تقدير امم کيا ہے
شمشير و سناں اول ، طاؤس و رباب آخر
ميخانہ يورپ کے دستور نرالے ہيں
لاتے ہيں سرور اول ، ديتے ہيں شراب آخر
کيا دبدبہ نادر ، کيا شوکت تيموري
ہو جاتے ہيں سب دفتر غرق م ے ناب آخر
خلوت کي گھڑي گزري ، جلوت کي گھڑي آئي
چھٹنے کو ہے بجلي سے آغوش سحاب آخر
تھا ضبط بہت مشکل اس سيل معاني کا
کہہ ڈالے قلندر نے اسرار کتاب آخر
ہر شے مسافر ، ہر چيز راہي
کيا چاند تارے ، کيا مرغ و ماہي
تو مرد ميداں ، تو مير لشکر
نوري حضوري تيرے سپاہي
کچھ قدر اپني تو نے نہ جاني
!يہ بے سوادي ، يہ کم نگاہي
دنيائے دوں کي کب تک غلامي
يا راہبي کر يا پادشاہي
پير حرم کو ديکھا ہے ميں نے
کردار بے سوز ، گفتار واہي
ہر چيز ہے محو خود نمائي
ہر ذرہ شہيد کبريائي
بے ذوق نمود زندگي ، موت
تعمير خودي ميں ہے خدائي
رائي زور خودي سے پربت
پربت ضعف خودي سے رائي
تارے آوارہ و کم آميز
تقدير وجود ہے جدائي
يہ پچھلے پہر کا زرد رو چاند
بے راز و نياز آشنائي
تيري قنديل ہے ترا دل
تو آپ ہے اپني روشنائي
اک تو ہے کہ حق ہے اس جہاں ميں
باقي ہے نمود سيميائي
ہيں عقدہ کشا يہ خار صحرا
کم کر گلہ برہنہ پائي
!اعجاز ہے کسي کا يا گردش زمانہ
ٹوٹا ہے ايشيا ميں سحر فرنگيانہ
تعمير آشياں سے ميں نے يہ راز پايا
اہل نوا کے حق ميں بجلي ہے آشيانہ
يہ بندگي خدائي ، وہ بندگي گدائي
!يا بندہ خدا بن يا بندہ زمانہ
غافل نہ ہو خودي سے ، کر اپني پاسباني
شايد کسي حرم کا تو بھي ہے آستانہ
اے لا الہ کے وارث! باقي نہيں ہے تجھ ميں
گفتار دلبرانہ ، کردار قاہرانہ
تيري نگاہ سے دل سينوں ميں کانپتے تھے
کھويا گيا ہے تيرا جذب قلندرانہ
راز حرم سے شايد اقبال باخبر ہے
ہيں اس کي گفتگو کے انداز محرمانہ
خردمندوں سے کيا پوچھوں کہ ميري ابتدا کيا ہے
کہ ميں اس فکر ميں رہتا ہوں ، ميري انتہا کيا ہے
خودي کو کر بلند اتنا کہ ہر تقدير سے پہلے
خدا بندے سے خود پوچھے ، بتا تيري رضا کيا ہے
مقام گفتگو کيا ہے اگر ميں کيميا گرہوں
!يہي سوز نفس ہے ، اور ميري کيميا کيا ہے
نظر آئيں مجھے تقدير کي گہرائياں اس ميں
نہ پوچھ اے ہم نشيں مجھ سے وہ چشم سرمہ سا کيا ہے
اگر ہوتا وہ مجذوب فرنگي اس زمانے ميں
تو اقبال اس کو سمجھاتا مقام کبريا کيا ہے
نواے صبح گاہي نے جگر خوں کر ديا ميرا
!خدايا جس خطا کي يہ سزا ہے ، وہ خطا کيا ہے
جب عشق سکھاتا ہے آداب خود آگاہي
کھلتے ہيں غلاموں پر اسرار شہنشاہي
عطار ہو ، رومي ہو ، رازي ہو ، غزالي ہو
کچھ ہاتھ نہيں آتا بے آہ سحر گاہي
!نوميد نہ ہو ان سے اے رہبر فرزانہ
کم کوش تو ہيں ليکن بے ذوق نہيں راہي
اے طائر لاہوتي! اس رزق سے موت اچھي
جس رزق سے آتي ہو پرواز ميں کوتاہي
دارا و سکندر سے وہ مرد فقير اولي
ہو جس کي فقيري ميں بوئے اسد اللہي
آئين جوانمردں ، حق گوئي و بے باکي
اللہ کے شيروں کو آتي نہيں روباہي
مجھے آہ و فغان نيم شب کا پھر پيام آيا
تھم اے رہرو کہ شايد پھر کوئي مشکل مقام آيا
ذرا تقدير کي گہرائيوں ميں ڈوب جا تو بھي
کہ اس جنگاہ سے ميں بن کے تيغ بے نيام آيا
يہ مصرع لکھ ديا کس شوخ نے محراب مسجد پر
يہ ناداں گر گئے سجدوں ميں جب وقت قيام آيا
چل ، اے ميري غريبي کا تماشا ديکھنے والے
وہ محفل اٹھ گئي جس دم تو مجھ تک دور جام آيا
ديا اقبال نے ہندي مسلمانوں کو سوز اپنا
يہ اک مرد تن آساں تھا ، تن آسانوں کے کام آيا
اسي اقبال کي ميں جستجو کرتا رہا برسوں
بڑي مدت کے بعد آخر وہ شاہيں زير دام آيا
نہ ہو طغيان مشتاقي تو ميں رہتا نہيں باقي
کہ ميري زندگي کيا ہے ، يہي طغيان مشتاقي
مجھے فطرت نوا پر پے بہ پے مجبور کرتي ہے
ابھي محفل ميں ہے شايد کوئي درد آشنا باقي
وہ آتش آج بھي تيرا نشيمن پھونک سکتي ہے
!طلب صادق نہ ہو تيري تو پھر کيا شکوئہ ساقي
نہ کر افرنگ کا اندازہ اس کي تابناکي سے
کہ بجلي کے چراغوں سے ہے اس جوہر کي براقي
دلوں ميں ولولے آفاق گيري کے نہيں اٹھتے
نگاہوں ميں اگر پيدا نہ ہو انداز آفاقي
خزاں ميں بھي کب آسکتا تھا ميں صياد کي زد ميں
مري غماز تھي شاخ نشيمن کي کم اوراقي
الٹ جائيں گي تدبيريں ، بدل جائيں گي تقديريں
حقيقت ہے ، نہيں ميرے تخيل کي يہ خلاقي
فطرت کو خرد کے روبرو کر
تسخير مقام رنگ و بو کر
تو اپني خودي کو کھو چکا ہے
کھوئي ہوئي شے کي جستجو کر
تاروں کي فضا ہے بيکرانہ
تو بھي يہ مقام آرزو کر
عرياں ہيں ترے چمن کي حوريں
چاک گل و لالہ کو رفو کر
بے ذوق نہيں اگرچہ فطرت
!جو اس سے نہ ہو سکا ، وہ تو کر
!يہ پيران کليسا و حرم ، اے وائے مجبوري
صلہ ان کي کدوي کاوش کا ہے سينوں کي بے نوري
يقيں پيدا کر اے ناداں! يقيں سے ہاتھ آتي ہے
وہ درويشي ، کہ جس کے سامنے جھکتي ہے فغفوري
کبھي حيرت ، کبھي مستي ، کبھي آہ سحرگاہي
بدلتا ہے ہزاروں رنگ ميرا درد مہجوري
حد ادراک سے باہر ہيں باتيں عشق و مستي کي
سمجھ ميں اس قدر آيا کہ دل کي موت ہے ، دوري
وہ اپنے حسن کي مستي سے ہيں مجبور پيدائي
مري آنکھوں کي بينائي ميں ہيں اسباب مستوري
کوئي تقدير کي منطق سمجھ سکتا نہيں ورنہ
نہ تھے ترکان عثماني سے کم ترکان تيموري
فقيران حرم کے ہاتھ اقبال آگيا کيونکر
ميسر ميرو سلطاں کو نہيں شاہين کافوري
تازہ پھر دانش حاضر نے کيا سحر قديم
گزر اس عہد ميں ممکن نہيں بے چوب کليم
عقل عيار ہے ، سو بھيس بنا ليتي ہے
!عشق بے چارہ نہ ملا ہے نہ زاہد نہ حکيم
عيش منزل ہے غريبان محبت پہ حرام
سب مسافر ہيں ، بظاہر نظر آتے ہيں مقيم
ہے گراں سير غم راحلہ و زاد سے تو
کوہ و دريا سے گزر سکتے ہيں مانند نسيم
مرد درويش کا سرمايہ ہے آزادي و مرگ
ہے کسي اور کي خاطر يہ نصاب زر و سيم
ستاروں سے آگے جہاں اور بھي ہيں
ابھي عشق کے امتحاں اور بھي ہيں
تہي ، زندگي سے نہيں يہ فضائيں
يہاں سينکڑوں کارواں اور بھي ہيں
قناعت نہ کر عالم رنگ و بو پر
چمن اور بھي آشياں اور بھي ہيں
اگر کھو گيا اک نشيمن تو کيا غم
مقامات آہ و فغاں اور بھي ہيں
تو شاہيں ہے ، پرواز ہے کام تيرا
ترے سامنے آسماں اور بھي ہيں
اسي روز و شب ميں الجھ کر نہ رہ جا
کہ تيرے زمان و مکاں اور بھي ہيں
گئے دن کہ تنہا تھا ميں انجمن ميں
يہاں اب مرے رازداں اور بھي ہيں
ڈھونڈ رہا ہے فرنگ عيش جہاں کا دوام
!وائے تمنائے خام ، وائے تمنائے خام
پير حرم نے کہا سن کے مري روئداد
پختہ ہے تيري فغاں ، اب نہ اسے دل ميں تھام
تھا ارني گو کليم ، ميں ارني گو نہيں
اس کو تقاضا روا ، مجھ پہ تقاضا حرام
گرچہ ہے افشائے راز ، اہل نظر کي فغاں
ہو نہيں سکتا کبھي شيوہ رندانہ عام
حلقہ صوفي ميں ذکر ، بے نم و بے سوز و ساز
ميں بھي رہا تشنہ کام ، تو بھي رہا تشنہ کام
عشق تري انتہا ، عشق مري انتہا
تو بھي ابھي ناتمام ، ميں بھي ابھي ناتمام
آہ کہ کھويا گيا تجھ سے فقيري کا راز
ورنہ ہے مال فقير سلطنت روم و شام
خودي ہو علم سے محکم تو غيرت جبريل
اگر ہو عشق سے محکم تو صور اسرافيل
عذاب دانش حاضر سے باخبر ہوں ميں
کہ ميں اس آگ ميں ڈالا گيا ہوں مثل خليل
فريب خوردہ منزل ہے کارواں ورنہ
زيادہ راحت منزل سے ہے نشاط رحيل
نظر نہيں تو مرے حلقہ سخن ميں نہ بيٹھ
کہ نکتہ ہائے خودي ہيں مثال تيغ اصيل
مجھے وہ درس فرنگ آج ياد آتے ہيں
!کہاں حضور کي لذت ، کہاں حجاب دليل
اندھيري شب ہے ، جدا اپنے قافلے سے ہے تو
ترے ليے ہے مرا شعلہ نوا ، قنديل
غريب و سادہ و رنگيں ہے داستان حرم
نہايت اس کي حسين ، ابتدا ہے اسمعيل
مکتبوں ميں کہيں رعنائي افکار بھي ہے؟
خانقاہوں ميں کہيں لذت اسرار بھي ہے؟
منزل راہرواں دور بھي ، دشوار بھي ہے
کوئي اس قافلے ميں قافلہ سالار بھي ہے؟
بڑھ کے خيبر سے ہے يہ معرکہ دين و وطن
اس زمانے ميں کوئي حيدر کرار بھي ہے؟
علم کي حد سے پرے ، بندہ مومن کے ليے
لذت شوق بھي ہے ، نعمت ديدار بھي ہے
پير ميخانہ يہ کہتا ہے کہ ايوان فرنگ
!سست بنياد بھي ہے ، آئنہ ديوار بھي ہے
حادثہ وہ جو ابھي پردہ افلاک ميں ہے
عکس اس کا مرے آئينہ ادراک ميں ہے
نہ ستارے ميں ہے ، نے گردش افلاک ميں ہے
تيري تقدير مرے نالہ بے باک ميں ہے
يا مري آہ ميں کوئي شرر زندہ نہيں
يا ذرا نم ابھي تيرے خس و خاشاک ميں ہے
کيا عجب ميري نوا ہائے سحر گاہي سے
زندہ ہو جائے وہ آتش کہ تري خاک ميں ہے
توڑ ڈالے گي يہي خاک طلسم شب و روز
گرچہ الجھي ہوئي تقدير کے پيچاک ميں ہے
رہا نہ حلقہ صوفي ميں سوز مشتاقي
فسانہ ہائے کرامات رہ گئے باقي
خراب کوشک سلطان و خانقاہ فقير
فغاں کہ تخت و مصلي کمال زراقي
کرے گي داور محشر کو شرمسار اک روز
کتاب صوفي و ملا کي سادہ اوراقي
نہ چيني و عربي وہ ، نہ رومي و شامي
سما سکا نہ دو عالم ميں مرد آفاقي
م ے شبانہ کي مستي تو ہو چکي ، ليکن
کھٹک رہا ہے دلوں ميں کرشمہ ساقي
چمن ميں تلخ نوائي مري گوارا کر
کہ زہر بھي کبھي کرتا ہے کار ترياقي
عزيز تر ہے متاع امير و سلطاں سے
وہ شعر جس ميں ہو بجلي کا سوز و براقي
ہوا نہ زور سے اس کے کوئي گريباں چاک
اگرچہ مغربيوں کا جنوں بھي تھا چالاک
م ے يقيں سے ضمير حيات ہے پرسوز
نصيب مدرسہ يا رب يہ آب آتش ناک
عروج آدم خاکي کے منتظر ہيں تمام
يہ کہکشاں ، يہ ستارے ، يہ نيلگوں افلاک
يہي زمانہ حاضر کي کائنات ہے کيا
دماغ روشن و دل تيرہ و نگہ بے باک
تو بے بصر ہو تو يہ مانع نگاہ بھي ہے
وگرنہ آگ ہے مومن ، جہاں خس و خاشاک
زمانہ عقل کو سمجھا ہوا ہے مشعل راہ
کسے خبر کہ جنوں بھي ہے صاحب ادراک
جہاں تمام ہے ميراث مرد مومن کي
ميرے کلام پہ حجت ہے نکتہ لولاک
يوں ہاتھ نہيں آتا وہ گوہر يک دانہ
!يک رنگي و آزادي اے ہمت مردانہ
يا سنجر و طغرل کا آئين جہاں گيري
!يا مرد قلندر کے انداز ملوکانہ
يا حيرت فارابي يا تاب و تب رومي
!يا فکر حکيمانہ يا جذب کليمانہ
يا عقل کي روباہي يا عشق يد اللہي
!يا حيلہ افرنگي يا حملہ ترکانہ
يا شرع مسلماني يا دير کي درباني
!يا نعرہ مستانہ ، کعبہ ہو کہ بت خانہ
ميري ميں فقيري ميں ، شاہي ميں غلامي ميں
کچھ کام نہيں بنتا بے جرأت رندانہ
نہ تخت و تاج ميں ، نے لشکر و سپاہ ميں ہے
جو بات مرد قلندر کي بارگاہ ميں ہے
صنم کدہ ہے جہاں اور مرد حق ہے خليل
يہ نکتہ وہ ہے کہ پوشيدہ لاالہ ميں ہے
وہي جہاں ہے ترا جس کو تو کرے پيدا
يہ سنگ و خشت نہيں ، جو تري نگاہ ميں ہے
مہ و ستارہ سے آگے مقام ہے جس کا
وہ مشت خاک ابھي آوارگان راہ ميں ہے
خبر ملي ہے خدايان بحر و بر سے مجھے
فرنگ رہ گزر سيل بے پناہ ميں ہے
تلاش اس کي فضاؤں ميں کر نصيب اپنا
جہان تازہ مري آہ صبح گاہ ميں ہے
مرے کدو کو غنيمت سمجھ کہ بادہ ناب
نہ مدرسے ميں ہے باقي نہ خانقاہ ميں ہے
فطرت نے نہ بخشا مجھے انديشہ چالاک
رکھتي ہے مگر طاقت پرواز مري خاک
وہ خاک کہ ہے جس کا جنوں صيقل ادراک
وہ خاک کہ جبريل کي ہے جس سے قبا چاک
وہ خاک کہ پروائے نشيمن نہيں رکھتي
چنتي نہيں پہنائے چمن سے خس و خاشاک
اس خاک کو اللہ نے بخشے ہيں وہ آنسو
کرتي ہے چمک جن کي ستاروں کو عرق ناک
کريں گے اہل نظر تازہ بستياں آباد
مري نگاہ نہيں سوئے کوفہ و بغداد
يہ مدرسہ ، يہ جواں ، يہ سرور و رعنائي
انھي کے دم سے ہے ميخانہ فرنگ آباد
نہ فلسفي سے ، نہ ملا سے ہے غرض مجھ کو
يہ دل کي موت ، وہ انديشہ و نظر کا فساد
فقيہ شہر کي تحقير! کيا مجال مري
مگر يہ بات کہ ميں ڈھونڈتا ہوں دل کي کشاد
خريد سکتے ہيں دنيا ميں عشرت پرويز
خدا کي دين ہے سرمايہ غم فرہاد
کيے ہيں فاش رموز قلندري ميں نے
کہ فکر مدرسہ و خانقاہ ہو آزاد
رشي کے فاقوں سے ٹوٹا نہ برہمن کا طلسم
عصا نہ ہو تو کليمي ہے کار بے بنياد
کي حق سے فرشتوں نے اقبال کي غمازي
گستاخ ہے ، کرتا ہے فطرت کي حنا بندي
خاکي ہے مگر اس کے انداز ہيں افلاکي
رومي ہے نہ شامي ہے ، کاشي نہ سمرقندي
سکھلائي فرشتوں کو آدم کي تڑپ اس نے
!آدم کو سکھاتا ہے آداب خداوندي
نے مہرہ باقي ، نے مہرہ بازي
جيتا ہے رومي ، ہارا ہے رازي
روشن ہے جام جمشيد اب تک
شاہي نہيں ہے بے شيشہ بازي
دل ہے مسلماں ميرا نہ تيرا
!تو بھي نمازي ، ميں بھي نمازي
ميں جانتا ہوں انجام اس کا
جس معرکے ميں ملا ہوں غازي
ترکي بھي شيريں ، تازي بھي شيريں
حرف محبت ترکي نہ تازي
آزر کا پيشہ خارا تراشي
کار خليلاں خارا گدازي
تو زندگي ہے ، پائندگي ہے
باقي ہے جو کچھ ، سب خاک بازي
گرم فغاں ہے جرس ، اٹھ کہ گيا قافلہ
!وائے وہ رہرو کہ ہے منتظر راحولہ
تيري طبيعت ہے اور ، تيرا زمانہ ہے اور
تيرے موافق نہيں خانقہي سلسلہ
دل ہو غلام خرد يا کہ امام خرد
سالک رہ ، ہوشيار! سخت ہے يہ مرحلہ
اس کي خودي ہے ابھي شام و سحر ميں اسير
گردش دوراں کا ہے جس کي زباں پر گلہ
تيرے نفس سے ہوئي آتش گل تيز تر
مرغ چمن! ہے يہي تيري نوا کا صلہ
مري نوا سے ہوئے زندہ عارف و عامي
ديا ہے ميں نے انھيں ذوق آتش آشامي
حرم کے پاس کوئي اعجمي ہے زمزمہ سنج
کہ تار تار ہوئے جامہ ہائے احرامي
حقيقت ابدي ہے مقام شبيري
بدلتے رہتے ہيں انداز کوفي و شامي
مجھے يہ ڈر ہے مقامر ہيں پختہ کار بہت
نہ رنگ لائے کہيں تيرے ہاتھ کي خامي
عجب نہيں کہ مسلماں کو پھر عطا کر ديں
شکوہ سنجر و فقر جنيد و بسطامي
قبائے علم و ہنر لطف خاص ہے ، ورنہ
!تري نگاہ ميں تھي ميري ناخوش اندامي
ہر اک مقام سے آگے گزر گيا مہ نو
کمال کس کو ميسر ہوا ہے بے تگ و دو
نفس کے زور سے وہ غنچہ وا ہوا بھي تو کيا
جسے نصيب نہيں آفتاب کا پرتو
نگاہ پاک ہے تيري تو پاک ہے دل بھي
کہ دل کو حق نے کيا ہے نگاہ کا پيرو
پنپ سکا نہ خياباں ميں لالہ دل سوز
کہ ساز گار نہيں يہ جہان گندم و جو
رہے نہ ايبک و غوري کے معرکے باقي
ہميشہ تازہ و شيريں ہے نغمہ خسرو
!کھو نہ جا اس سحروشام ميں اے صاحب ہوش
اک جہاں اور بھي ہے جس ميں نہ فردا ہے نہ دوش
کس کو معلوم ہے ہنگامہ فردا کا مقام
مسجد و مکتب و ميخانہ ہيں مدت سے خموش
ميں نے پايا ہے اسے اشک سحر گاہي ميں
جس در ناب سے خالي ہے صدف کي آغوش
نئي تہذيب تکلف کے سوا کچھ بھي نہيں
!چہرہ روشن ہو تو کيا حاجت گلگونہ فروش
صاحب ساز کو لازم ہے کہ غافل نہ رہے
گاہے گاہے غلط آہنگ بھي ہوتا ہے سروش
تھا جہاں مدرسہ شيري و شاہنشاہي
آج ان خانقہوں ميں ہے فقط روباہي
نظر آئي نہ مجھے قافلہ سالاروں ميں
وہ شباني کہ ہے تمہيد کليم اللہي
لذت نغمہ کہاں مرغ خوش الحاں کے ليے
آہ ، اس باغ ميں کرتا ہے نفس کوتاہي
ايک سرمستي و حيرت ہے سراپا تاريک
ايک سرمستي و حيرت ہے تمام آگاہي
صفت برق چمکتا ہے مرا فکر بلند
کہ بھٹکتے نہ پھريں ظلمت شب ميں راہي
ہے ياد مجھے نکتہ سلمان خوش آہنگ
دنيا نہيں مردان جفاکش کے ليے تنگ
چيتے کا جگر چاہيے ، شاہيں کا تجسس
جي سکتے ہيں بے روشني دانش و فرہنگ
کر بلبل و طاؤس کي تقليد سے توبہ
!بلبل فقط آواز ہے ، طاؤس فقط رنگ
فقر کے ہيں معجزات تاج و سرير و سپاہ
فقر ہے ميروں کا مير ، فقر ہے شاہوں کا شاہ
علم کا مقصود ہے پاکي عقل و خرد
فقر کا مقصود ہے عفت قلب و نگاہ
علم فقيہ و حکيم ، فقر مسيح و کليم
علم ہے جويائے راہ ، فقر ہے دانائے راہ
فقر مقام نظر ، علم مقام خبر
فقر ميں مستي ثواب ، علم ميں مستي گناہ
علم کا 'موجود' اور ، فقر کا 'موجود' اور
!اشھد ان لا الہ' اشھد ان لا الہ
چڑھتي ہے جب فقر کي سان پہ تيغ خودي
ايک سپاہي کي ضرب کرتي ہے کار سپاہ
دل اگر اس خاک ميں زندہ و بيدار ہو
تيري نگہ توڑ دے آئنہء مہروماہ
کمال جوش جنوں ميں رہا ميں گرم طواف
خدا کا شکر ، سلامت رہا حرم کا غلاف
يہ اتفاق مبارک ہو مومنوں کے ليے
کہ يک زباں ہيں فقيہان شہر ميرے خلاف
تڑپ رہا ہے فلاطوں ميان غيب و حضور
ازل سے اہل خرد کا مقام ہے اعراف
ترے ضمير پہ جب تک نہ ہو نزول کتاب
گرہ کشا ہے نہ رازي نہ صاحب کشاف
سرور و سوز ميں ناپائدار ہے ، ورنہ
م ے فرنگ کا تہ جرعہ بھي نہيں ناصاف
شعور و ہوش و خرد کا معاملہ ہے عجيب
مقام شوق ميں ہيں سب دل و نظر کے رقيب
ميں جانتا ہوں جماعت کا حشر کيا ہو گا
مسائل نظري ميں الجھ گيا ہے خطيب
اگرچہ ميرے نشيمن کا کر رہا ہے طواف
مري نوا ميں نہيں طائر چمن کا نصيب
سنا ہے ميں نے سخن رس ہے ترک عثماني
سنائے کون اسے اقبال کا يہ شعر غريب
سمجھ رہے ہيں وہ يورپ کو ہم جوار اپنا
!ستارے جن کے نشيمن سے ہيں زيادہ قريب
انداز بياں گرچہ بہت شوخ نہيں ہے
شايد کہ اتر جائے ترے دل ميں مري بات
يا وسعت افلاک ميں تکبير مسلسل
يا خاک کے آغوش ميں تسبيح و مناجات
وہ مذہب مردان خود آگاہ و خدا مست
يہ مذہب ملا و جمادات و نباتات
رہ و رسم حرم نا محرمانہ
کليسا کي ادا سوداگرانہ
تبرک ہے مرا پيراہن چاک
نہيں اہل جنوں کا يہ زمانہ
ظلام بحر ميں کھو کر سنبھل جا
تڑپ جا ، پيچ کھا کھا کر بدل جا
نہيں ساحل تري قسمت ميں اے موج
!ابھر کر جس طرف چاہے نکل جا
مکاني ہوں کہ آزاد مکاں ہوں
جہاں بيں ہوں کہ خود سارا جہاں ہوں
وہ اپني لامکاني ميں رہيں مست
!مجھے اتنا بتا ديں ميں کہاں ہوں
خودي کي خلوتوں ميں گم رہا ميں
خدا کے سامنے گويا نہ تھا ميں
نہ ديکھا آنکھ اٹھا کر جلوہ دوست
!قيامت ميں تماشا بن گيا ميں
پريشاں کاروبار آشنائي
!پريشاں تر مري رنگيں نوائي
کبھي ميں ڈھونڈتا ہوں لذت وصل
!خوش آتا ہے کبھي سوز جدائي
يقيں ، مثل خليل آتش نشيني
يقيں ، اللہ مستي ، خود گزيني
سن ، اے تہذيب حاضر کے گرفتار
غلامي سے بتر ہے بے يقيني
عرب کے سوز ميں ساز عجم ہے
حرم کا راز توحيد امم ہے
تہي وحدت سے ہے انديشہ غرب
کہ تہذيب فرنگي بے حرم ہے
کوئي ديکھے تو ميري نے نوازي
نفس ہندي ، مقام نغمہ تازي
نگہ آلودہ انداز افرنگ
!طبيعت غزنوي ، قسمت ايازي
ہر اک ذرے ميں ہے شايد مکيں دل
اسي جلوت ميں ہے خلوت نشيں دل
اسير دوش و فردا ہے و ليکن
غلام گردش دوراں نہيں دل
ترا انديشہ افلاکي نہيں ہے
تري پرواز لولاکي نہيں ہے
يہ مانا اصل شاہيني ہے تيري
تري آنکھوں ميں بے باکي نہيں ہے
نہ مومن ہے نہ مومن کي اميري
رہا صوفي ، گئي روشن ضميري
خدا سے پھر وہي قلب و نظر مانگ
نہيں ممکن اميري بے فقيري
خودي کي جلوتوں ميں مصطفائي
خودي کي خلوتوں ميں کبريائي
زمين و آسمان و کرسي و عرش
!خودي کي زد ميں ہے ساري خدائي
نگہ الجھي ہوئي ہے رنگ و بو ميں
خرد کھوئي گئي ہے چار سو ميں
نہ چھوڑ اے دل فغان صبح گاہي
!اماں شايد ملے ، اللہ ھو ميں
جمال عشق و مستي نے نوازي
جلال عشق و مستي بے نيازي
کمال عشق و مستي ظرف حيدر
زوال عشق و مستي حرف رازي
وہ ميرا رونق محفل کہاں ہے
مري بجلي ، مرا حاصل کہاں ہے
مقام اس کا ہے دل کي خلوتوں ميں
!خدا جانے مقام دل کہاں ہے
سوار ناقہ و محمل نہيں ميں
نشان جادہ ہوں ، منزل نہيں ميں
مري تقدير ہے خاشاک سوزي
فقط بجلي ہوں ميں ، حاصل نہيں ميں
ترے سينے ميں دم ہے ، دل نہيں ہے
ترا دم گرمي محفل نہيں ہے
گزر جا عقل سے آگے کہ يہ نور
چراغ راہ ہے ، منزل نہيں ہے
ترا جوہر ہے نوري ، پاک ہے تو
فروغ ديدئہ افلاک ہے تو
ترے صيد زبوں افرشتہ و حور
!کہ شاہين شہ لولاک ہے تو
محبت کا جنوں باقي نہيں ہے
مسلمانوں ميں خوں باقي نہيں ہے
صفيں کج ، دل پريشاں ، سجدہ بے ذوق
کہ جذب اندروں باقي نہيں ہے
خودي کے زور سے دنيا پہ چھا جا
مقام رنگ و بو کا راز پا جا
برنگ بحر ساحل آشنا رہ
کف ساحل سے دامن کھينچتا جا
چمن ميں رخت گل شبنم سے تر ہے
سمن ہے ، سبزہ ہے ، باد سحر ہے
مگر ہنگامہ ہو سکتا نہيں گرم
يہاں کا لالہ بے سوز جگر ہے
خرد سے راہرو روشن بصر ہے
خرد کيا ہے ، چراغ رہ گزر ہے
درون خانہ ہنگامے ہيں کيا کيا
!چراغ رہ گزر کو کيا خبر ہے
جوانوں کو مري آہ سحر دے
پھر ان شاہيں بچوں کو بال و پر دے
خدايا! آرزو ميري يہي ہے
مرا نور بصيرت عام کر دے
تري دنيا جہان مرغ و ماہي
مري دنيا فغان صبح گاہي
تري دنيا ميں ميں محکوم و مجبور
!مري دنيا ميں تيري پادشاہي
کرم تيرا کہ بے جوہر نہيں ميں
غلام طغرل و سنجر نہيں ميں
جہاں بيني مري فطرت ہے ليکن
کسي جمشيد کا ساغر نہيں ميں
وہي اصل مکان و لامکاں ہے
مکاں کيا شے ہے ، انداز بياں ہے
خضر کيونکر بتائے ، کيا بتائے
اگر ماہي کہے دريا کہاں ہے
کبھي آوارہ و بے خانماں عشق
کبھي شاہ شہاں نوشيرواں عشق
کبھي ميداں ميں آتا ہے زرہ پوش
!کبھي عريان و بے تيغ و سناں عشق
کبھي تنہائي کوہ و دمن عشق
کبھي سوز و سرور و انجمن عشق
کبھي سرمايہ محراب و منبر
!کبھي مولا علي خيبر شکن عشق
عطا اسلاف کا جذب دروں کر
شريک زمرئہ لا يحزنوں ، کر
خرد کي گتھياں سلجھا چکا ميں
!مرے مولا مجھے صاحب جنوں کر
يہ نکتہ ميں نے سيکھا بوالحسن سے
کہ جاں مرتي نہيں مرگ بدن سے
چمک سورج ميں کيا باقي رہے گي
!اگر بيزار ہو اپني کرن سے
خرد واقف نہيں ہے نيک و بد سے
بڑھي جاتي ہے ظالم اپني حد سے
خدا جانے مجھے کيا ہو گيا ہے
!خرد بيزار دل سے ، دل خرد سے
خدائي اہتمام خشک و تر ہے
خداوندا! خدائي درد سر ہے
!وليکن بندگي ، استغفراللہ
يہ درد سر نہيں ، درد جگر ہے
يہي آدم ہے سلطاں بحر و بر کا
کہوں کيا ماجرا اس بے بصر کا
نہ خود بيں ، نے خدا بيں نے جہاں بيں
!يہي شہکار ہے تيرے ہنر کا
دم عارف نسيم صبح دم ہے
اسي سے ريشہ معني ميں نم ہے
اگر کوئي شعيب آئے ميسر
شباني سے کليمي دو قدم ہے
رگوں ميں وہ لہو باقي نہيں ہے
وہ دل ، وہ آرزو باقي نہيں ہے
نماز و روزہ و قرباني و حج
يہ سب باقي ہيں ، تو باقي نہيں ہے
کھلے جاتے ہيں اسرار نہاني
'گيا دور حديث 'لن تراني
ہوئي جس کي خودي پہلے نمودار
!وہي مہدي ، وہي آخر زماني
زمانے کي يہ گردش جاودانہ
حقيقت ايک تو ، باقي فسانہ
کسي نے دوش ديکھا ہے نہ فردا
فقط امروز ہے تيرا زمانہ
حکيمي ، نامسلماني خودي کي
کليمي ، رمز پنہاني خودي کي
تجھے گر فقر و شاہي کا بتا دوں
!غريبي ميں نگہباني خودي کي
ترا تن روح سے ناآشنا ہے
عجب کيا ! آہ تيري نارسا ہے
تن بے روح سے بيزار ہے حق
خدائے زندہ ، زندوں کا خدا ہے
اقبال نے کل اہل خياباں کو سنايا
يہ شعر نشاط آور و پر سوز طرب ناک
ميں صورت گل دست صبا کا نہيں محتاج
کرتا ہے مرا جوش جنوں ميري قبا چاک
ہے يہي ميري نماز ، ہے يہي ميرا وضو
ميري نواؤں ميں ہے ميرے جگر کا لہو
صحبت اہل صفا ، نور و حضور و سرور
سر خوش و پرسوز ہے لالہ لب آبجو
راہ محبت ميں ہے کون کسي کا رفيق
ساتھ مرے رہ گئي ايک مري آرزو
ميرا نشيمن نہيں درگہ مير و وزير
ميرا نشيمن بھي تو ، شاخ نشيمن بھي تو
تجھ سے گريباں مرا مطلع صبح نشور
'تجھ سے مرے سينے ميں آتش 'اللہ ھو
تجھ سے مري زندگي سوز و تب و درد و داغ
تو ہي مري آرزو ، تو ہي مري جستجو
پاس اگر تو نہيں ، شہر ہے ويراں تمام
تو ہے تو آباد ہيں اجڑے ہوئے کاخ و کو
پھر وہ شراب کہن مجھ کو عطا کہ ميں
ڈھونڈ رہا ہوں اسے توڑ کے جام و سبو
چشم کرم ساقيا! دير سے ہيں منتظر
جلوتيوں کے سبو ، خلوتيوں کے کدو
تيري خدائي سے ہے ميرے جنوں کو گلہ
!اپنے ليے لامکاں ، ميرے ليے چار سو
فلسفہ و شعر کي اور حقيقت ہے کيا
حرف تمنا ، جسے کہہ نہ سکيں رو برو
سلسلہ روز و شب ، نقش گر حادثات
سلسلہ روز و شب ، اصل حيات و ممات
سلسلہ روز و شب ، تار حرير دو رنگ
جس سے بناتي ہے ذات اپني قبائے صفات
سلسلہ روز و شب ، ساز ازل کي فغاں
جس سے دکھاتي ہے ذات زيروبم ممکنات
تجھ کو پرکھتا ہے يہ ، مجھ کو پرکھتا ہے يہ
سلسلہ روز و شب ، صيرفي کائنات
تو ہو اگر کم عيار ، ميں ہوں اگر کم عيار
موت ہے تيري برات ، موت ہے ميري برات
تيرے شب وروز کي اور حقيقت ہے کيا
ايک زمانے کي رو جس ميں نہ دن ہے نہ رات
آني و فاني تمام معجزہ ہائے ہنر
!کار جہاں بے ثبات ، کار جہاں بے ثبات
اول و آخر فنا ، باطن و ظاہر فنا
نقش کہن ہو کہ نو ، منزل آخر فنا
ہے مگر اس نقش ميں رنگ ثبات دوام
جس کو کيا ہو کسي مرد خدا نے تمام
مرد خدا کا عمل عشق سے صاحب فروغ
عشق ہے اصل حيات ، موت ہے اس پر حرام
تند و سبک سير ہے گرچہ زمانے کي رو
عشق خود اک سيل ہے ، سيل کو ليتاہے تھام
عشق کي تقويم ميں عصررواں کے سوا
اور زمانے بھي ہيں جن کا نہيں کوئي نام
عشق دم جبرئيل ، عشق دل مصطفي
عشق خدا کا رسول ، عشق خدا کا کلام
عشق کي مستي سے ہے پيکر گل تابناک
عشق ہے صہبائے خام ، عشق ہے کاس الکرام
عشق فقيہ حرم ، عشق امير جنود
عشق ہے ابن السبيل ، اس کے ہزاروں مقام
عشق کے مضراب سے نغمہ تار حيات
عشق سے نور حيات ، عشق سے نار حيات
اے حرم قرطبہ! عشق سے تيرا وجود
عشق سراپا دوام ، جس ميں نہيں رفت و بود
رنگ ہو يا خشت و سنگ ، چنگ ہو يا حرف و صوت
معجزہ فن کي ہے خون جگر سے نمود
قطرہ خون جگر ، سل کو بناتا ہے دل
خون جگر سے صدا سوز و سرور و سرود
تيري فضا دل فروز ، ميري نوا سينہ سوز
تجھ سے دلوں کا حضور ، مجھ سے دلوں کي کشود
عرش معلي سے کم سينہ آدم نہيں
گرچہ کف خاک کي حد ہے سپہر کبود
پيکر نوري کو ہے سجدہ ميسر تو کيا
اس کو ميسر نہيں سوز و گداز سجود
کافر ہندي ہوں ميں ، ديکھ مرا ذوق و شوق
دل ميں صلوہ و درود ، لب پہ صلوہ و درود
شوق مري لے ميں ہے ، شوق مري نے ميں ہے
نغمہ 'اللہ ھو' ميرے رگ و پے ميں ہے
تيرا جلال و جمال ، مرد خدا کي دليل
وہ بھي جليل و جميل ، تو بھي جليل و جميل
تيري بنا پائدار ، تيرے ستوں بے شمار
شام کے صحرا ميں ہو جيسے ہجوم نخيل
تيرے در و بام پر وادي ايمن کا نور
تيرا منار بلند جلوہ گہ جبرئيل
مٹ نہيں سکتا کبھي مرد مسلماں کہ ہے
اس کي اذانوں سے فاش سر کليم و خليل
اس کي زميں بے حدود ، اس کا افق بے ثغور
اس کے سمندر کي موج ، دجلہ و دنيوب و نيل
اس کے زمانے عجيب ، اس کے فسانے غريب
عہد کہن کو ديا اس نے پيام رحيل
ساقي ارباب ذوق ، فارس ميدان شوق
بادہ ہے اس کا رحيق ، تيغ ہے اس کي اصيل
'مرد سپاہي ہے وہ اس کي زرہ 'لا الہ
'سايہ شمشير ميں اس کہ پنہ 'لا الہ
تجھ سے ہوا آشکار بندہ مومن کا راز
اس کے دنوں کي تپش ، اس کي شبوں کا گداز
اس کا مقام بلند ، اس کا خيال عظيم
اس کا سرور اس کا شوق ، اس کا نياز اس کا ناز
ہاتھ ہے اللہ کا بندئہ مومن کا ہاتھ
غالب و کار آفريں ، کارکشا ، کارساز
خاکي و نوري نہاد ، بندہ مولا صفات
ہر دو جہاں سے غني اس کا دل بے نياز
اس کي اميديں قليل ، اس کے مقاصد جليل
اس کي ادا دل فريب ، اس کي نگہ دل نواز
نرم دم گفتگو ، گرم دم جستجو
رزم ہو يا بزم ہو ، پاک دل و پاک باز
نقطہ پرکار حق ، مرد خدا کا يقيں
اور يہ عالم تمام وہم و طلسم و مجاز
عقل کي منزل ہے وہ ، عشق کا حاصل ہے وہ
حلقہ آفاق ميں گرمي محفل ہے وہ
کعبہ ارباب فن! سطوت دين مبيں
تجھ سے حرم مرتبت اندلسيوں کي زميں
ہے تہ گردوں اگر حسن ميں تيري نظير
قلب مسلماں ميں ہے ، اور نہيں ہے کہيں
آہ وہ مردان حق! وہ عربي شہسوار
حامل ' خلق عظيم' ، صاحب صدق و يقيں
جن کي حکومت سے ہے فاش يہ رمز غريب
سلطنت اہل دل فقر ہے ، شاہي نہيں
جن کي نگاہوں نے کي تربيت شرق و غرب
ظلمت يورپ ميں تھي جن کي خرد راہ بيں
جن کے لہو کے طفيل آج بھي ہيں اندلسي
خوش دل و گرم اختلاط ، سادہ و روشن جبيں
آج بھي اس ديس ميں عام ہے چشم غزال
اور نگاہوں کے تير آج بھي ہيں دل نشيں
بوئے يمن آج بھي اس کي ہواؤں ميں ہے
رنگ حجاز آج بھي اس کي نواؤں ميں ہے
ديدہ انجم ميں ہے تيري زميں ، آسماں
آہ کہ صديوں سے ہے تيري فضا بے اذاں
کون سي وادي ميں ہے ، کون سي منزل ميں ہے
!عشق بلا خيز کا قافلہ سخت جاں
ديکھ چکا المني ، شورش اصلاح ديں
جس نے نہ چھوڑے کہيں نقش کہن کے نشاں
حرف غلط بن گئي عصمت پير کنشت
اور ہوئي فکر کي کشتي نازک رواں
چشم فرانسيس بھي ديکھ چکي انقلاب
جس سے دگرگوں ہوا مغربيوں کا جہاں
ملت رومي نژاد کہنہ پرستي سے پير
لذت تجديد سے وہ بھي ہوئي پھر جواں
روح مسلماں ميں ہے آج وہي اضطراب
راز خدائي ہے يہ ، کہہ نہيں سکتي زباں
ديکھيے اس بحر کي تہ سے اچھلتا ہے کيا
!گنبد نيلو فري رنگ بدلتا ہے کيا
وادي کہسار ميں غرق شفق ہے سحاب
لعل بدخشاں کے ڈھير چھوڑ گيا آفتاب
سادہ و پرسوز ہے دختر دہقاں کا گيت
کشتي دل کے ليے سيل ہے عہد شباب
آب روان کبير! تيرے کنارے کوئي
ديکھ رہا ہے کسي اور زمانے کا خواب
عالم نو ہے ابھي پردہ تقدير ميں
ميري نگاہوں ميں ہے اس کي سحر بے حجاب
پردہ اٹھا دوں اگر چہرئہ افکار سے
لا نہ سکے گا فرنگ ميري نواؤں کي تاب
جس ميں نہ ہو انقلاب ، موت ہے وہ زندگي
روح امم کي حيات کشمکش انقلاب
صورت شمشير ہے دست قضا ميں وہ قوم
کرتي ہے جو ہر زماں اپنے عمل کا حساب
نقش ہيں سب ناتمام خون جگر کے بغير
نغمہ ہے سودائے خام خون جگر کے بغير
اک فغان بے شرر سينے ميں باقي رہ گئي
سوز بھي رخصت ہوا ، جاتي رہي تاثير بھي
مرد حر زنداں ميں ہے بے نيزہ و شمشير آج
ميں پشيماں ہوں ، پشيماں ہے مري تدبير بھي
خود بخود زنجير کي جانب کھنچا جاتا ہے دل
تھي اسي فولاد سے شايد مري شمشير بھي
جو مري تيغ دو دم تھي ، اب مري زنجير ہے
!شوخ و بے پروا ہے کتنا خالق تقدير بھي
ميري آنکھوں کا نور ہے تو
ميرے دل کا سرور ہے تو
اپني وادي سے دور ہوں ميں
ميرے ليے نخل طور ہے تو
مغرب کي ہوا نے تجھ کو پالا
صحرائے عرب کي حور ہے تو
پرديس ميں ناصبور ہوں ميں
پرديس ميں ناصبور ہے تو
غربت کي ہوا ميں بارور ہو
ساقي تيرا نم سحر ہو
عالم کا عجيب ہے نظارہ
دامان نگہ ہے پارہ پارہ
!ہمت کو شناوري مبارک
پيدا نہيں بحر کا کنارہ
ہے سوز دروں سے زندگاني
اٹھتا نہيں خاک سے شرارہ
صبح غربت ميں اور چمکا
ٹوٹا ہوا شام کا ستارہ
مومن کے جہاں کي حد نہيں ہے
مومن کا مقام ہر کہيں ہے
ہسپانيہ تو خون مسلماں کا اميں ہے
مانند حرم پاک ہے تو ميري نظر ميں
پوشيدہ تري خاک ميں سجدوں کے نشاں ہيں
خاموش اذانيں ہيں تري باد سحر ميں
روشن تھيں ستاروں کي طرح ان کي سنانيں
خيمے تھے کبھي جن کے ترے کوہ و کمر ميں
پھر تيرے حسينوں کو ضرورت ہے حنا کي؟
!باقي ہے ابھي رنگ مرے خون جگر ميں
کيونکر خس و خاشاک سے دب جائے مسلماں
مانا ، وہ تب و تاب نہيں اس کے شرر ميں
غرناطہ بھي ديکھا مري آنکھوں نے و ليکن
تسکين مسافر نہ سفر ميں نہ حضر ميں
ديکھا بھي دکھايا بھي ، سنايا بھي سنا بھي
!ہے دل کي تسلي نہ نظر ميں ، نہ خبر ميں
يہ غازي ، يہ تيرے پر اسرار بندے
جنھيں تو نے بخشا ہے ذوق خدائي
دو نيم ان کي ٹھوکر سے صحرا و دريا
سمٹ کر پہاڑ ان کي ہيبت سے رائي
دو عالم سے کرتي ہے بيگانہ دل کو
عجب چيز ہے لذت آشنائي
شہادت ہے مطلوب و مقصود مومن
نہ مال غنيمت نہ کشور کشائي
خياباں ميں ہے منتظر لالہ کب سے
قبا چاہيے اس کو خون عرب سے
کيا تو نے صحرا نشينوں کو يکتا
خبر ميں ، نظر ميں ، اذان سحر ميں
طلب جس کي صديوں سے تھي زندگي کو
وہ سوز اس نے پايا انھي کے جگر ميں
کشاد در دل سمجھتے ہيں اس کو
ہلاکت نہيں موت ان کي نظر ميں
دل مرد مومن ميں پھر زندہ کر دے
وہ بجلي کہ تھي نعرہ لاتذر ، ميں
عزائم کو سينوں ميں بيدار کردے
!نگاہ مسلماں کو تلوار کردے
اے انفس و آفاق ميں پيدا ترے آيات
حق يہ ہے کہ ہے زندہ و پائندہ تري ذات
ميں کيسے سمجھتا کہ تو ہے يا کہ نہيں ہے
ہر دم متغير تھے خرد کے نظريات
محرم نہيں فطرت کے سرود ازلي سے
بينائے کواکب ہو کہ دانائے نباتات
آج آنکھ نے ديکھا تو وہ عالم ہوا ثابت
ميں جس کو سمجھتا تھا کليسا کے خرافات
ہم بند شب و روز ميں جکڑے ہوئے بندے
!تو خالق اعصار و نگارندہ آنات
اک بات اگر مجھ کو اجازت ہو تو پوچھوں
حل کر نہ سکے جس کو حکيموں کے مقالات
جب تک ميں جيا خيمہ افلاک کے نيچے
کانٹے کي طرح دل ميں کھٹکتي رہي يہ بات
گفتار کے اسلوب پہ قابو نہيں رہتا
جب روح کے اندر متلاطم ہوں خيالات
وہ کون سا آدم ہے کہ تو جس کا ہے معبود
وہ آدم خاکي کہ جو ہے زير سماوات؟
مشرق کے خداوند سفيدان فرنگي
مغرب کے خداوند درخشندہ فلزات
يورپ ميں بہت روشني علم و ہنر ہے
حق يہ ہے کہ بے چشمہ حيواں ہے يہ ظلمات
رعنائي تعمير ميں ، رونق ميں ، صفا ميں
گرجوں سے کہيں بڑھ کے ہيں بنکوں کي عمارات
ظاہر ميں تجارت ہے ، حقيقت ميں جوا ہے
سود ايک کا لاکھوں کے ليے مرگ مفاجات
يہ علم ، يہ حکمت ، يہ تدبر ، يہ حکومت
پيتے ہيں لہو ، ديتے ہيں تعليم مساوات
بے کاري و عرياني و مے خواري و افلاس
کيا کم ہيں فرنگي مدنيت کے فتوحات
وہ قوم کہ فيضان سماوي سے ہو محروم
حد اس کے کمالات کي ہے برق و بخارات
ہے دل کے ليے موت مشينوں کي حکومت
احساس مروت کو کچل ديتے ہيں آلات
آثار تو کچھ کچھ نظر آتے ہيں کہ آخر
تدبير کو تقدير کے شاطر نے کيا مات
ميخانے کي بنياد ميں آيا ہے تزلزل
بيٹھے ہيں اسي فکر ميں پيران خرابات
چہروں پہ جو سرخي نظر آتي ہے سر شام
يا غازہ ہے يا ساغر و مينا کي کرامات
تو قادر و عادل ہے مگر تيرے جہاں ميں
ہيں تلخ بہت بندہ مزدور کے اوقات
کب ڈوبے گا سرمايہ پرستي کا سفينہ؟
دنيا ہے تري منتظر روز مکافات
عقل ہے بے زمام ابھي ، عشق ہے بے مقام ابھي
نقش گر ، ازل! ترا نقش ہے نا تمام ابھي
خلق خدا کي گھات ميں رند و فقيہ و مير و پير
تيرے جہاں ميں ہے وہي گردش صبح و شام ابھي
تيرے امير مال مست ، تيرے فقير حال مست
بندہ ہے کوچہ گرد ابھي ، خواجہ بلند بام ابھي
دانش و دين و علم و فن بندگي ہوس تمام
عشق گرہ کشاے کا فيض نہيں ہے عام ابھي
جوہر زندگي ہے عشق ، جوہر عشق ہے خودي
!آہ کہ ہے يہ تيغ تيز پردگي نيام ابھي
فرمان خدا - فرشتوں سے
اٹھو ! مري دنيا کے غريبوں کو جگا دو
کاخ امرا کے در و ديوار ہلا دو
گرماؤ غلاموں کا لہو سوز يقيں سے
کنجشک فرومايہ کو شاہيں سے لڑا دو
سلطاني جمہور کا آتا ہے زمانہ
جو نقش کہن تم کو نظر آئے ، مٹا دو
جس کھيت سے دہقاں کو ميسر نہيں روزي
اس کھيت کے ہر خوشہ گندم کو جلا دو
کيوں خالق و مخلوق ميں حائل رہيں پردے
پيران کليسا کو کليسا سے اٹھا دو
حق را بسجودے ، صنماں را بطوافے
بہتر ہے چراغ حرم و دير بجھا دو
ميں ناخوش و بيزار ہوں مرمر کي سلوں سے
ميرے ليے مٹي کا حرم اور بنا دو
تہذيب نوي کارگہ شيشہ گراں ہے
!آداب جنوں شاعر مشرق کو سکھا دو
دريغ آمدم زاں ہمہ بوستاں
تہي دست رفتن سوئے دوستاں
قلب و نظر کي زندگي دشت ميں صبح کا سماں
چشمہ آفتاب سے نور کي ندياں رواں
حسن ازل کي ہے نمود ، چاک ہے پردئہ وجود
دل کے ليے ہزار سود ايک نگاہ کا زياں
سرخ و کبود بدلياں چھوڑ گيا سحاب شب
کوہ اضم کو دے گيا رنگ برنگ طيلساں
گرد سے پاک ہے ہوا ، برگ نخيل دھل گئے
ريگ نواح کاظمہ نرم ہے مثل پرنياں
آگ بجھي ہوئي ادھر ، ٹوٹي ہوئي طناب ادھر
کيا خبر اس مقام سے گزرے ہيں کتنے کارواں
آئي صدائے جبرئيل ، تيرا مقام ہے يہي
اہل فراق کے ليے عيش دوام ہے يہي
کس سے کہوں کہ زہر ہے ميرے ليے م ے حيات
کہنہ ہے بزم کائنات ، تازہ ہيں ميرے واردات
کيا نہيں اور غزنوي کارگہ حيات ميں
بيٹھے ہيں کب سے منتظر اہل حرم کے سومنات
ذکر عرب کے سوز ميں ، فکر عجم کے ساز ميں
نے عربي مشاہدات ، نے عجمي تخيلات
قافلہء حجاز ميں ايک حسين بھي نہيں
گرچہ ہے تاب دار ابھي گيسوئے دجلہ و فرات
عقل و دل و نگاہ کا مرشد اوليں ہے عشق
عشق نہ ہو تو شرع و ديں بت کدئہ تصورات
صدق خليل بھي ہے عشق ، صبر حسين بھي ہے عشق
معرکہء وجود ميں بدر و حنين بھي ہے عشق
آيہء کائنات کا معني دير ياب تو
نکلے تري تلاش ميں قافلہ ہائے رنگ و بو
جلوتيان مدرسہ کور نگاہ و مردہ ذوق
خلوتيان مے کدہ کم طلب و تہي کدو
ميں کہ مري غزل ميں ہے آتش رفتہ کا سراغ
ميري تمام سرگزشت کھوئے ہوؤں کي جستجو
باد صبا کي موج سے نشوونمائے خار و خس
ميرے نفس کي موج سے نشوونمائے آرزو
خون دل و جگر سے ہے ميري نوا کي پرورش
ہے رگ ساز ميں رواں صاحب ساز کا لہو
فرصت کشمکش مدہ ايں دل بے قرار را
يک دو شکن زيادہ کن گيسوے تابدار را
لوح بھي تو ، قلم بھي تو ، تيرا وجود الکتاب
گنبد آبگينہ رنگ تيرے محيط ميں حباب
عالم آب و خاک ميں تيرے ظہور سے فروغ
ذرہ ريگ کو ديا تو نے طلوع آفتاب
شوکت سنجر و سليم تيرے جلال کي نمود
فقر جنيد و بايزيد تيرا جمال بے نقاب
شوق ترا اگر نہ ہو ميري نماز کا امام
ميرا قيام بھي حجاب ، ميرا سجود بھي حجاب
تيري نگاہ ناز سے دونوں مراد پا گئے
عقل غياب و جستجو ، عشق حضور و اضطراب
تيرہ و تار ہے جہاں گردش آفتاب سے
طبع زمانہ تازہ کر جلوئہ بے حجاب سے
تيري نظر ميں ہيں تمام ميرے گزشتہ روز و شب
مجھ کو خبر نہ تھي کہ ہے علم نخيل بے رطب
تازہ مرے ضمير ميں معرکہء کہن ہوا
عشق تمام مصطفي ، عقل تمام بولہب
گاہ بحيلہ مي برد ، گاہ بزور مي کشد
عشق کي ابتدا عجب ، عشق کي انتہا عجب
عالم سوز و ساز ميں وصل سے بڑھ کے ہے فراق
وصل ميں مرگ آرزو ، ہجر ميں لذت طلب
عين وصال ميں مجھے حوصلہء نظر نہ تھا
گرچہ بہانہ جو رہي ميري نگاہ بے ادب
گرمي آرزو فراق ، شورش ہاے و ہو فراق
!موج کي جستجو فراق ، قطرے کي آبرو فراق
پروانہ
پروانے کي منزل سے بہت دور ہے جگنو
کيوں آتش بے سوز پہ مغرور ہے جگنو
جگنو
اللہ کا سو شکر کہ پروانہ نہيں ميں
دريوزہ گر آتش بيگانہ نہيں ميں
خودي کے ساز ميں ہے عمر جاوداں کا سراغ
خودي کے سوز سے روشن ہيں امتوں کے چراغ
يہ ايک بات کہ آدم ہے صاحب مقصود
!ہزار گونہ فروغ و ہزار گونہ فراغ
ہوئي نہ زاغ ميں پيدا بلند پروازي
خراب کر گئي شاہيں بچے کو صحبت زاغ
حيا نہيں ہے زمانے کي آنکھ ميں باقي
خدا کرے کہ جواني تري رہے بے داغ
ٹھہر سکا نہ کسي خانقاہ ميں اقبال
کہ ہے ظريف و خوش انديشہ و شگفتہ دماغ
مے کدے ميں ايک دن اک رند زيرک نے کہا
ہے ہمارے شہر کا والي گدائے بے حيا
تاج پہنايا ہے کس کي بے کلاہي نے اسے
کس کي عرياني نے بخشي ہے اسے زريں قبا
اس کے آب لالہ گوں کي خون دہقاں سے کشيد
تيرے ميرے کھيت کي مٹي ہے اس کي کيميا
اس کے نعمت خانے کي ہر چيز ہے مانگي ہوئي
دينے والا کون ہے ، مرد غريب و بے نوا
مانگنے والا گدا ہے ، صدقہ مانگے يا خراج
!کوئي مانے يا نہ مانے ، ميرو سلطاں سب گدا
ميں بھي حاضر تھا وہاں ، ضبط سخن کر نہ سکا
حق سے جب حضرت ملا کو ملا حکم بہشت
عرض کي ميں نے ، الہي! مري تقصير معاف
خوش نہ آئيں گے اسے حور و شراب و لب کشت
نہيں فردوس مقام جدل و قال و اقول
بحث و تکرار اس اللہ کے بندے کي سرشت
ہے بد آموزي اقوام و ملل کام اس کا
!اور جنت ميں نہ مسجد ، نہ کليسا ، نہ کنشت
کليسا کي بنياد رہبانيت تھي
سماتي کہاں اس فقيري ميں ميري
خصومت تھي سلطاني و راہبي ميں
کہ وہ سربلندي ہے يہ سربزيري
سياست نے مذہب سے پيچھا چھٹرايا
چلي کچھ نہ پير کليسا کي پيري
ہوئي دين و دولت ميں جس دم جدائي
ہوس کي اميري ، ہوس کي وزيري
دوئي ملک و ديں کے ليے نامرادي
دوئي چشم تہذيب کي نابصيري
يہ اعجاز ہے ايک صحرا نشيں کا
!بشيري ہے آئينہ دار نذيري
اسي ميں حفاظت ہے انسانيت کي
کہ ہوں ايک جنےدي و اردشيري
پالتا ہے بيج کو مٹي کو تاريکي ميں کون
کون درياؤں کي موجوں سے اٹھاتا ہے سحاب؟
کون لايا کھينچ کر پچھم سے باد سازگار
خاک يہ کس کي ہے ، کس کا ہے يہ نور آفتاب؟
کس نے بھردي موتيوں سے خوشہء گندم کي جيب
موسموں کو کس نے سکھلائي ہے خوئے انقلاب؟
دہ خدايا! يہ زميں تيري نہيں ، تيري نہيں
تيرے آبا کي نہيں ، تيري نہيں ، ميري نہيں
ترے صوفے ہيں افرنگي ، ترے قاليں ہيں ايراني
لہو مجھ کو رلاتي ہے جوانوں کي تن آساني
امارت کيا ، شکوہ خسروي بھي ہو تو کيا حاصل
نہ زور حيدري تجھ ميں ، نہ استغنائے سلماني
نہ ڈھونڈ اس چيز کو تہذيب حاضر کي تجلي ميں
کہ پايا ميں نے استغنا ميں معراج مسلماني
عقابي روح جب بيدار ہوتي ہے جوانوں ميں
نظر آتي ہے اس کو اپني منزل آسمانوں ميں
نہ ہو نوميد ، نوميدي زوال علم و عرفاں ہے
اميد مرد مومن ہے خدا کے راز دانوں ميں
نہيں تيرا نشيمن قصر سلطاني کے گنبد پر
تو شاہيں ہے ، بسيرا کر پہاڑوں کي چٹانوں ميں
بچہء شاہيں سے کہتا تھا عقاب سالخورد
اے تيرے شہپر پہ آساں رفعت چرخ بريں
ہے شباب اپنے لہو کي آگ ميں جلنے کا نام
سخت کوشي سے ہے تلخ زندگاني انگبيں
!جو کبوتر پر جھپٹنے ميں مزا ہے اے پسر
وہ مزا شايد کبوتر کے لہو ميں بھي نہيں
يہ گنبد مينائي ، يہ عالم تنہائي
مجھ کو تو ڈراتي ہے اس دشت کي پہنائي
بھٹکا ہوا راہي ميں ، بھٹکا ہوا راہي تو
!منزل ہے کہاں تيري اے لالہء صحرائي
خالي ہے کليموں سے يہ کوہ و کمر ورنہ
!تو شعلہء سينائي ، ميں شعلہء سينائي
تو شاخ سے کيوں پھوٹا ، ميں شاخ سے کيوں ٹوٹا
!اک جذبہء پيدائي ، اک لذت يکتائي
غواص محبت کا اللہ نگہباں ہو
ہر قطرئہ دريا ميں دريا کي ہے گہرائي
اس موج کے ماتم ميں روتي ہے بھنور کي آنکھ
دريا سے اٹھي ليکن ساحل سے نہ ٹکرائي
ہے گرمي آدم سے ہنگامہء عالم گرم
سورج بھي تماشائي ، تارے بھي تماشائي
اے باد بياباني! مجھ کو بھي عنايت ہو
!خاموشي و دل سوزي ، سرمستي و رعنائي
ہوا خيمہ زن کاروان بہار
ارم بن گيا دامن کوہسار
گل و نرگس و سوسن و نسترن
شہيد ازل لالہ خونيں کفن
جہاں چھپ گيا پردئہ رنگ ميں
لہو کي ہے گردش رگ سنگ ميں
فضا نيلي نيلي ، ہوا ميں سرور
ٹھہرتے نہيں آشياں ميں طيور
وہ جوئے کہستاں اچکتي ہوئي
اٹکتي ، لچکتي ، سرکتي ہوئي
اچھلتي ، پھسلتي ، سنبھلتي ہوئي
بڑے پيچ کھا کر نکلتي ہوئي
رکے جب تو سل چير ديتي ہے يہ
پہاڑوں کے دل چير ديتي ہے يہ
!ذرا ديکھ اے ساقي لالہ فام
سناتي ہے يہ زندگي کا پيام
پلا دے مجھے وہ مےء پردہ سوز
کہ آتي نہيں فصل گل روز روز
وہ مے جس سے روشن ضمير حيات
وہ مے جس سے ہے مستي کائنات
وہ مے جس ميں ہے سوزوساز ازل
وہ مے جس سے کھلتا ہے راز ازل
اٹھا ساقيا پردہ اس راز سے
لڑا دے ممولے کو شہباز سے
زمانے کے انداز بدلے گئے
نيا راگ ہے ، ساز بدلے گئے
ہوا اس طرح فاش راز فرنگ
کہ حيرت ميں ہے شيشہ باز فرنگ
پراني سياست گري خوار ہے
زميں مير و سلطاں سے بيزار ہے
گيا دور سرمايہ داري گيا
تماشا دکھا کر مداري گيا
گراں خواب چيني سنبھلنے لگے
ہمالہ کے چشمے ابلنے لگے
دل طور سينا و فاراں دو نيم
تجلي کا پھر منتظر ہے کليم
مسلماں ہے توحيد ميں گرم جوش
مگر دل ابھي تک ہے زنار پوش
تمدن، تصوف، شريعت، کلام
!بتان عجم کے پجاري تمام
حقيقت خرافات ميں کھو گئي
يہ امت روايات ميں کھو گئي
لبھاتا ہے دل کو کلام خطيب
!مگر لذت شوق سے بے نصيب
بياں اس کا منطق سے سلجھا ہوا
لغت کے بکھيڑوں ميں الجھا ہوا
وہ صوفي کہ تھا خدمت حق ميں مرد
محبت ميں يکتا ، حميت ميں فرد
عجم کے خيالات ميں کھو گيا
يہ سالک مقامات ميں کھو گيا
بجھي عشق کي آگ ، اندھير ہے
مسلماں نہيں ، راکھ کا ڈھير ہے
شراب کہن پھر پلا ساقيا
!وہي جام گردش ميں لا ساقيا
مجھے عشق کے پر لگا کر اڑا
مري خاک جگنو بنا کر اڑا
خرد کو غلامي سے آزاد کر
جوانوں کو پيروں کا استاد کر
ہري شاخ ملت ترے نم سے ہے
نفس اس بدن ميں ترے دم سے ہے
تڑپنے پھٹرکنے کي توفيق دے
دل مرتضي ، سوز صديق دے
جگر سے وہي تير پھر پار کر
تمنا کو سينوں ميں بيدار کر
ترے آسمانوں کے تاروں کي خير
زمينوں کے شب زندہ داروں کي خير
جوانوں کو سوز جگر بخش دے
مرا عشق ، ميري نظر بخش دے
مري ناؤ گرداب سے پار کر
يہ ثابت ہے تو اس کو سيار کر
بتا مجھ کو اسرار مرگ و حيات
کہ تيري نگاہوں ميں ہے کائنات
مرے ديدئہ تر کي بے خوابياں
مرے دل کي پوشيدہ بے تابياں
مرے نالہء نيم شب کا نياز
مري خلوت و انجمن کا گداز
امنگيں مري ، آرزوئيں مري
اميديں مري ، جستجوئيں مري
مري فطرت آئينہء روزگار
غزالان افکار کا مرغزار
مرا دل ، مري رزم گاہ حيات
گمانوں کے لشکر ، يقيں کا ثبات
يہي کچھ ہے ساقي متاع فقير
اسي سے فقيري ميں ہوں ميں امير
مرے قافلے ميں لٹا دے اسے
!لٹا دے ، ٹھکانے لگا دے اسے
دما دم رواں ہے يم زندگي
ہر اک شے سے پيدا رم زندگي
اسي سے ہوئي ہے بدن کي نمود
کہ شعلے ميں پوشيدہ ہے موج دود
گراں گرچہ ہے صحبت آب و گل
خوش آئي اسے محنت آب و گل
يہ ثابت بھي ہے اور سيار بھي
عناصر کے پھندوں سے بيزار بھي
يہ وحدت ہے کثرت ميں ہر دم اسير
مگر ہر کہيں بے چگوں ، بے نظير
يہ عالم ، يہ بت خانہء شش جہات
اسي نے تراشا ہے يہ سومنات
پسند اس کو تکرار کي خو نہيں
کہ تو ميں نہيں ، اور ميں تو نہيں
من و تو سے ہے انجمن آفرين
مگر عين محفل ميں خلوت نشيں
چمک اس کي بجلي ميں تارے ميں ہے
يہ چاندي ميں ، سونے ميں ، پارے ميں ہے
اسي کے بياباں ، اسي کے ببول
اسي کے ہيں کانٹے ، اسي کے ہيں پھول
کہيں اس کي طاقت سے کہسار چور
کہيں اس کے پھندے ميں جبريل و حور
کہيں جرہ شاہين سيماب رنگ
لہو سے چکوروں کے آلودہ چنگ
کبوتر کہيں آشيانے سے دور
پھڑکتا ہوا جال ميں ناصبور
فريب نظر ہے سکون و ثبات
تڑپتا ہے ہر ذرئہ کائنات
ٹھہرتا نہيں کاروان وجود
کہ ہر لحظہ ہے تازہ شان وجود
سمجھتا ہے تو راز ہے زندگي
فقط ذوق پرواز ہے زندگي
بہت اس نے ديکھے ہيں پست و بلند
سفر اس کو منزل سے بڑھ کر پسند
سفر زندگي کے ليے برگ و ساز
سفر ہے حقيقت ، حضر ہے مجاز
الجھ کر سلجھنے ميں لذت اسے
تڑپنے پھٹرکنے ميں راحت اسے
ہوا جب اسے سامنا موت کا
کٹھن تھا بڑا تھامنا موت کا
اتر کر جہان مکافات ميں
رہي زندگي موت کي گھات ميں
مذاق دوئي سے بني زوج زوج
اٹھي دشت و کہسار سے فوج فوج
گل اس شاخ سے ٹوٹتے بھي رہے
اسي شاخ سے پھوٹتے بھي رہے
سمجھتے ہيں ناداں اسے بے ثبات
ابھرتا ہے مٹ مٹ کے نقش حيات
بڑي تيز جولاں ، بڑي زورد رس
ازل سے ابد تک رم يک نفس
زمانہ کہ زنجير ايام ہے
دموں کے الٹ پھير کا نام ہے
يہ موج نفس کيا ہے تلوار ہے
خودي کيا ہے ، تلوار کي دھار ہے
خودي کيا ہے ، راز درون حيات
خودي کيا ہے ، بيداري کائنات
خودي جلوہ بدمست و خلوت پسند
سمندر ہے اک بوند پاني ميں بند
اندھيرے اجالے ميں ہے تابناک
من و تو ميں پيدا ، من و تو سے پاک
ازل اس کے پيچھے ، ابد سامنے
نہ حد اس کے پيچھے ، نہ حد سامنے
زمانے کے دريا ميں بہتي ہوئي
ستم اس کي موجوں کے سہتي ہوئي
تجسس کي راہيں بدلتي ہوئي
وما دم نگاہيں بدلتي ہوئي
سبک اس کے ہاتھوں ميں سنگ گراں
پہاڑ اس کي ضربوں سے ريگ رواں
سفر اس کا انجام و آغاز ہے
يہي اس کي تقويم کا راز ہے
کرن چاند ميں ہے ، شرر سنگ ميں
يہ بے رنگ ہے ڈوب کر رنگ ميں
اسے واسطہ کيا کم و بيش سے
نشب و فراز وپس و پيش سے
ازل سے ہے يہ کشمکش ميں اسير
ہوئي خاک آدم ميں صورت پذير
خودي کا نشيمن ترے دل ميں ہے
فلک جس طرح آنکھ کے تل ميں ہے
خودي کے نگہباں کو ہے زہر ناب
وہ ناں جس سے جاتي رہے اس کي آب
وہي ناں ہے اس کے ليے ارجمند
رہے جس سے دنيا ميں گردن بلند
فرو فال محمود سے درگزر
خودي کو نگہ رکھ ، ايازي نہ کر
وہي سجدہ ہے لائق اہتمام
کہ ہو جس سے ہر سجدہ تجھ پر حرام
يہ عالم ، يہ ہنگامہء رنگ و صوت
يہ عالم کہ ہے زير فرمان موت
يہ عالم ، يہ بت خانہء چشم و گوش
جہاں زندگي ہے فقط خورد و نوش
خودي کي يہ ہے منزل اوليں
مسافر! يہ تيرا نشيمن نہيں
تري آگ اس خاک داں سے نہيں
جہاں تجھ سے ہے ، تو جہاں سے نہيں
بڑھے جا يہ کوہ گراں توڑ کر
طلسم زمان و مکاں توڑ کر
خودي شير مولا ، جہاں اس کا صيد
زميں اس کي صيد ، آسماں اس کا صيد
جہاں اور بھي ہيں ابھي بے نمود
کہ خالي نہيں ہے ضمير وجود
ہر اک منتظر تيري يلغار کا
تري شوخي فکر و کردار کا
يہ ہے مقصد گردش روزگار
کہ تيري خودي تجھ پہ ہو آشکار
تو ہے فاتح عالم خوب و زشت
تجھے کيا بتاؤں تري سرنوشت
حقيقت پہ ہے جامہء حرف تنگ
حقيقت ہے آئينہ ، گفتار زنگ
فروزاں ہے سينے ميں شمع نفس
!مگر تاب گفتار کہتي ہے ، بس
اگر يک سر موے برتر پرم
فروغ تجلي بسوزد پرم
جو تھا نہيں ہے ، جو ہے نہ ہو گا ، يہي ہے اک حرف محرمانہ
قريب تر ہے نمود جس کي ، اسي کا مشتاق ہے زمانہ
مري صراحي سے قطرہ قطرہ نئے حوادث ٹپک رہے ہيں
ميں اپني تسبيح روز و شب کا شمار کرتا ہوں دانہ دانہ
ہر ايک سے آشنا ہوں ، ليکن جدا جدا رسم و راہ ميري
کسي کا راکب ، کسي کا مرکب ، کسي کو عبرت کا تازيانہ
نہ تھا اگر تو شريک محفل ، قصور ميرا ہے يا کہ تيرا
مرا طريقہ نہيں کہ رکھ لوں کسي کي خاطر مےء شبانہ
مرے خم و پيچ کو نجومي کي آنکھ پہچانتي نہيں ہے
ہدف سے بيگانہ تيرا اس کا ، نظر نہيں جس کي عارفانہ
!شفق نہيں مغربي افق پر يہ جوئے خوں ہے ، يہ جوئے خوں ہے
طلوع فردا کا منتظر رہ کہ دوش و امروز ہے فسانہ
وہ فکر گستاخ جس نے عرياں کيا ہے فطرت کي طاقتوں کو
اس کي بيتاب بجليوں سے خطر ميں ہے اس کا آشيانہ
ہوائيں ان کي ، فضائيں ان کي ، سمندر ان کے ، جہاز ان کے
گرہ بھنور کي کھلے تو کيونکر ، بھنور ہے تقدير کا بہانہ
جہان نو ہو رہا ہے پيدا ، وہ عالم پير مر رہا ہے
جسے فرنگي مقامروں نے بنا ديا ہے قمار خانہ
ہوا ہے گو تند و تيز ليکن چراغ اپنا جلا رہا ہے
وہ مرد درويش جس کو حق نے ديے ہيں انداز خسروانہ
عطا ہوئي ہے تجھے روزوشب کي بيتابي
خبر نہيں کہ تو خاکي ہے يا کہ سيمابي
سنا ہے ، خاک سے تيري نمود ہے ، ليکن
تري سرشت ميں ہے کوکبي و مہ تابي
جمال اپنا اگر خواب ميں بھي تو ديکھے
ہزار ہوش سے خوشتر تري شکر خوابي
گراں بہا ہے ترا گريہء سحر گاہي
اسي سے ہے ترے نخل کہن کي شادابي
تري نوا سے ہے بے پردہ زندگي کا ضمير
کہ تيرے ساز کي فطرت نے کي ہے مضرابي
کھول آنکھ ، زميں ديکھ ، فلک ديکھ ، فضا ديکھ
مشرق سے ابھرتے ہوئے سورج کو ذرا ديکھ
اس جلوئہ بے پردہ کو پردوں ميں چھپا ديکھ
ايام جدائي کے ستم ديکھ ، جفا ديکھ
!بے تاب نہ ہو معرکہء بيم و رجا ديکھ
ہيں تيرے تصرف ميں يہ بادل ، يہ گھٹائيں
يہ گنبد افلاک ، يہ خاموش فضائيں
يہ کوہ يہ صحرا ، يہ سمندر يہ ہوائيں
تھيں پيش نظر کل تو فرشتوں کي ادائيں
!آئينہء ايام ميں آج اپني ادا ديکھ
سمجھے گا زمانہ تري آنکھوں کے اشارے
ديکھيں گے تجھے دور سے گردوں کے ستارے
ناپيد ترے بحر تخيل کے کنارے
پہنچيں گے فلک تک تري آہوں کے شرارے
!تعمير خودي کر ، اثر آہ رسا ديکھ
خورشيد جہاں تاب کي ضو تيرے شرر ميں
آباد ہے اک تازہ جہاں تيرے ہنر ميں
جچتے نہيں بخشے ہوئے فردوس نظر ميں
جنت تري پنہاں ہے ترے خون جگر ميں
!اے پيکر گل کوشش پيہم کي جزا ديکھ
نالندہ ترے عود کا ہر تار ازل سے
تو جنس محبت کا خريدار ازل سے
تو پير صنم خانہء اسرار ازل سے
محنت کش و خوں ريز و کم آزار ازل سے
مريد ہندي
چشم بينا سے ہے جاري جوئے خوں
!علم حاضر سے ہے ديں زار و زبوں
پيررومي
علم را بر تن زني مارے بود
علم را بر دل زني يارے بود
مريدہندي
!اے امام عاشقان دردمند
ياد ہے مجھ کو ترا حرف بلند
خشک مغز و خشک تار و خشک پوست
،از کجا مي آيد ايں آواز دوست
دور حاضر مست چنگ و بے سرور
بے ثبات و بے يقين و بے حضور
کيا خبر اس کو کہ ہے يہ راز کيا
دوست کيا ہے ، دوست کي آواز کيا
آہ ، يورپ با فروغ و تاب ناک
نغمہ اس کو کھينچتا ہے سوئے خاک
پير رومي
بر سماع راست ہر کس چير نيست
طعمہء ہر مرغکے انجير نيست
مريد ہندي
پڑھ ليے ميں نے علوم شرق و غرب
روح ميں باقي ہے اب تک درد و کرب
پير رومي
دست ہر نا اہل بيمارت کند
سوئے مادر آکہ تيمارت کند
مريدہندي
اے نگہ تيري مرے دل کي کشاد
کھول مجھ پر نکتہء حکم جہاد
پيررومي
نقش حق را ہم بہ امر حق شکن
بر زجاج دوست سنگ دوست زن
مريد ہندي
ہے نگاہ خاوراں مسحور غرب
حور جنت سے ہے خوشتر حور غرب
پيررومي
ظاہر نقرہ گر اسپيد است و نو
!دست و جامہ ہم سيہ گردو ازو
مريد ہندي
!آہ مکتب کا جوان گرم خوں
!ساحر افرنگ کا صيد زبوں
پيررومي
مرغ پر نارستہ چوں پراں شود
طعمہء ہر گربہء دراں شود
مريد ہندي
تا کجا آويزش دين و وطن
!جوہر جاں پر مقدم ہے بدن
پيررومي
قلب پہلو مي زندہ با زر بشب
انتظار روز مي دارد ذہب
مريدہندي
سر آدم سے مجھے آگاہ کر
!خاک کے ذرے کو مہر و ماہ کر
پيررومي
ظاہرش را پشہء آرد بچرخ
باطنش آمد محيط ہفت چرخ
مريد ہندي
خاک تيرے نور سے روشن بصر
غايت آدم خبر ہے يا نظر؟
پيررومي
آدمي ديد است ، باقي پوست است
ديد آں باشد کہ ديد دوست است
مريد ہندي
زندہ ہے مشرق تري گفتار سے
امتےں مرتي ہيں کس آزار سے؟
پير رومي
ہر ہلاک امت پيشيں کہ بود
زانکہ بر جندل گماں بردند عود
مريد ہندي
اب مسلماں ميں نہيں وہ رنگ و بو
سرد کيونکر ہو گيا اس کا لہو؟
پيررومي
تا دل صاحبدلے نامد بہ درد
ہيچ قومے را خدا رسوا نہ کرد
مريد ہندي
گرچہ بے رونق ہے بازار وجود
کون سے سودے ميں ہے مردوں کا سود؟
پيررومي
زيرکي بفروش و حيراني بخر
زيرکي ظن است و حيراني نظر
مريد ہندي
ہم نفس ميرے سلاطيں کے نديم
!ميں فقير بے کلاہ و بے گليم
پير رومي
بندئہ يک مرد روشن دل شوي
بہ کہ بر فرق سر شاہاں روي
مريد ہندي
اے شريک مستي خاصان بدر
!ميں نہيں سمجھا حديث جبر و قدر
پيررومي
بال بازاں را سوے سلطاں برد
بال زاغاں را بگورستاں برد
مريد ہندي
کاروبار خسروي يا راہبي
کيا ہے آخر غايت دين نبي ؟
پيررومي
مصلحت در دين ما جنگ و شکوہ
مصلحت در دين عيسي غار و کوہ
مريد ہندي
کس طرح قابو ميں آئے آب و گل
کس طرح بيدار ہو سينے ميں دل ؟
پيررومي
بندہ باش و بر زميں رو چوں سمند
چوں جنازہ نے کہ بر گردن برند
مريد ہندي
سر ديں ادراک ميں آتا نہيں
کس طرح آئے قيامت کا يقيں؟
پير رومي
پس قيامت شو قيامت را ببيں
ديدن ہر چيز را شرط است ايں
مريد ہندي
آسماں ميں راہ کرتي ہے خودي
صيد مہر و ماہ کرتي ہے خودي
بے حضور و با فروغ و بے فراغ
!اپنے نخچيروں کے ہاتھوں داغ داغ
پيررومي
آں کہ ارزد صيد را عشق است و بس
!ليکن او کے گنجد اندر دام کس
مريد ہندي
تجھ پہ روشن ہے ضمير کائنات
کس طرح محکم ہو ملت کي حيات؟
پير رومي
دانہ باشي مرغکانت برچنند
غنچہ باشي کود کانت برکنند
دانہ پنہاں کن سراپا دام شو
غنچہ پنہاں کن گياہ بام شو
مريد ہندي
تو يہ کہتا ہے کہ دل کي کر تلاش
طالب دل باش و در پيکار باش
جو مرا دل ہے ، مرے سينے ميں ہے
ميرا جوہر ميرے آئينے ميں ہے
پيررومي
تو ہمي گوئي مرا دل نيز ہست
دل فراز عرش باشد نے بہ پست
تو دل خود را دلے پنداشتي
جستجوے اہل دل بگذاشتي
مريد ہندي
آسمانوں پر مرا فکر بلند
ميں زميں پر خوار و زار و دردمند
کار دنيا ميں رہا جاتا ہوں ميں
ٹھوکريں اس راہ ميں کھاتا ہوں ميں
کيوں مرے بس کا نہيں کار زميں
ابلہ دنيا ہے کيوں دانائے ديں؟
پيررومي
آں کہ بر افلاک رفتارش بود
بر زميں رفتن چہ دشوارش بود
مريد ہندي
علم و حکمت کا ملے کيونکر سراغ
کس طرح ہاتھ آئے سوز و درد و داغ
پيررومي
علم و حکمت زايد نان حلال
عشق و رقت آيد از نان حلال
مريد ہندي
ہے زمانے کا تقاضا انجمن
!اور بے خلوت نہيں سوز سخن
پير رومي
خلوت از اغيار بايد ، نے ز يار
پوستيں بہر دے آمد ، نے بہار
مريد ہندي
ہند ميں اب نور ہے باقي نہ سوز
!اہل دل اس ديس ميں ہيں تيرہ روز
پير رومي
کار مرداں روشني و گرمي است
کار دوناں حيلہ و بے شرمي است
جبريل
ابليس
ہمدم ديرينہ! کيسا ہے جہان رنگ و بو؟
سوز و ساز و درد و داغ و جستجوے و آرزو
جبريل
ہر گھڑي افلاک پر رہتي ہے تيري گفتگو
کيا نہيں ممکن کہ تيرا چاک دامن ہو رفو؟
ابليس
آہ اے جبريل! تو واقف نہيں اس راز سے
کر گيا سرمست مجھ کو ٹوٹ کر ميرا سبو
اب يہاں ميري گزر ممکن نہيں ، ممکن نہيں
!کس قدر خاموش ہے يہ عالم بے کاخ و کو
جس کي نوميدي سے ہو سوز درون کائنات
اس کے حق ميں 'تقنطوا' اچھا ہے يا 'لاتقظوا'؟
جبريل
کھو ديے انکار سے تو نے مقامات بلند
!چشم يزداں ميں فرشتوں کي رہي کيا آبرو
ابليس
ہے مري جرأت سے مشت خاک ميں ذوق نمو
ميرے فتنے جامہء عقل و خرد کا تاروپو
ديکھتا ہے تو فقط ساحل سے رزم خير و شر
کون طوفاں کے طمانچے کھا رہا ہے ، ميں کہ تو؟
خضر بھي بے دست و پا ، الياس بھي بے دست و پا
ميرے طوفاں يم بہ يم ، دريا بہ دريا ، جو بہ جو
گر کبھي خلوت ميسر ہو تو پوچھ اللہ سے
!قصہء آدم کو رنگيں کر گيا کس کا لہو
ميں کھٹکتا ہوں دل يزداں ميں کانٹے کي طرح
تو فقط اللہ ھو ، اللہ ھو ، اللہ ھو
اک رات ستاروں سے کہا نجم سحر نے
آدم کو بھي ديکھا ہے کسي نے کبھي بيدار؟
کہنے لگا مريخ ، ادا فہم ہے تقدير
ہے نيند ہي اس چھوٹے سے فتنے کو سزاوار
زہرہ نے کہا ، اور کوئي بات نہيں کيا؟
!اس کرمک شب کور سے کيا ہم کو سروکار
بولا مہ کامل کہ وہ کوکب ہے زميني
تم شب کو نمودار ہو ، وہ دن کو نمودار
واقف ہو اگر لذت بيداري شب سے
اونچي ہے ثريا سے بھي يہ خاک پر اسرار
آغوش ميں اس کي وہ تجلي ہے کہ جس ميں
کھو جائيں گے افلاک کے سب ثابت و سيار
ناگاہ فضا بانگ اذاں سے ہوئي لبريز
!وہ نعرہ کہ ہل جاتا ہے جس سے دل کہسار
شہيد محبت نہ کافر نہ غازي
محبت کي رسميں نہ ترکي نہ تازي
وہ کچھ اور شے ہے ، محبت نہيں ہے
سکھاتي ہے جو غزنوي کو ايازي
يہ جوہر اگر کار فرما نہيں ہے
تو ہيں علم و حکمت فقط شيشہ بازي
نہ محتاج سلطاں ، نہ مرعوب سلطاں
محبت ہے آزادي و بے نيازي
مرا فقر بہتر ہے اسکندري سے
يہ آدم گري ہے ، وہ آئينہ سازي
مجھے ڈرا نہيں سکتي فضا کي تاريکي
مري سرشت ميں ہے پاکي و درخشاني
تو اے مسافر شب! خود چراغ بن اپنا
کر اپني رات کو داغ جگر سے نوراني
ديار عشق ميں اپنا مقام پيدا کر
نيا زمانہ ، نئے صبح و شام پيدا کر
خدا اگر دل فطرت شناس دے تجھ کو
سکوت لالہ و گل سے کلام پيدا کر
اٹھا نہ شيشہ گران فرنگ کے احساں
سفال ہند سے مينا و جام پيدا کر
ميں شاخ تاک ہوں ، ميري غزل ہے ميرا ثمر
مرے ثمر سے مےء لالہ فام پيدا کر
مرا طريق اميري نہيں ، فقيري ہے
!خودي نہ بيچ ، غريبي ميں نام پيدا کر
!يہ آفتاب کيا ، يہ سپہر بريں ہے کيا
سمجھ نہيں تسلسل شام و سحر کو ميں
اپنے وطن ميں ہوں کہ غريب الديار ہوں
ڈرت ہوں ديکھ ديکھ کے اس دشت و در کو ميں
کھلت نہيں مرے سفر زندگي کا راز
لاؤں کہاں سے بندئہ صاحب نظر کو ميں
حيراں ہے بوعلي کہ ميں آيا کہاں سے ہوں
رومي يہ سوچتا ہے کہ جاؤں کدھر کو ميں
جات ہوں تھوڑي دور ہر اک راہرو کے ساتھ ''
''پہچانت نہيں ہوں ابھي راہبر کو ميں
ہم خوگر محسوس ہيں ساحل کے خريدار
اک بحر پر آشوب و پر اسرار ہے رومي
تو بھي ہے اسي قافلہء شوق ميں اقبال
جس قافلہء شوق کا سالار ہے رومي
اس عصر کو بھي اس نے ديا ہے کوئي پيغام؟
کہتے ہيں چراغ رہ احرار ہے رومي
جواب
کہ نبايد خورد و جو ہمچوں خراں
آہوانہ در ختن چر ارغواں
ہر کہ کاہ و جو خورد قرباں شود
ہر کہ نور حق خورد قرآں شود
راز ہے ، راز ہے تقدير جہان تگ و تاز
جوش کردار سے کھل جاتے ہيں تقدير کے راز
جوش کردار سے شمشير سکندر کا طلوع
کوہ الوند ہوا جس کي حرارت سے گداز
جوش کردار سے تيمور کا سيل ہمہ گير
سيل کے سامنے کيا شے ہے نشيب اور فراز
صف جنگاہ ميں مردان خدا کي تکبير
جوش کردار سے بنتي ہے خدا کي آواز
ہے مگر فرصت کردار نفس يا دو نفس
!عوض يک دو نفس قبر کي شب ہائے دراز
عاقبت منزل ما وادي خاموشان است ''
''!حاليا غلغلہ در گنبد افلاک انداز
ندرت فکر و عمل کيا شے ہے ، ذوق انقلاب
ندرت فکر و عمل کيا شے ہے ، ملت کا شباب
ندرت فکر و عمل سے معجزات زندگي
ندرت فکر و عمل سے سنگ خارا لعل ناب
رومتہ الکبرے! دگرگوں ہوگيا تيرا ضمير
!اينکہ مي بينم بہ بيدار يست يارب يا بہ خواب
چشم پيران کہن ميں زندگاني کا فروغ
نوجواں تيرے ہيں سوز آرزو سے سينہ تاب
يہ محبت کي حرارت ، يہ تمنا ، يہ نمود
فصل گل ميں پھول رہ سکتے نہيں زير حجاب
نغمہ ہائے شوق سے تيري فضا معمور ہے
زخمہ ور کا منتظر تھا تيري فطرت کا رباب
فيض يہ کس کي نظر کا ہے ، کرامت کس کي ہے؟
!وہ کہ ہے حس کي نگہ مثل شعاع آفتاب
اک مفلس خود دار يہ کہتا تھا خدا سے
ميں کر نہيں سکتا گلہء درد فقيري
ليکن يہ بتا ، تيري اجازت سے فرشتے
کرتے ہيں عطا مرد فرومايہ کو ميري ؟
بتا کيا تري زندگي کا ہے راز
ہزاروں برس سے ہے تو خاک باز
اسي خاک ميں دب گئي تيري آگ
!سحر کي اذاں ہوگئي ، اب تو جاگ
زميں ميں ہے گو خاکيوں کي برات
نہيں اس اندھيرے ميں آب حيات
زمانے ميں جھوٹا ہے اس کا نگيں
جو اپني خودي کو پرکھتا نہيں
بتان شعوب و قبائل کو توڑ
رسوم کہن کے سلاسل کو توڑ
يہي دين محکم ، يہي فتح باب
کہ دنيا ميں توحيد ہو بے حجاب
بخاک بدن دانہء دل فشاں
کہ ايں دانہ داردز حاصل نشاں
حضور حق سے چلا لے کے لولوئے لالا
وہ ابر جس سے رگ گل ہے مثل تار نفس
بہشت راہ ميں ديکھا تو ہو گيا بيتاب
عجب مقام ہے ، جي چاہتا ہے جاؤں برس
صدا بہشت سے آئي کہ منتظر ہے ترا
ہرات و کابل و غزني کا سبزئہ نورس
سرشک ديدہ نادر بہ داغ لالہ فشاں
!چناں کہ آتش او را دگر فرونہ نشاں
قبائل ہوں ملت کي وحدت ميں گم
کہ ہو نام افغانيوں کا بلند
محبت مجھے ان جوانوں سے ہے
ستاروں پہ جو ڈالتے ہيں کمند
مغل سے کسي طرح کمتر نہيں
قہستاں کا يہ بچہء ارجمند
کہوں تجھ سے اے ہم نشيں دل کي بات
وہ مدفن ہے خوشحال خاں کو پسند
اڑا کر نہ لائے جہاں باد کوہ
!مغل شہسواروں کي گرد سمند
کہيں سجادہ و عمامہ رہزن
!کہيں ترسا بچوں کي چشم بے باک
ردائے دين و ملت پارہ پارہ
!قبائے ملک و دولت چاک در چاک
مرا ايماں تو ہے باقي وليکن
!نہ کھا جائے کہيں شعلے کو خاشاک
ہوائے تند کي موجوں ميں محصور
!سمرقند و بخارا کي کف خاک
بگرداگرد خود چندانکہ بينم '
'بلا انگشتري و من نگينم
يکايک ہل گئي خاک سمرقند
اٹھا تيمور کي تربت سے اک نور
شفق آميز تھي اس کي سفيدي
صدا آئي کہ ''ميں ہوں روح تيمور
اگر محصور ہيں مردان تاتار
نہيں اللہ کي تقدير محصور
تقاضا زندگي کا کيا يہي ہے
کہ توراني ہو توراني سے مہجور؟
خودي را سوز و تابے ديگرے دہ ''
''جہاں را انقلابے ديگرے دہ
دل زندہ و بيدار اگر ہو تو بتدريج
بندے کو عطا کرتے ہيں چشم نگراں اور
احوال و مقامات پہ موقوف ہے سب کچھ
ہر لحظہ ہے سالک کا زماں اور مکاں اور
الفاظ و معاني ميں تفاوت نہيں ليکن
ملا کي اذاں اور مجاہد کي اذاں اور
پرواز ہے دونوں کي اسي ايک فضا ميں
کرگس کا جہاں اور ہے ، شاہيں کا جہاں اور
کہتے ہيں کبھي گوشت نہ کھاتا تھا معري
پھل پھول پہ کرتا تھا ہميشہ گزر اوقات
اک دوست نے بھونا ہوا تيتر اسے بھيجا
شايد کہ وہ شاطر اسي ترکيب سے ہو مات
يہ خوان تر و تازہ معري نے جو ديکھا
کہنے لگا وہ صاحب غفران و لزومات
اے مرغک بيچارہ! ذرا يہ تو بتا تو
تيرا وہ گنہ کيا تھا يہ ہے جس کي مکافات؟
افسوس ، صد افسوس کہ شاہيں نہ بنا تو
ديکھے نہ تري آنکھ نے فطرت کے اشارات
تقدير کے قاضي کا يہ فتوي ہے ازل سے
!ہے جرم ضعيفي کي سزا مرگ مفاجات
وہي بت فروشي ، وہي بت گري ہے
سنيما ہے يا صنعت آزري ہے
وہ صنعت نہ تھي ، شيوئہ کافري تھا
يہ صنعت نہيں ، شيوئہ ساحري ہے
وہ مذہب تھا اقوام عہد کہن کا
يہ تہذيب حاضر کي سوداگري ہے
وہ دنيا کي مٹي ، يہ دوزخ کي مٹي
وہ بت خانہ خاکي ، يہ خاکستري ہے
حاضر ہوا ميں شيخ مجدد کي لحد پر
وہ خاک کہ ہے زير فلک مطلع انوار
اس خاک کے ذروں سے ہيں شرمندہ ستارے
اس خاک ميں پوشيدہ ہے وہ صاحب اسرار
گردن نہ جھکي جس کي جہانگير کے آگے
جس کے نفس گرم سے ہے گرمي احرار
وہ ہند ميں سرمايہء ملت کا نگہباں
اللہ نے بر وقت کيا جس کو خبردار
کي عرض يہ ميں نے کہ عطا فقر ہو مجھ کو
!آنکھيں مري بينا ہيں ، و ليکن نہيں بيدار
آئي يہ صدا سلسلہء فقر ہوا بند
ہيں اہل نظر کشور پنجاب سے بيزار
عارف کا ٹھکانا نہيں وہ خطہ کہ جس ميں
پيدا کلہ فقر سے ہو طرئہ دستار
باقي کلہ فقر سے تھا ولولہء حق
!'طروں نے چڑھايا نشہء 'خدمت سرکار
اس کھيل ميں تعيين مراتب ہے ضروري
شاطر کي عنايت سے تو فرزيں ، ميں پيادہ
بيچارہ پيادہ تو ہے اک مہرئہ ناچيز
!فرزيں سے بھي پوشيدہ ہے شاطر کا ارادہ
اک فقر سکھاتا ہے صےاد کو نخچيري
اک فقر سے کھلتے ہيں اسرار جہاں گيري
اک فقر سے قوموں ميں مسکيني و دلگيري
اک فقر سے مٹي ميں خاصيت اکسيري
اک فقر ہے شبےري ، اس فقر ميں ہے ميري
!ميراث مسلماني ، سرمايہء شبيري
خودي کو نہ دے سيم و زر کے عوض
نہيں شعلہ ديتے شرر کے عوض
يہ کہتا ہے فردوسي ديدہ ور
عجم جس کے سرمے سے روشن بصر
ز بہر درم تند و بدخو مباش ''
''تو بايد کہ باشي ، درم گو مباش
سورج بنتا ہے تار زر سے
دنيا کے ليے ردائے نوري
عالم ہے خموش و مست گويا
ہر شے کو نصيب ہے حضوري
دريا ، کہسار ، چاند تارے
کيا جانيں فراق و ناصبوري
شاياں ہے مجھے غم جدائي
يہ خاک ہے محرم جدائي
رمز و ايما اس زمانے کے ليے موزوں نہيں
اور آتا بھي نہيں مجھ کو سخن سازي کا فن
'قم باذن اللہ' کہہ سکتے تھے جو ، رخصت ہوئے
!خانقاہوں ميں مجاور رہ گئے يا گورکن
کہتا تھا عزازيل خداوند جہاں سے
!پرکالہء آتش ہوئي آدم کي کف خاک
جاں لاغر و تن فربہ و ملبوس بدن زيب
!دل نزع کي حالت ميں ، خرد پختہ و چالاک
ناپاک جسے کہتي تھي مشرق کي شريعت
!مغرب کے فقيہوں کا يہ فتوي ہے کہ ہے پاک
تجھ کو نہيں معلوم کہ حوران بہشتي
ويراني جنت کے تصور سے ہيں غم ناک؟
جمہور کے ابليس ہيں ارباب سياست
!باقي نہيں اب ميري ضرورت تہ افلاک
اگر لہو ہے بدن ميں تو خوف ہے نہ ہراس
اگر لہو ہے بدن ميں تو دل ہے بے وسواس
جسے ملا يہ متاع گراں بہا ، اس کو
نہ سيم و زر سے محبت ہے ، نے غم افلاس
کہا درخت نے اک روز مرغ صحرا سے
ستم پہ غم کدئہ رنگ و بو کي ہے بنياد
خدا مجھے بھي اگر بال و پر عطا کرتا
شگفتہ اور بھي ہوتا يہ عالم ايجاد
ديا جواب اسے خوب مرغ صحرا نے
!غضب ہے ، داد کو سمجھا ہوا ہے تو بيداد
جہاں ميں لذت پرواز حق نہيں اس کا
وجود جس کا نہيں جذب خاک سے آزاد
شيخ مکتب ہے اک عمارت گر
جس کي صنعت ہے روح انساني
نکتہء دلپذير تيرے ليے
کہہ گيا ہے حکيم قاآني
پيش خورشيد بر مکش ديوار ''
''خواہي ار صحن خانہ نوراني
بلند بال تھا ، ليکن نہ تھا جسور و غيور
حکيم سر محبت سے بے نصيب رہا
پھرا فضاؤں ميں کرگس اگرچہ شاہيں وار
شکار زندہ کي لذت سے بے نصيب رہا
کيا ميں نے اس خاک داں سے کنارا
جہاں رزق کا نام ہے آب و دانہ
بياباں کي خلوت خوش آتي ہے مجھ کو
ازل سے ہے فطرت مري راہبانہ
نہ باد بہاري ، نہ گلچيں ، نہ بلبل
نہ بيماري نغمہ عاشقانہ
خيابانيوں سے ہے پرہيز لازم
ادائيں ہيں ان کي بہت دلبرانہ
ہوائے بياباں سے ہوتي ہے کاري
جواں مرد کي ضربت غازيانہ
حمام و کبوتر کا بھوکا نہيں ميں
کہ ہے زندگي باز کي زاہدانہ
جھپٹنا ، پلٹنا ، پلٹ کر جھپٹنا
لہو گرم رکھنے کا ہے اک بہانہ
يہ پورب ، يہ پچھم چکوروں کي دنيا
مرا نيلگوں آسماں بيکرانہ
پرندوں کي دنيا کا درويش ہوں ميں
کہ شاہيں بناتا نہيں آشيانہ
ہم کو تو ميسر نہيں مٹي کا ديا بھي
گھر پير کا بجلي کے چراغوں سے ہے روشن
شہري ہو، دہاتي ہو، مسلمان ہے سادہ
مانند بتاں پجتے ہيں کعبے کے برہمن
نذرانہ نہيں ، سود ہے پيران حرم کا
ہر خرقہء سالوس کے اندر ہے مہاجن
ميراث ميں آئي ہے انھيں مسند ارشاد
!زاغوں کے تصرف ميں عقابوں کے نشيمن
ہاروں نے کہا وقت رحيل اپنے پسر سے
جائے گا کبھي تو بھي اسي راہ گزر سے
پوشيدہ ہے کافر کي نظر سے ملک الموت
ليکن نہيں پوشيدہ مسلماں کي نظر سے
جرات ہے تو افکار کي دنيا سے گزر جا
ہيں بحر خودي ميں ابھي پوشيدہ جزيرے
کھلتے نہيں اس قلزم خاموش کے اسرار
جب تک تو اسے ضرب کليمي سے نہ چيرے
تاک ميں بيٹھے ہيں مدت سے يہودي سودخوار
جن کي روباہي کے آگے ہيچ ہے زور پلنگ
خود بخود گرنے کو ہے پکے ہوئے پھل کي طرح
!ديکھيے پڑتا ہے آخر کس کي جھولي ميں فرنگ
جو دوني فطرت سے نہيں لائق پرواز
اس مرغک بيچارہ کا انجام ہے افتاد
ہر سينہ نشيمن نہيں جبريل اميں کا
ہر فکر نہيں طائر فردوس کا صےاد
اس قوم ميں ہے شوخي انديشہ خطرناک
جس قوم کے افراد ہوں ہر بند سے آزاد
گو فکر خدا داد سے روشن ہے زمانہ
آزادي افکار ہے ابليس کي ايجاد
شير
ساکنان دشت و صحرا ميں ہے تو سب سے الگ
کون ہيں تيرے اب و جد ، کس قبيلے سے ہے تو؟
خچر
ميرے ماموں کو نہيں پہچانتے شايد حضور
!وہ صبا رفتار ، شاہي اصطبل کي آبرو
چيونٹي
ميں پائمال و خوار و پريشان و دردمند
تيرا مقام کيوں ہے ستاروں سے بھي بلند؟
عقاب
تو رزق اپنا ڈھونڈتي ہے خاک راہ ميں
!ميں نہ سپہر کو نہيں لاتا نگاہ ميں
فطرت مري مانند نسيم سحري ہے
رفتار ہے ميري کبھي آہستہ ، کبھي تيز
پہناتا ہوں اطلس کي قبا لالہ و گل کو
کرتا ہوں سر خار کو سوزن کي طرح تيز
کل اپنے مريدوں سے کہا پير مغاں نے
قيمت ميں يہ معني ہے درناب سے دہ چند
زہراب ہے اس قوم کے حق ميں مےء افرنگ
جس قوم کے بچے نہيں خوددار و ہنرمند
يہ سحر جو کبھي فردا ہے کبھي ہے امروز
نہيں معلوم کہ ہوتي ہے کہاں سے پيدا
وہ سحر جس سے لرزتا ہے شبستان وجود
ہوتي ہے بندہ مومن کي اذاں سے پيدا
خودي کا سر نہاں لا الہ الا اللہ
خودي ہے تيغ، فساں لا الہ الا اللہ
يہ دور اپنے براہيم کي تلاش ميں ہے
صنم کدہ ہے جہاں، لا الہ الا اللہ
کيا ہے تو نے متاع غرور کا سودا
فريب سود و زياں ، لا الہ الا اللہ
يہ مال و دولت دنيا، يہ رشتہ و پيوند
بتان وہم و گماں، لا الہ الا اللہ
خرد ہوئي ہے زمان و مکاں کي زناري
نہ ہے زماں نہ مکاں، لا الہ الا اللہ
يہ نغمہ فصل گل و لالہ کا نہيں پابند
بہار ہو کہ خزاں، لا الہ الا اللہ
اگرچہ بت ہيں جماعت کي آستينوں ميں
مجھے ہے حکم اذاں، لا الہ الا اللہ
اسي قرآں ميں ہے اب ترک جہاں کي تعليم
جس نے مومن کو بنايا مہ و پرويں کا امير
'تن بہ تقدير' ہے آج ان کے عمل کا انداز
تھي نہاں جن کے ارادوں ميں خدا کي تقدير
تھا جو 'ناخوب، بتدريج وہي ' خوب' ہوا
کہ غلامي ميں بدل جاتا ہے قوموں کا ضمير
دے ولولہ شوق جسے لذت پرواز
کر سکتا ہے وہ ذرہ مہ و مہر کو تاراج
مشکل نہيں ياران چمن ! معرکہ باز
پر سوز اگر ہو نفس سينہ دراج
ناوک ہے مسلماں ، ہدف اس کا ہے ثريا
ہے سر سرا پردہ جاں نکتہ معراج
تو معني و النجم ، نہ سمجھا تو عجب کيا
ہے تيرا مد و جزر ابھي چاند کا محتاج
تو اپني خودي اگر نہ کھوتا
زناري برگساں نہ ہوتا
ہيگل کا صدف گہر سے خالي
ہے اس کا طلسم سب خيالي
محکم کيسے ہو زندگاني
!کس طرح خودي ہو لازماني
آدم کو ثبات کي طلب ہے
دستور حيات کي طلب ہے
دنيا کي عشا ہو جس سے اشراق
مومن کي اذاں ندائے آفاق
ميں اصل کا خاص سومناتي
آبا مرے لاتي و مناتي
تو سيد ہاشمي کي اولاد
ميري کف خاک برہمن زاد
ہے فلسفہ ميرے آب و گل ميں
پوشيدہ ہے ريشہ ہائے دل ميں
اقبال اگرچہ بے ہنر ہے
اس کي رگ رگ سے باخبر ہے
شعلہ ہے ترے جنوں کا بے سوز
سن مجھ سے يہ نکتہ دل افروز
انجام خرد ہے بے حضوري
ہے فلسفہ زندگي سے دوري
افکار کے نغمہ ہائے بے صوت
ہيں ذوق عمل کے واسطے موت
ديں مسلک زندگي کي تقويم
ديں سر محمد و براہيم
دل در سخن محمدي بند ''
''!اے پور علي ز بو علي چند
چوں ديدہ راہ بيں نداري ''
''قايد قرشي بہ از بخاري
ممکن ہے کہ تو جس کو سمجھتا ہے بہاراں
اوروں کي نگاہوں ميں وہ موسم ہو خزاں کا
ہے سلسلہ احوال کا ہر لحظہ دگرگوں
اے سالک رہ! فکر نہ کر سود و زياں کا
شايد کہ زميں ہے يہ کسي اور جہاں کي
!تو جس کو سمجھتا ہے فلک اپنے جہاں کا
اگرچہ زر بھي جہاں ميں ہے قاضي الحاجات
جو فقر سے ہے ميسر، تو نگري سے نہيں
اگر جواں ہوں مري قوم کے جسور و غيور
قلندري مري کچھ کم سکندري سے نہيں
سبب کچھ اور ہے، تو جس کو خود سمجھتا ہے
زوال بندہ مومن کا بے زري سے نہيں
اگر جہاں ميں مرا جوہر آشکار ہوا
قلندري سے ہوا ہے، تو نگري سے نہيں
علم نے مجھ سے کہا عشق ہے ديوانہ پن
عشق نے مجھ سے کہا علم ہے تخمين و ظن
بندہ تخمين و ظن! کرم کتابي نہ بن
!عشق سراپا حضور، علم سراپا حجاب
عشق کي گرمي سے ہے معرکہء کائنات
علم مقام صفات، عشق تماشائے ذات
عشق سکون و ثبات، عشق حيات و ممات
!علم ہے پيدا سوال، عشق ہے پنہاں جواب
عشق کے ہيں معجزات سلطنت و فقر و ديں
عشق کے ادني غلام صاحب تاج و نگيں
عشق مکان و مکيں، عشق زمان و زميں
!عشق سراپا يقيں، اور يقيں فتح باب
شرع محبت ميں ہے عشرت منزل حرام
شورش طوفاں حلال، لذت ساحل حرام
عشق پہ بجلي حلال، عشق پہ حاصل حرام
!علم ہے ابن الکتاب، عشق ہے ام الکتاب
ہند ميں حکمت ديں کوئي کہاں سے سيکھے
نہ کہيں لذت کردار، نہ افکار عميق
حلقہ شوق ميں وہ جرات انديشہ کہاں
!آہ محکومي و تقليد و زوال تحقيق
خود بدلتے نہيں، قرآں کو بدل ديتے ہيں
!ہوئے کس درجہ فقيہان حرم بے توفيق
ان غلاموں کا يہ مسلک ہے کہ ناقص ہے کتاب
!کہ سکھاتي نہيں مومن کو غلامي کے طريق
ميں بندہ ناداں ہوں، مگر شکر ہے تيرا
رکھتا ہوں نہاں خانہ لاہوت سے پيوند
اک ولولہ تازہ ديا ميں نے دلوں کو
لاہور سے تا خاک بخارا و سمرقند
تاثير ہے يہ ميرے نفس کي کہ خزاں ميں
مرغان سحر خواں مري صحبت ميں ہيں خورسند
ليکن مجھے پيدا کيا اس ديس ميں تو نے
!جس ديس کے بندے ہيں غلامي پہ رضا مند
يہ ہيں سب ايک ہي سالک کي جستجو کے مقام
'وہ جس کي شان ميں آيا ہے 'علم الاسما
مقام ذکر، کمالات رومي و عطار
مقام فکر، مقالات بوعليسينا
مقام فکر ہے پيمائش زمان و مکاں
مقام ذکر ہے سبحان ربي الاعلي
عجب نہيں کہ خدا تک تري رسائي ہو
تري نگہ سے ہے پوشيدہ آدمي کا مقام
تري نماز ميں باقي جلال ہے، نہ جمال
تري اذاں ميں نہيں ہے مري سحر کا پيام
نااہل کو حاصل ہے کبھي قوت و جبروت
ہے خوار زمانے ميں کبھي جوہر ذاتي
شايد کوئي منطق ہو نہاں اس کے عمل ميں
تقدير نہيں تابع منطق نظر آتي
ہاں، ايک حقيقت ہے کہ معلوم ہے سب کو
تاريخ امم جس کو نہيں ہم سے چھپاتي
ہر لحظہ ہے قوموں کے عمل پر نظر اس کي '
'!براں صفت تيغ دو پيکر نظر اس کي
زندہ قوت تھي جہاں ميں يہي توحيد کبھي
آج کيا ہے، فقط اک مسئلہء علم کلام
روشن اس ضو سے اگر ظلمت کردار نہ ہو
خود مسلماں سے ہے پوشيدہ مسلماں کا مقام
ميں نے اے مير سپہ! تيري سپہ ديکھي ہے
'قل ھو اللہ، کي شمشير سے خالي ہيں نيام
آہ! اس راز سے واقف ہے نہ ملا، نہ فقيہ
وحدت افکار کي بے وحدت کردار ہے خام
قوم کيا چيز ہے، قوموں کي امامت کيا ہے
!اس کو کيا سمجھيں يہ بيچارے دو رکعت کے امام
وہ علم اپنے بتوں کا ہے آپ ابراہيم
کيا ہے جس کو خدا نے دل و نظر کا نديم
زمانہ ايک ، حيات ايک ، کائنات بھي ايک
دليل کم نظري، قصہء جديد و قديم
چمن ميں تربيت غنچہ ہو نہيں سکتي
نہيں ہے قطرہ شبنم اگر شريک نسيم
وہ علم، کم بصري جس ميں ہمکنار نہيں
!تجليات کليم و مشاہدات حکيم
غدار وطن اس کو بتاتے ہيں برہمن
انگريز سمجھتا ہے مسلماں کو گداگر
پنجاب کے ارباب نبوت کي شريعت
کہتي ہے کہ يہ مومن پارينہ ہے کافر
آوازہ حق اٹھتا ہے کب اور کدھر سے
!'مسکيں ولکم ماندہ دريں کشمکش اندر'
سوچا بھي ہے اے مرد مسلماں کبھي تو نے
کيا چيز ہے فولاد کي شمشير جگردار
اس بيت کا يہ مصرع اول ہے کہ جس ميں
پوشيدہ چلے آتے ہيں توحيد کے اسرار
ہے فکر مجھے مصرع ثاني کي زيادہ
اللہ کرے تجھ کو عطا فقر کي تلوار
قبضے ميں يہ تلوار بھي آجائے تو مومن
يا خالد جانباز ہے يا حيدر کرار
فتوي ہے شيخ کا يہ زمانہ قلم کا ہے
دنيا ميں اب رہي نہيں تلوار کارگر
ليکن جناب شيخ کو معلوم کيا نہيں؟
مسجد ميں اب يہ وعظ ہے بے سود و بے اثر
تيغ و تفنگ دست مسلماں ميں ہے کہاں
ہو بھي، تو دل ہيں موت کي لذت سے بے خبر
کافر کي موت سے بھي لرزتا ہو جس کا دل
کہتا ہے کون اسے کہ مسلماں کي موت مر
تعليم اس کو چاہيے ترک جہاد کي
دنيا کو جس کے پنجہ خونيں سے ہو خطر
باطل کي فال و فر کي حفاظت کے واسطے
يورپ زرہ ميں ڈوب گيا دوش تا کمر
ہم پوچھتے ہيں شيخ کليسا نواز سے
مشرق ميں جنگ شر ہے تو مغرب ميں بھي ہے شر
حق سے اگر غرض ہے تو زيبا ہے کيا يہ بات
!اسلام کا محاسبہ، يورپ سے درگزر
اسکندر و چنگيز کے ہاتھوں سے جہاں ميں
سو بار ہوئي حضرت انساں کي قبا چاک
تاريخ امم کا يہ پيام ازلي ہے
'،صاحب نظراں! نشہ قوت ہے خطرناک
اس سيل سبک سير و زميں گير کے آگے
عقل و نظر و علم و ہنر ہيں خس و خاشاک
لا ديں ہو تو ہے زہر ہلاہل سے بھي بڑھ کر
ہو ديں کي حفاظت ميں تو ہر زہر کا ترياک
فقر جنگاہ ميں بے ساز و يراق آتا ہے
ضرب کاري ہے، اگر سينے ميں ہے قلب سليم
اس کي بڑھتي ہوئي بے باکي و بے تابي سے
تازہ ہر عہد ميں ہے قصہ فرعون و کليم
اب ترا دور بھي آنے کو ہے اے فقر غيور
کھا گئي روح فرنگي کو ہوائے زروسيم
عشق و مستي نے کيا ضبط نفس مجھ پہ حرام
کہ گرہ غنچے کي کھلتي نہيں بے موج نسيم
روح اسلام کي ہے نور خودي ، نار خودي
زندگاني کے ليے نار خودي نور و حضور
يہي ہر چيز کي تقويم ، يہي اصل نمود
گرچہ اس روح کو فطرت نے رکھا ہے مستور
لفظ 'اسلام' سے يورپ کو اگر کد ہے تو خير
!'دوسرا نام اسي دين کا ہے 'فقر غيور
زندگاني ہے صدف، قرہ نيساں ہے خودي
وہ صدف کيا کہ جو قطرے کو گہر کر نہ سکے
ہو اگر خودنگر و خودگر و خودگير خودي
يہ بھي ممکن ہے کہ تو موت سے بھي مر نہ سکے
کسے خبر کہ ہزاروں مقام رکھتا ہے
وہ فقر جس ميں ہے بے پردہ روح قرآني
خودي کو جب نظر آتي ہے قاہري اپني
يہي مقام ہے کہتے ہيں جس کو سلطاني
يہي مقام ہے مومن کي قوتوں کا عيار
اسي مقام سے آدم ہے ظل سبحاني
يہ جبر و قہر نہيں ہے ، يہ عشق و مستي ہے
کہ جبر و قہر سے ممکن نہيں جہاں باني
کيا گيا ہے غلامي ميں مبتلا تجھ کو
کہ تجھ سے ہو نہ سکي فقر کي نگہباني
مثال ماہ چمکتا تھا جس کا داغ سجود
خريد لي ہے فرنگي نے وہ مسلماني
ہوا حريف مہ و آفتاب تو جس سے
رہي نہ تيرے ستاروں ميں وہ درخشاني
تري نگاہ ميں ہے معجزات کي دنيا
مري نگاہ ميں ہے حادثات کي دنيا
تخيلات کي دنيا غريب ہے، ليکن
غريب تر ہے حيات و ممات کي دنيا
عجب نہيں کہ بدل دے اسے نگاہ تري
بلا رہي ہے تجھے ممکنات کي دنيا
(1)
ترا وجود سراپا تجلي افرنگ
کہ تو وہاں کے عمارت گروں کي ہے تعمير
مگر يہ پيکر خاکي خودي سے ہے خالي
!فقط نيام ہے تو، زرنگار و بے شمشير
(2)
تري نگاہ ميں ثابت نہيں خدا کا وجود
مري نگاہ ميں ثابت نہيں وجود ترا
وجود کيا ہے، فقط جوہر خودي کي نمود
کر اپني فکر کہ جوہر ہے بے نمود ترا
يہ حکمت ملکوتي، يہ علم لاہوتي
حرم کے درد کا درماں نہيں تو کچھ بھي نہيں
يہ ذکر نيم شبي ، يہ مراقبے ، يہ سرور
تري خودي کے نگہباں نہيں تو کچھ بھي نہيں
يہ عقل، جو مہ و پرويں کا کھيلتي ہے شکار
شريک شورش پنہاں نہيں تو کچھ بھي نہيں
خرد نے کہہ بھي ديا 'لاالہ' تو کيا حاصل
دل و نگاہ مسلماں نہيں تو کچھ بھي نہيں
عجب نہيں کہ پريشاں ہے گفتگو ميري
فروغ صبح پريشاں نہيں تو کچھ بھي نہيں
ہے زندہ فقط وحدت افکار سے ملت
وحدت ہو فنا جس سے وہ الہام بھي الحاد
وحدت کي حفاظت نہيں بے قوت بازو
آتي نہيں کچھ کام يہاں عقل خدا داد
اے مرد خدا! تجھ کو وہ قوت نہيں حاصل
جا بيٹھ کسي غار ميں اللہ کو کر ياد
مسکيني و محکومي و نوميدي جاويد
جس کا يہ تصوف ہو وہ اسلام کر ايجاد
ملا کو جو ہے ہند ميں سجدے کي اجازت
!ناداں يہ سمجھتا ہے کہ اسلام ہے آزاد
دل مردہ دل نہيں ہے،اسے زندہ کر دوبارہ
کہ يہي ہے امتوں کے مرض کہن کا چارہ
ترا بحر پر سکوں ہے، يہ سکوں ہے يا فسوں ہے؟
!نہ نہنگ ہے، نہ طوفاں، نہ خرابي کنارہ
تو ضمير آسماں سے ابھي آشنا نہيں ہے
نہيں بے قرار کرتا تجھے غمزہ ستارہ
ترے نيستاں ميں ڈالا مرے نغمہ سحر نے
مري خاک پے سپر ميں جو نہاں تھا اک شرارہ
نظر آئے گا اسي کو يہ جہان دوش و فردا
جسے آگئي ميسر مري شوخي نظارہ
مجھ کو بھي نظر آتي ہے يہ بوقلموني
وہ چاند، يہ تارا ہے، وہ پتھر، يہ نگيں ہے
ديتي ہے مري چشم بصيرت بھي يہ فتوي
وہ کوہ ، يہ دريا ہے ، وہ گردوں ، يہ زميں ہے
حق بات کو ليکن ميں چھپا کر نہيں رکھتا
!تو ہے، تجھے جو کچھ نظر آتا ہے، نہيں ہے
بدل کے بھيس پھر آتے ہيں ہر زمانے ميں
اگرچہ پير ہيں آدم، جواں ہيں لات و منات
يہ ايک سجدہ جسے تو گراں سمجھتا ہے
!ہزار سجدے سے ديتا ہے آدمي کو نجات
عقل بے مايہ امامت کي سزاوار نہيں
راہبر ہو ظن و تخميں تو زبوں کار حيات
فکر بے نور ترا، جذب عمل بے بنياد
سخت مشکل ہے کہ روشن ہو شب تار حيات
خوب و ناخوب عمل کي ہو گرہ وا کيونکر
!گر حيات آپ نہ ہو شارح اسرار حيات
مجاہدانہ حرارت رہي نہ صوفي ميں
بہانہ بے عملي کا بني شراب الست
فقيہ شہر بھي رہبانيت پہ ہے مجبور
کہ معرکے ہيں شريعت کے جنگ دست بدست
گريز کشمکش زندگي سے، مردوں کي
!اگر شکست نہيں ہے تو اور کيا ہے شکست
ہر خاکي و نوري پہ حکومت ہے خرد کي
باہر نہيں کچھ عقل خدا داد کي زد سے
عالم ہے غلام اس کے جلال ازلي کا
اک دل ہے کہ ہر لحظہ الجھتا ہے خرد سے
صوفي کي طريقت ميں فقط مستي احوال
ملا کي شريعت ميں فقط مستي گفتار
شاعر کي نوا مردہ و افسردہ و بے ذوق
افکار ميں سرمست، نہ خوابيدہ نہ بيدار
وہ مرد مجاہد نظر آتا نہيں مجھ کو
ہو جس کے رگ و پے ميں فقط مستي کردار
مرقد کا شبستاں بھي اسے راس نہ آيا
آرام قلندر کو تہ خاک نہيں ہے
خاموشي افلاک تو ہے قبر ميں ليکن
بے قيدي و پہنائي افلاک نہيں ہے
کہتا ہے زمانے سے يہ درويش جواں مرد
!جاتا ہے جدھر بندئہ حق، تو بھي ادھر جا
ہنگامے ہيں ميرے تري طاقت سے زيادہ
بچتا ہوا بنگاہ قلندر سے گزر جا
ميں کشتي و ملاح کا محتاج نہ ہوں گا
چڑھتا ہوا دريا ہے اگر تو تو اتر جا
توڑا نہيں جادو مري تکبير نے تيرا؟
!ہے تجھ ميں مکر جانے کي جرات تو مکر جا
مہر و مہ و انجم کا محاسب ہے قلندر
ايام کا مرکب نہيں، راکب ہے قلندر
افکار جوانوں کے خفي ہوں کہ جلي ہوں
پوشيدہ نہيں مرد قلندر کي نظر سے
معلوم ہيں مجھ کو ترے احوال کہ ميں بھي
مدت ہوئي گزرا تھا اسي راہ گزر سے
الفاظ کے پيچوں ميں الجھتے نہيں دانا
!غواص کو مطلب ہے صدف سے کہ گہر سے
پيدا ہے فقط حلقہ ارباب جنوں ميں
وہ عقل کہ پا جاتي ہے شعلے کو شرر سے
جس معني پيچيدہ کي تصديق کرے دل
قيمت ميں بہت بڑھ کے ہے تابندہ گہر سے
يا مردہ ہے يا نزع کي حالت ميں گرفتار
جو فلسفہ لکھا نہ گيا خون جگر سے
وہي ہے بندئہ حر جس کي ضرب ہے کاري
نہ وہ کہ حرب ہے جس کي تمام عياري
ازل سے فطرت احرار ميں ہيں دوش بدوش
قلندري و قبا پوشي و کلہ داري
زمانہ لے کے جسے آفتاب کرتا ہے
انھي کي خاک ميں پوشيدہ ہے وہ چنگاري
وجود انھي کا طواف بتاں سے ہے آزاد
!يہ تيرے مومن و کافر ، تمام زناري
کل ساحل دريا پہ کہا مجھ سے خضر نے
تو ڈھونڈ رہا ہے سم افرنگ کا ترياق؟
اک نکتہ مرے پاس ہے شمشير کي مانند
برندہ و صيقل زدہ و روشن و براق
کافر کي يہ پہچان کہ آفاق ميں گم ہے
!مومن کي يہ پہچان کہ گم اس ميں ہيں آفاق
سب اپنے بنائے ہوئے زنداں ميں ہيں محبوس
خاور کے ثوابت ہوں کہ افرنگ کے سيار
پيران کليسا ہوں کہ شيخان حرم ہوں
نے جدت گفتار ہے، نے جدت کردار
ہيں اہل سياست کے وہي کہنہ خم و پيچ
شاعر اسي افلاس تخيل ميں گرفتار
دنيا کو ہے اس مہدي برحق کي ضرورت
ہو جس کي نگہ زلزلہ عالم افکار
(دنيا ميں)
ہو حلقہ ياراں تو بريشم کي طرح نرم
رزم حق و باطل ہو تو فولاد ہے مومن
افلاک سے ہے اس کي حريفانہ کشاکش
خاکي ہے مگر خاک سے آزاد ہے مومن
جچتے نہيں کنجشک و حمام اس کي نظر ميں
جبريل و سرافيل کا صياد ہے مومن
(جنت ميں)
کہتے ہيں فرشتے کہ دل آويز ہے مومن
حوروں کو شکايت ہے کم آميز ہے مومن
تھي خوب حضور علما باب کي تقرير
بيچارہ غلط پڑھتا تھا اعراب سموات
اس کي غلطي پر علما تھے متبسم
بولا ، تمہيں معلوم نہيں ميرے مقامات
اب ميري امامت کے تصدق ميں ہيں آزاد
!محبوس تھے اعراب ميں قرآن کے آيات
ابليس
اے خدائے کن فکاں! مجھ کو نہ تھا آدم سے بير
آہ ! وہ زنداني نزديک و دور و دير و زود
حرف 'استکبار' تيرے سامنے ممکن نہ تھا
ہاں، مگر تيري مشيت ميں نہ تھا ميرا سجود
يزداں
ابليس
کب کھلا تجھ پر يہ راز، انکار سے پہلے کہ بعد؟
!بعد ! اے تيري تجلي سے کمالات وجود
يزداں (فرشتوں کي طرف ديکھ کر)
پستي فطرت نے سکھلائي ہے يہ حجت اسے
،کہتا ہے 'تيري مشيت ميں نہ تھا ميرا سجود
دے رہا ہے اپني آزادي کو مجبوري کا نام
!ظالم اپنے شعلہ سوزاں کو خود کہتا ہے دود
شيرازہ ہوا ملت مرحوم کا ابتر
!اب تو ہي بتا، تيرا مسلمان کدھر جائے
وہ لذت آشوب نہيں بحر عرب ميں
پوشيدہ جو ہے مجھ ميں، وہ طوفان کدھر جائے
ہر چند ہے بے قافلہ و راحلہ و زاد
اس کوہ و بياباں سے حدي خوان کدھر جائے
اس راز کو اب فاش کر اے روح محمد
!آيات الہي کا نگہبان کدھر جائے
بتاؤں تجھ کو مسلماں کي زندگي کيا ہے
يہ ہے نہايت انديشہ و کمال جنوں
طلوع ہے صفت آفتاب اس کا غروب
!يگانہ اور مثال زمانہ گونا گوں
نہ اس ميں عصر رواں کي حيا سے بيزاري
نہ اس ميں عہد کہن کے فسانہ و افسوں
حقائق ابدي پر اساس ہے اس کي
!يہ زندگي ہے، نہيں ہے طلسم افلاطوں
عناصر اس کے ہيں روح القدس کا ذوق جمال
!عجم کا حسن طبيعت ، عرب کا سوز دروں
تو نے پوچھي ہے امامت کي حقيقت مجھ سے
حق تجھے ميري طرح صاحب اسرار کرے
ہے وہي تيرے زمانے کا امام برحق
جو تجھے حاضر و موجود سے بيزار کرے
موت کے آئنے ميں تجھ کو دکھا کر رخ دوست
زندگي تيرے ليے اور بھي دشوار کرے
دے کے احساس زياں تيرا لہو گرما دے
فقر کي سان چڑھا کر تجھے تلوار کرے
فتنہ ملت بيضا ہے امامت اس کي
جو مسلماں کو سلاطيں کا پرستار کرے
کچھ اور چيز ہے شايد تري مسلماني
تري نگاہ ميں ہے ايک ، فقر و رہباني
سکوں پرستي راہب سے فقر ہے بيزار
فقير کا ہے سفينہ ہميشہ طوفاني
پسند روح و بدن کي ہے وا نمود اس کو
کہ ہے نہايت مومن خودي کي عرياني
وجود صيرفي کائنات ہے اس کا
اسے خبر ہے، يہ باقي ہے اور وہ فاني
اسي سے پوچھ کہ پيش نگاہ ہے جو کچھ
جہاں ہے يا کہ فقط رنگ و بو کي طغياني
يہ فقر مرد مسلماں نے کھو ديا جب سے
رہي نہ دولت سلماني و سليماني
تيري متاع حيات، علم و ہنر کا سرور
!ميري متاع حيات ايک دل ناصبور
معجزہ اہل فکر، فلسفہء پيچ پيچ
معجزہ اہل ذکر، موسي و فرعون و طور
مصلحتاً کہہ ديا ميں نے مسلماں تجھے
تيرے نفس ميں نہيں، گرمي يوم النشور
ايک زمانے سے ہے چاک گريباں مرا
تو ہے ابھي ہوش ميں، ميرے جنوں کا قصور
فيض نظر کے ليے ضبط سخن چاہيے
حرف پريشاں نہ کہہ اہل نظر کے حضور
خوار جہاں ميں کبھي ہو نہيں سکتي وہ قوم
عشق ہو جس کا جسور ، فقر ہو جس کا غيور
ہر شاخ سے يہ نکتہ پيچيدہ ہے پيدا
پودوں کو بھي احساس ہے پہنائے فضا کا
ظلمت کدئہ خاک پہ شاکر نہيں رہتا
ہر لحظہ ہے دانے کو جنوں نشوونما کا
فطرت کے تقاضوں پہ نہ کر راہ عمل بند
مقصود ہے کچھ اور ہي تسليم و رضا کا
جرات ہو نمو کي تو فضا تنگ نہيں ہے
اے مرد خدا، ملک خدا تنگ نہيں ہے
بياں ميں نکتہ توحيد آ تو سکتا ہے
ترے دماغ ميں بت خانہ ہو تو کيا کہيے
وہ رمز شوق کہ پوشيدہ لاالہ ميں ہے
طريق شيخ فقيہانہ ہو تو کيا کہيے
سرور جو حق و باطل کي کارزار ميں ہے
تو حرب و ضرب سے بيگانہ ہو تو کيا کہيے
جہاں ميں بندہ حر کے مشاہدات ہيں کيا
تري نگاہ غلامانہ ہو تو کيا کہيے
مقام فقر ہے کتنا بلند شاہي سے
!روش کسي کي گدايانہ ہو تو کيا کہيے
ہو بندۂ آزاد اگر صاحبِ الہام
ہے اس کی نگہ فکر و عمل کے لیے مہمیز
اس کے نفسِ گرم کی تاثیر ہے ایسی
ہو جاتی ہے خاکِ چمنستان شرر آمیز
شاہیں کی ادا ہوتی ہے بلبل میں نمودار
کس درجہ بدل جاتے ہیں مرغانِ سحر خیز
اس مرد خود آگاہ خدا مست کی صحبت
دیتی ہے گداؤں کو شکوہِ جم و پرویز
محکوم کے الہام سے اللہ بچائے
غارتِ گر اقوام ہے وہ صورتِ چنگیز
عقل مدت سے ہے اس پيچاک ميں الجھي ہوئي
روح کس جوہر سے، خاک تيرہ کس جوہر سے ہے
ميري مشکل، مستي و شور و سرور و درد و داغ
تيري مشکل، مے سے ہے ساغر کہ مے ساغر سے ہے
ارتباط حرف و معني، اختلاط جان و تن
!جس طرح اخگر قبا پوش اپني خاکستر سے ہے
نظر اللہ پہ رکھتا ہے مسلمان غيور
موت کيا شے ہے، فقط عالم معني کا سفر
ان شہيدوں کي ديت اہل کليسا سے نہ مانگ
قدر و قيمت ميں ہے خوں جن کا حرم سے بڑھ کر
آہ! اے مرد مسلماں تجھے کيا ياد نہيں
'حرف 'لا تدع مع اللہ الھاً آخر
ميں نہ عارف ، نہ مجدد، نہ محدث ،نہ فقيہ
مجھ کو معلوم نہيں کيا ہے نبوت کا مقام
ہاں، مگر عالم اسلام پہ رکھتا ہوں نظر
فاش ہے مجھ پہ ضمير فلک نيلي فام
عصر حاضر کي شب تار ميں ديکھي ميں نے
يہ حقيقت کہ ہے روشن صفت ماہ تمام
وہ نبوت ہے مسلماں کے ليے برگ حشيش ''
''جس نبوت ميں نہيں قوت و شوکت کا پيام
طلسم بود و عدم، جس کا نام ہے آدم
خدا کا راز ہے، قادر نہيں ہے جس پہ سخن
زمانہ صبح ازل سے رہا ہے محو سفر
مگر يہ اس کي تگ و دو سے ہو سکا نہ کہن
اگر نہ ہو تجھے الجھن تو کھول کر کہہ دوں
'!وجود حضرت انساں نہ روح ہے نہ بدن'
اس دور ميں اقوام کي صحبت بھي ہوئي عام
پوشيدہ نگاہوں سے رہي وحدت آدم
تفريق ملل حکمت افرنگ کا مقصود
اسلام کا مقصود فقط ملت آدم
مکے نے ديا خاک جنيوا کو يہ پيغام
!جمعيت اقوام کہ جمعيت آدم
اے پير حرم! رسم و رہ خانقہي چھوڑ
مقصود سمجھ ميري نوائے سحري کا
!اللہ رکھے تيرے جوانوں کو سلامت
دے ان کو سبق خود شکني ، خود نگري کا
تو ان کو سکھا خارا شگافي کے طريقے
مغرب نے سکھايا انھيں فن شيشہ گري کا
دل توڑ گئي ان کا دو صديوں کي غلامي
دارو کوئي سوچ ان کي پريشاں نظري کا
کہہ جاتا ہوں ميں زور جنوں ميں ترے اسرار
!مجھ کو بھي صلہ دے مري آشفتہ سري کا
قوموں کي حيات ان کے تخيل پہ ہے موقوف
يہ ذوق سکھاتا ہے ادب مرغ چمن کو
مجذوب فرنگي نے بہ انداز فرنگي
مہدي کے تخيل سے کيا زندہ وطن کو
اے وہ کہ تو مہدي کے تخيل سے ہے بيزار
نوميد نہ کر آہوئے مشکيں سے ختن کو
ہو زندہ کفن پوش تو ميت اسے سمجھيں
يا چاک کريں مردک ناداں کے کفن کو؟
ہرلحظہ ہے مومن کي نئي شان، نئي آن
!گفتار ميں، کردار ميں، اللہ کي برہان
قہاري و غفاري و قدوسي و جبروت
يہ چار عناصر ہوں تو بنتا ہے مسلمان
ہمسايہء جبريل اميں بندئہ خاکي
ہے اس کا نشيمن نہ بخارا نہ بدخشان
يہ راز کسي کو نہيں معلوم کہ مومن
!قاري نظر آتا ہے ، حقيقت ميں ہے قرآن
قدرت کے مقاصد کا عيار اس کے ارادے
دنيا ميں بھي ميزان، قيامت ميں بھي ميزان
جس سے جگر لالہ ميں ٹھنڈک ہو، وہ شبنم
درياؤں کے دل جس سے دہل جائيں، وہ طوفان
فطرت کا سرود ازلي اس کے شب و روز
آہنگ ميں يکتا صفت سورئہ رحمن
بنتے ہيں مري کارگہ فکر ميں انجم
لے اپنے مقدر کے ستارے کو تو پہچان
مذہب ميں بہت تازہ پسند اس کي طبيعت
کر لے کہيں منزل تو گزرتا ہے بہت جلد
تحقيق کي بازي ہو تو شرکت نہيں کرتا
ہو کھيل مريدي کا تو ہرتا ہے بہت جلد
تاويل کا پھندا کوئي صياد لگا دے
يہ شاخ نشيمن سے اترتا ہے بہت جلد
ہے کس کي يہ جرات کہ مسلمان کو ٹوکے
حريت افکار کي نعمت ہے خدا داد
چاہے تو کرے کعبے کو آتش کدہ پارس
چاہے تو کرے اس ميں فرنگي صنم آباد
قرآن کو بازيچہ تاويل بنا کر
چاہے تو خود اک تازہ شريعت کرے ايجاد
ہے مملکت ہند ميں اک طرفہ تماشا
اسلام ہے محبوس ، مسلمان ہے آزاد
ضمير اس مدنيت کا ديں سے ہے خالي
فرنگيوں ميں اخوت کا ہے نسب پہ قيام
بلند تر نہيں انگريز کي نگاہوں ميں
قبول دين مسيحي سے برہمن کا مقام
اگر قبول کرے، دين مصطفي ، انگريز
سياہ روز مسلماں رہے گا پھر بھي غلام
فضائے نور ميں کرتا نہ شاخ و برگ و بر پيدا
سفر خاکي شبستاں سے نہ کر سکتا اگر دانہ
'نہاد زندگي ميں ابتدا 'لا' ، انتہا 'الا
پيام موت ہے جب 'لا ہوا الا' سے بيگانہ
وہ ملت روح جس کي 'لا 'سے آگے بڑھ نہيں سکتي
يقيں جانو، ہوا لبريز اس ملت کا پيمانہ
کرے يہ کافر ہندي بھي جرات گفتار
!اگر نہ ہو امرائے عرب کي بے ادبي
يہ نکتہ پہلے سکھايا گيا کس امت کو؟
!وصال مصطفوي ، افتراق بولہبي
نہيں وجود حدود و ثغور سے اس کا
محمد عربي سے ہے عالم عربي
!پابندي تقدير کہ پابندي احکام
يہ مسئلہ مشکل نہيں اے مرد خرد مند
اک آن ميں سو بار بدل جاتي ہے تقدير
ہے اس کا مقلد ابھي ناخوش ، ابھي خورسند
تقدير کے پابند نباتات و جمادات
مومن فقط احکام الہي کا ہے پابند
لحد ميں بھي يہي غيب و حضور رہتا ہے
اگر ہو زندہ تو دل ناصبور رہتا ہے
مہ و ستارہ ، مثال شرارہ يک دو نفس
مے خودي کا ابد تک سرور رہتا ہے
فرشتہ موت کا چھوتا ہے گو بدن تيرا
!ترے وجود کے مرکز سے دور رہتا ہے
جہاں اگرچہ دگر گوں ہے ، قم باذن اللہ
وہي زميں ، وہي گردوں ہے ، قم باذن اللہ
کيا نوائے 'اناالحق' کو آتشيں جس نے
تري رگوں ميں وہي خوں ہے ، قم باذن اللہ
غميں نہ ہو کہ پراگندہ ہے شعور ترا
فرنگيوں کا يہ افسوں ہے ، قم باذن اللہ
سپنوزا
نظر حيات پہ رکھتا ہے مرد دانش مند
حيات کيا ہے ، حضور و سرور و نور و وجود
فلاطوں
نگاہ موت پہ رکھتا ہے مرد دانش مند
حيات ہے شب تاريک ميں شرر کي نمود
حيات و موت نہيں التفات کے لائق
فقط خودي ہے خودي کي نگاہ کا مقصود
'عشق ناپيد و خرد ميگزدش صورت مار'
عقل کو تابع فرمان نظر کر نہ سکا
ڈھونڈنے والا ستاروں کي گزرگاہوں کا
اپنے افکار کي دنيا ميں سفر کر نہ سکا
اپني حکمت کے خم و پيچ ميں الجھا ايسا
آج تک فيصلہ نفع و ضرر کر نہ سکا
جس نے سورج کي شعاعوں کو گرفتار کيا
!زندگي کي شب تاريک سحر کر نہ سکا
نظر آتے نہيں بے پردہ حقائق ان کو
آنکھ جن کي ہوئي محکومي و تقليد سے کور
زندہ کر سکتي ہے ايران و عرب کو کيونکر
!يہ فرنگي مدنےت کہ جو ہے خود لب گور
نظر سپہر پہ رکھتا ہے جو ستارہ شناس
نہيں ہے اپني خودي کے مقام سے آگاہ
خودي کو جس نے فلک سے بلند تر ديکھا
وہي ہے مملکت صبح و شام سے آگاہ
وہي نگاہ کے ناخوب و خوب سے محرم
وہي ہے دل کے حلال و حرام سے آگاہ
ميں ہوں نوميد تيرے ساقيان سامري فن سے
کہ بزم خاوراں ميں لے کے آئے ساتگيں خالي
نئي بجلي کہاں ان بادلوں کے جيب و دامن ميں
!پراني بجليوں سے بھي ہے جن کي آستيں خالي
فساد قلب و نظر ہے فرنگ کي تہذيب
کہ روح اس مدنيت کي رہ سکي نہ عفيف
رہے نہ روح ميں پاکيزگي تو ہے ناپيد
ضمير پاک و خيال بلند و ذوق لطيف
اس قوم کو شمشير کي حاجت نہيں رہتي
ہو جس کے جوانوں کي خودي صورت فولاد
ناچيز جہان مہ و پرويں ترے آگے
وہ عالم مجبور ہے ، تو عالم آزاد
موجوں کي تپش کيا ہے ، فقط ذوق طلب ہے
پنہاں جو صدف ميں ہے ، وہ دولت ہے خدا داد
شاہيں کبھي پرواز سے تھک کر نہيں گرتا
پر دم ہے اگر تو تو نہيں خطرہ افتاد
تو رہ نورد شوق ہے ، منزل نہ کر قبول
ليلي بھي ہم نشيں ہو تو محمل نہ کر قبول
اے جوئے آب بڑھ کے ہو دريائے تند و تيز
ساحل تجھے عطا ہو تو ساحل نہ کر قبول
کھويا نہ جا صنم کدہ کائنات ميں
محفل گداز ! گرمي محفل نہ کر قبول
صبح ازل يہ مجھ سے کہا جبرئيل نے
جو عقل کا غلام ہو ، وہ دل نہ کر قبول
باطل دوئي پسند ہے ، حق لا شريک ہے
!شرکت ميانہ حق و باطل نہ کر قبول
نہ ميں اعجمي نہ ہندي ، نہ عراقي و حجازي
کہ خودي سے ميں نے سيکھي دوجہاں سے بے نيازي
تو مري نظر ميں کافر ، ميں تري نظر ميں کافر
ترا ديں نفس شماري ، مرا ديں نفس گدازي
تو بدل گيا تو بہتر کہ بدل گئي شريعت
کہ موافق تدرواں نہيں دين شاہبازي
ترے دشت و در ميں مجھ کو وہ جنوں نظر نہ آيا
کہ سکھا سکے خرد کو رہ و رسم کارسازي
نہ جدا رہے نوا گر تب و تاب زندگي سے
کہ ہلاکي امم ہے يہ طريق نے نوازي
جس بندئہ حق بيں کي خودي ہوگئي بيدار
شمشير کي مانند ہے برندہ و براق
اس کي نگہ شوخ پہ ہوتي ہے نمودار
ہر ذرے ميں پوشيدہ ہے جو قوت اشراق
اس مرد خدا سے کوئي نسبت نہيں تجھ کو
تو بندئہ آفاق ہے ، وہ صاحب آفاق
تجھ ميں ابھي پيدا نہيں ساحل کي طلب بھي
وہ پاکي فطرت سے ہوا محرم اعماق
خودي کي پرورش و تربيت پہ ہے موقوف
کہ مشت خاک ميں پيدا ہو آتش ہمہ سوز
يہي ہے سر کليمي ہر اک زمانے ميں
!ہوائے دشت و شعيب و شباني شب و روز
آزادي افکار سے ہے ان کي تباہي
رکھتے نہيں جو فکر و تدبر کا سليقہ
ہو فکر اگر خام تو آزادي افکار
!انسان کو حيوان بنانے کا طريقہ
خودي ہو زندہ تو ہے فقر بھي شہنشاہي
نہيں ہے سنجر و طغرل سے کم شکوہ فقير
خودي ہو زندہ تو دريائے بے کراں پاياب
خودي ہو زندہ تو کہسار پر نيان و حرير
نہنگ زندہ ہے اپنے محيط ميں آزاد
!نہنگ مردہ کو موج سراب بھي زنجير
ہے مريدوں کو تو حق بات گوارا ليکن
شيخ و ملا کو بري لگتي ہے درويش کي بات
قوم کے ہاتھ سے جاتا ہے متاع کردار
بحث ميں آتا ہے جب فلسفہ ذات و صفات
گرچہ اس دير کہن کا ہے يہ دستور قديم
کہ نہيں مے کدہ و ساقي و مينا کو ثبات
قسمت بادہ مگر حق ہے اسي ملت کا
!انگبيں جس کے جوانوں کو ہے تلخاب حيات
اقبال! يہاں نام نہ لے علم خودي کا
موزوں نہيں مکتب کے ليے ايسے مقالات
بہتر ہے کہ بيچارے ممولوں کي نظر سے
پوشيدہ رہيں باز کے احوال و مقامات
آزاد کي اک آن ہے محکوم کا اک سال
!کس درجہ گراں سير ہيں محکوم کے اوقات
آزاد کا ہر لحظہ پيام ابديت
محکوم کا ہر لحظہ نئي مرگ مفاجات
آزاد کا انديشہ حقيقت سے منور
محکوم کا انديشہ گرفتار خرافات
محکوم کو پيروں کي کرامات کا سودا
ہے بندہ آزاد خود اک زندہ کرامات
محکوم کے حق ميں ہے يہي تربيت اچھي
!موسيقي و صورت گري و علم نباتات
زندگي کچھ اور شے ہے ، علم ہے کچھ اور شے
زندگي سوز جگر ہے ، علم ہے سوز دماغ
علم ميں دولت بھي ہے ، قدرت بھي ہے ، لذت بھي ہے
ايک مشکل ہے کہ ہاتھ آتا نہيں اپنا سراغ
اہل دانش عام ہيں ، کم ياب ہيں اہل نظر
!کيا تعجب ہے کہ خالي رہ گيا تيرا اياغ
شيخ مکتب کے طريقوں سے کشاد دل کہاں
!کس طرح کبريت سے روشن ہو بجلي کا چراغ
ستارگان فضاہائے نيلگوں کي طرح
تخيلات بھي ہيں تابع طلوع و غروب
جہاں خودي کا بھي ہے صاحب فراز و نشيب
يہاں بھي معرکہ آرا ہے خوب سے ناخوب
نمود جس کي فراز خودي سے ہو ، وہ جميل
!جو ہو نشيب ميں پيدا ، قبيح و نامحبوب
خودي کي موت سے مغرب کا اندروں بے نور
خودي کي موت سے مشرق ہے مبتلائے جذام
خودي کي موت سے روح عرب ہے بے تب و تاب
بدن عراق و عجم کا ہے بے عروق و عظام
خودي کي موت سے ہندي شکستہ بالوں پر
!قفس ہوا ہے حلال اور آشيانہ حرام
خودي کي موت سے پير حرم ہوا مجبور
!کہ بيچ کھائے مسلماں کا جام ہ احرام
پر ہے افکار سے ان مدرسے والوں کا ضمير
!خوب و ناخوب کي اس دور ميں ہے کس کو تميز
چاہيے خانہ دل کي کوئي منزل خالي
شايد آجائے کہيں سے کوئي مہمان عزيز
پختہ افکار کہاں ڈھونڈنے جائے کوئي
اس زمانے کي ہوا رکھتي ہے ہر چيز کو خام
مدرسہ عقل کو آزاد تو کرتا ہے مگر
چھوڑ جاتا ہے خيالات کو بے ربط و نظام
مردہ ، 'لا ديني افکار سے افرنگ ميں عشق
!عقل بے ربطي افکار سے مشرق ميں غلام
خدا تجھے کسي طوفاں سے آشنا کر دے
کہ تيرے بحر کي موجوں ميں اضطراب نہيں
تجھے کتاب سے ممکن نہيں فراغ کہ تو
کتاب خواں ہے مگر صاحب کتاب نہيں
کہا پہاڑ کي ندي نے سنگ ريزے سے
!فتادگي و سرا فگندگي تري معراج
ترا يہ حال کہ پامال و درد مند ہے تو
مري يہ شان کہ دريا بھي ہے مرا محتاج
جہاں ميں تو کسي ديوار سے نہ ٹکرايا
کسے خبر کہ تو ہے سنگ خارہ يا کہ زجاج
عصر حاضر ملک الموت ہے تيرا ، جس نے
قبض کي روح تري دے کے تجھے فکر معاش
دل لرزتا ہے حريفانہ کشاکش سے ترا
زندگي موت ہے، کھو ديتي ہے جب ذوق خراش
اس جنوں سے تجھے تعليم نے بيگانہ کيا
جو يہ کہتا تھا خرد سے کہ بہانے نہ تراش
فيض فطرت نے تجھے ديدہ شاہيں بخشا
جس ميں رکھ دي ہے غلامي نے نگاہ خفاش
مدرسے نے تري آنکھوں سے چھپايا جن کو
خلوت کوہ و بياباں ميں وہ اسرار ہيں فاش
حريف نکتہ توحيد ہو سکا نہ حکيم
نگاہ چاہيے اسرار 'لا الہ' کے ليے
خدنگ سينہ گردوں ہے اس کا فکر بلند
کمند اس کا تخيل ہے مہرو مہ کے ليے
اگرچہ پاک ہے طينت ميں راہبي اس کي
ترس رہي ہے مگر لذت گنہ کے ليے
مقصد ہو اگر تربيت لعل بدخشاں
بے سود ہے بھٹکے ہوئے خورشيد کا پر تو
دنيا ہے روايات کے پھندوں ميں گرفتار
!کيا مدرسہ ، کيا مدرسے والوں کي تگ و دو
کر سکتے تھے جو اپنے زمانے کي امامت
وہ کہنہ دماغ اپنے زمانے کے ہيں پيرو
ملے گا منزل مقصود کا اسي کو سراغ
اندھيري شب ميں ہے چيتے کي آنکھ جس کا چراغ
ميسر آتي ہے فرصت فقط غلاموں کو
نہيں ہے بندہ حر کے ليے جہاں ميں فراغ
فروغ مغربياں خيرہ کر رہا ہے تجھے
'تري نظر کا نگہباں ہو صاحب 'مازاغ
وہ بزم عيش ہے مہمان يک نفس دو نفس
چمک رہے ہيں مثال ستارہ جس کے اياغ
کيا ہے تجھ کو کتابوں نے کور ذوق اتنا
صبا سے بھي نہ ملا تجھ کو بوئے گل کا سراغ
مجھ کو معلوم ہيں پيران حرم کے انداز
ہو نہ اخلاص تو دعوئے نظر لاف و گزاف
اور يہ اہل کليسا کا نظام تعليم
ايک سازش ہے فقط دين و مروت کے خلاف
اس کي تقدير ميں محکومي و مظلومي ہے
قوم جو کر نہ سکي اپني خودي سے انصاف
فطرت افراد سے اغماض بھي کر ليتي ہے
کبھي کرتي نہيں ملت کے گناہوں کو معاف
(1)
غارت گر ديں ہے يہ زمانہ
ہے اس کي نہاد کافرانہ
دربار شہنشہي سے خوشتر
مردان خدا کا آستانہ
ليکن يہ دور ساحري ہے
انداز ہيں سب کے جادوانہ
سرچشمہ زندگي ہوا خشک
!باقي ہے کہاں م ے شبانہ
خالي ان سے ہوا دبستاں
تھي جن کي نگاہ تازيانہ
جس گھر کا مگر چراغ ہے تو
ہے اس کا مذاق عارفانہ
جوہر ميں ہو 'لاالہ' تو کيا خوف
تعليم ہو گو فرنگيانہ
شاخ گل پر چہک وليکن
!کر اپني خودي ميں آشيانہ
وہ بحر ہے آدمي کہ جس کا
ہر قطرہ ہے بحر بيکرانہ
دہقان اگر نہ ہو تن آساں
ہر دانہ ہے صد ہزار دانہ
غافل منشيں نہ وقت بازي ست ''
''وقت ہنر است و کارسازي ست
(2)
سينے ميں اگر نہ ہو دل گرم
رہ جاتي ہے زندگي ميں خامي
نخچير اگر ہو زيرک و چست
آتي نہيں کام کہنہ دامي
ہے آب حيات اسي جہاں ميں
شرط اس کے ليے ہے تشنہ کامي
غيرت ہے طريقت حقيقي
غيرت سے ہے فقر کي تمامي
اے جان پدر! نہيں ہے ممکن
شاہيں سے تدرو کي غلامي
ناياب نہيں متاع گفتار
!صد انوري و ہزار جامي
ہے ميري بساط کيا جہاں ميں
بس ايک فغان زير بامي
اک صدق مقال ہے کہ جس سے
ميں چشم جہاں ميں ہوں گرامي
اللہ کي دين ہے ، جسے دے
ميراث نہيں بلند نامي
اپنے نور نظر سے کيا خوب
فرماتے ہيں حضرت نظامي
جاے کہ بزرگ بايدت بود ''
''فرزندي من نداردت سود
(3)
مومن پہ گراں ہيں يہ شب و روز
!دين و دولت ، قمار بازي
ناپيد ہے بندہ عمل مست
باقي ہے فقط نفس درازي
ہمت ہو اگر تو ڈھونڈ وہ فقر
جس فقر کي اصل ہے حجازي
اس فقر سے آدمي ميں پيدا
اللہ کي شان بے نيازي
کنجشک و حمام کے ليے موت
ہے اس کا مقام شاہبازي
روشن اس سے خرد کي آنکھيں
بے سرمہ بوعلي و رازي
حاصل اس کا شکوہ محمود
فطرت ميں اگر نہ ہو ايازي
تيري دنيا کا يہ سرافيل
رکھتا نہيں ذوق نے نوازي
ہے اس کي نگاہ عالم آشوب
درپردہ تمام کارسازي
يہ فقر غيور جس نے پايا
بے تيغ و سناں ہے مرد غازي
مومن کي اسي ميں ہے اميري
اللہ سے مانگ يہ فقيري
ہزار بار حکيموں نے اس کو سلجھايا
مگر يہ مسئلہ زن رہا وہيں کا وہيں
قصور زن کا نہيں ہے کچھ اس خرابي ميں
گواہ اس کي شرافت پہ ہيں مہ و پرويں
فساد کا ہے فرنگي معاشرت ميں ظہور
کہ مرد سادہ ہے بيچارہ زن شناس نہيں
کوئي پوچھے حکيم يورپ سے
ہند و يوناں ہيں جس کے حلقہ بگوش
کيا يہي ہے معاشرت کا کمال
!مرد بے کار و زن تہي آغوش
بہت رنگ بدلے سپہر بريں نے
خدايا يہ دنيا جہاں تھي ، وہيں ہے
تفاوت نہ ديکھا زن و شو ميں ميں نے
وہ خلوت نشيں ہے ، يہ خلوت نشيں ہے
ابھي تک ہے پردے ميں اولاد آدم
کسي کي خودي آشکارا نہيں ہے
رسوا کيا اس دور کو جلوت کي ہوس نے
روشن ہے نگہ ، آئنہ دل ہے مکدر
بڑھ جاتا ہے جب ذوق نظر اپني حدوں سے
ہو جاتے ہيں افکار پراگندہ و ابتر
آغوش صدف جس کے نصيبوں ميں نہيں ہے
وہ قطرہ نيساں کبھي بنتا نہيں گوہر
خلوت ميں خودي ہوتي ہے خودگير ، و ليکن
خلوت نہيں اب دير و حرم ميں بھي ميسر
وجود زن سے ہے تصوير کائنات ميں رنگ
اسي کے ساز سے ہے زندگي کا سوز دروں
شرف ميں بڑھ کے ثريا سے مشت خاک اس کي
کہ ہر شرف ہے اسي درج کا در مکنوں
مکالمات فلاطوں نہ لکھ سکي ، ليکن
اسي کے شعلے سے ٹوٹا شرار افلاطوں
اس بحث کا کچھ فيصلہ ميں کر نہيں سکتا
گو خوب سمجھتا ہوں کہ يہ زہر ہے ، وہ قند
کيا فائدہ ، کچھ کہہ کے بنوں اور بھي معتوب
پہلے ہي خفا مجھ سے ہيں تہذيب کے فرزند
اس راز کو عورت کي بصيرت ہي کرے فاش
مجبور ہيں ، معذور ہيں ، مردان خرد مند
کيا چيز ہے آرائش و قيمت ميں زيادہ
!آزادي نسواں کہ زمرد کا گلوبند
اک زندہ حقيقت مرے سينے ميں ہے مستور
کيا سمجھے گا وہ جس کي رگوں ميں ہے لہو سرد
نے پردہ ، نہ تعليم ، نئي ہو کہ پراني
نسوانيت زن کا نگہباں ہے فقط مرد
جس قوم نے اس زندہ حقيقت کو نہ پايا
اس قوم کا خورشيد بہت جلد ہوا زرد
تہذيب فرنگي ہے اگر مرگ امومت
ہے حضرت انساں کے ليے اس کا ثمر موت
جس علم کي تاثير سے زن ہوتي ہے نا زن
کہتے ہيں اسي علم کو ارباب نظر موت
بيگانہ رہے ديں سے اگر مدرسہ زن
ہے عشق و محبت کے ليے علم و ہنر موت
جوہر مرد عياں ہوتا ہے بے منت غير
غير کے ہاتھ ميں ہے جوہر عورت کي نمود
راز ہے اس کے تپ غم کا يہي نکتہ شوق
آتشيں ، لذت تخليق سے ہے اس کا وجود
کھلتے جاتے ہيں اسي آگ سے اسرار حيات
گرم اسي آگ سے ہے معرکہ بود و نبود
ميں بھي مظلومي نسواں سے ہوں غم ناک بہت
!نہيں ممکن مگر اس عقدہ مشکل کي کشود
سرود و شعر و سياست ، کتاب و دين و ہنر
گہر ہيں ان کي گرہ ميں تمام يک دانہ
ضمير بندہ خاکي سے ہے نمود ان کي
بلند تر ہے ستاروں سے ان کا کاشانہ
اگر خودي کي حفاظت کريں تو عين حيات
نہ کر سکيں تو سراپا فسون و افسانہ
ہوئي ہے زير فلک امتوں کي رسوائي
خودي سے جب ادب و ديں ہوئے ہيں بيگانہ
جہان تازہ کي افکار تازہ سے ہے نمود
کہ سنگ و خشت سے ہوتے نہيں جہاں پيدا
خودي ميں ڈوبنے والوں کے عزم و ہمت نے
اس آبجو سے کيے بحر بے کراں پيدا
وہي زمانے کي گردش پہ غالب آتا ہے
جو ہر نفس سے کرے عمر جاوداں پيدا
خودي کي موت سے مشرق کي سر زمينوں ميں
ہوا نہ کوئي خدائي کا رازداں پيدا
ہوائے دشت سے بوئے رفاقت آتي ہے
عجب نہيں ہے کہ ہوں ميرے ہم عناں پيدا
زجاج گر کي دکاں شاعري و ملائي
!ستم ہے ، خوار پھرے دشت و در ميں ديوانہ
کسے خبر کہ جنوں ميں کمال اور بھي ہيں
کريں اگر اسے کوہ و کمر سے بيگانہ
ہجوم مدرسہ بھي سازگار ہے اس کو
کہ اس کے واسطے لازم نہيں ہے ويرانہ
ہے گلہ مجھ کو تري لذت پيدائي کا
تو ہوا فاش تو ہيں اب مرے اسرار بھي فاش
شعلے سے ٹوٹ کے مثل شرر آوارہ نہ رہ
!کر کسي سينہ پر سوز ميں خلوت کي تلاش
مري نگاہ کمال ہنر کو کيا ديکھے
کہ حق سے يہ حرم مغربي ہے بيگانہ
حرم نہيں ہے ، فرنگي کرشمہ بازوں نے
تن حرم ميں چھپا دي ہے روح بت خانہ
يہ بت کدہ انھي غارت گروں کي ہے تعمير
دمشق ہاتھ سے جن کے ہوا ہے ويرانہ
عشق اب پيروي عقل خدا داد کرے
آبرو کوچہ جاناں ميں نہ برباد کرے
کہنہ پيکر ميں نئي روح کو آباد کرے
يا کہن روح کو تقليد سے آزاد کرے
بہار و قافلہ لالہ ہائے صحرائي
!شباب و مستي و ذوق و سرود و رعنائي
اندھيري رات ميں يہ چشمکيں ستاروں کي
!يہ بحر ، يہ فلک نيلگوں کي پہنائي
سفر عروس قمر کا عماري شب ميں
!طلوع مہر و سکوت سپہر مينائي
نگاہ ہو تو بہائے نظارہ کچھ بھي نہيں
کہ بيچتي نہيں فطرت جمال و زيبائي
ہے مرے سينہ بے نور ميں اب کيا باقي
'لاالہ' مردہ و افسردہ و بے ذوق نمود
چشم فطرت بھي نہ پہچان سکے گي مجھ کو
کہ ايازي سے دگرگوں ہے مقام محمود
کيوں مسلماں نہ خجل ہو تري سنگيني سے
کہ غلامي سے ہوا مثل زجاج اس کا وجود
ہے تري شان کے شاياں اسي مومن کي نماز
جس کي تکبير ميں ہو معرکہ بود و نبود
اب کہاں ميرے نفس ميں وہ حرارت ، وہ گداز
بے تب و تاب دروں ميري صلوہ اور درود
ہے مري بانگ اذاں ميں نہ بلندي ، نہ شکوہ
کيا گوارا ہے تجھے ايسے مسلماں کا سجود؟
تري خودي سے ہے روشن ترا حريم وجود
حيات کيا ہے ، اسي کا سرور و سوز و ثبات
بلند تر مہ و پرويں سے ہے اسي کا مقام
اسي کے نور سے پيدا ہيں تيرے ذات و صفات
حريم تيرا ، خودي غير کي ! معاذاللہ
دوبارہ زندہ نہ کر کاروبار لات و منات
يہي کمال ہے تمثيل کا کہ تو نہ رہے
رہا نہ تو تو نہ سوز خودي ، نہ ساز حيات
(1)
سورج نے ديا اپني شعاعوں کو يہ پيغام
دنيا ہے عجب چيز ، کبھي صبح کبھي شام
مدت سے تم آوارہ ہو پہنائے فضا ميں
بڑھتي ہي چلي جاتي ہے بے مہري ايام
نے ريت کے ذروں پہ چمکنے ميں ہے راحت
نے مثل صبا طوف گل و لالہ ميں آرام
پھر ميرے تجلي کدہ دل ميں سما جاؤ
چھوڑو چمنستان و بيابان و در و بام
(2)
آفاق کے ہر گوشے سے اٹھتي ہيں شعاعيں
بچھڑے ہوئے خورشيد سے ہوتي ہيں ہم آغوش
اک شور ہے ، مغرب ميں اجالا نہيں ممکن
افرنگ مشينوں کے دھويں سے ہے سيہ پوش
مشرق نہيں گو لذت نظارہ سے محروم
ليکن صفت عالم لاہوت ہے خاموش
پھر ہم کو اسي سينہ روشن ميں چھپا لے
اے مہر جہاں تاب ! نہ کر ہم کو فراموش
(3)
اک شوخ کرن ، شوخ مثال نگہ حور
آرام سے فارغ ، صفت جوہر سيماب
بولي کہ مجھے رخصت تنوير عطا ہو
جب تک نہ ہو مشرق کا ہر اک ذرہ جہاں تاب
چھوڑوں گي نہ ميں ہند کي تاريک فضا کو
جب تک نہ اٹھيں خواب سے مردان گراں خواب
خاور کي اميدوں کا يہي خاک ہے مرکز
اقبال کے اشکوں سے يہي خاک ہے سيراب
چشم مہ و پرويں ہے اسي خاک سے روشن
يہ خاک کہ ہے جس کا خزف ريزہ درناب
اس خاک سے اٹھے ہيں وہ غواص معاني
جن کے ليے ہر بحر پر آشوب ہے پاياب
جس ساز کے نغموں سے حرارت تھي دلوں ميں
محفل کا وہي ساز ہے بيگانہ مضراب
بت خانے کے دروازے پہ سوتا ہے برہمن
تقدير کو روتا ہے مسلماں تہ محراب
مشرق سے ہو بيزار ، نہ مغرب سے حذر کر
فطرت کا اشارہ ہے کہ ہر شب کو سحر کر
مقابلہ تو زمانے کا خوب کرتا ہوں
اگرچہ ميں نہ سپاہي ہوں نے امير جنود
مجھے خبر نہيں يہ شاعري ہے يا کچھ اور
عطا ہوا ہے مجھے ذکر و فکر و جذب و سرود
جبين بندہ حق ميں نمود ہے جس کي
اسي جلال سے لبريز ہے ضمير وجود
يہ کافري تو نہيں ، کافري سے کم بھي نہيں
کہ مرد حق ہو گرفتار حاضر و موجود
غميں نہ ہو کہ بہت دور ہيں ابھي باقي
نئے ستاروں سے خالي نہيں سپہر کبود
يہ کائنات چھپاتي نہيں ضمير اپنا
کہ ذرے ذرے ميں ہے ذوق آشکارائي
کچھ اور ہي نظر آتا ہے کاروبار جہاں
نگاہ شوق اگر ہو شريک بينائي
اسي نگاہ سے محکوم قوم کے فرزند
ہوئے جہاں ميں سزاوار کار فرمائي
اسي نگاہ ميں ہے قاہري و جباري
اسي نگاہ ميں ہے دلبري و رعنائي
اسي نگاہ سے ہر ذرے کو ، جنوں ميرا
سکھا رہا ہے رہ و رسم دشت پيمائي
نگاہ شوق ميسر نہيں اگر تجھ کو
ترا وجود ہے قلب و نظر کي رسوائي
مہر و مہ و مشتري ، چند نفس کا فروغ
عشق سے ہے پائدار تيري خودي کا وجود
تيرے حرم کا ضمير اسود و احمر سے پاک
ننگ ہے تيرے ليے سرخ و سپيد و کبود
تيري خودي کا غياب معرکہ ذکر و فکر
تيري خودي کا حضور عالم شعر و سرود
روح اگر ہے تري رنج غلامي سے زار
تيرے ہنر کا جہاں دير و طواف و سجود
اور اگر باخبر اپني شرافت سے ہو
تيري سپہ انس و جن ، تو ہے امير جنود
دريا ميں موتي ، اے موج بے باک
ساحل کي سوغات ! خاروخس و خاک
ميرے شرر ميں بجلي کے جوہر
ليکن نيستاں تيرا ہے نم ناک
تيرا زمانہ ، تاثير تيري
ناداں ! نہيں يہ تاثير افلاک
ايسا جنوں بھي ديکھا ہے ميں نے
جس نے سيے ہيں تقدير کے چاک
کامل وہي ہے رندي کے فن ميں
مستي ہے جس کي بے منت تاک
رکھتا ہے اب تک ميخانہ شرق
وہ مے کہ جس سے روشن ہو ادراک
اہل نظر ہيں يورپ سے نوميد
ان امتوں کے باطن نہيں پاک
اے کہ ہے زير فلک مثل شرر تيري نمود
!کون سمجھائے تجھے کيا ہيں مقامات وجود
گر ہنر ميں نہيں تعمير خودي کا جوہر
!وائے صورت گري و شاعري و ناے و سرود
مکتب و مے کدہ جز درس نبودن ندہند
بودن آموز کہ ہم باشي و ہم خواہي بود
آيا کہاں سے نالہ نے ميں سرود مے
اصل اس کي نے نواز کا دل ہے کہ چوب نے
دل کيا ہے ، اس کي مستي و قوت کہاں سے ہے
کيوں اس کي اک نگاہ الٹتي ہے تخت کے
کيوں اس کي زندگي سے ہے اقوام ميں حيات
کيوں اس کے واردات بدلتے ہيں پے بہ پے
کيا بات ہے کہ صاحب دل کي نگاہ ميں
جچتي نہيں ہے سلطنت روم و شام و رے
جس روز دل کي رمز مغني سمجھ گيا
سمجھو تمام مرحلہ ہائے ہنر ہيں طے
نسيم
انجم کي فضا تک نہ ہوئي ميري رسائي
کرتي رہي ميں پيرہن لالہ و گل چاک
مجبور ہوئي جاتي ہوں ميں ترک وطن پر
بے ذوق ہيں بلبل کي نوا ہائے طرب ناک
دونوں سے کيا ہے تجھے تقدير نے محرم
!خاک چمن اچھي کہ سرا پردہ افلاک
شبنم
کھينچيں نہ اگر تجھ کو چمن کے خس و خاشاک
گلشن بھي ہے اک سر سرا پردہ افلاک
اس دشت جگر تاب کي خاموش فضا ميں
فطرت نے فقط ريت کے ٹيلے کيے تعمير
اہرام کي عظمت سے نگوں سار ہيں افلاک
!کس ہاتھ نے کھينچي ابدےت کي يہ تصوير
فطرت کي غلامي سے کر آزاد ہنر کو
صياد ہيں مردان ہنر مند کہ نخچير
ہے يہ فردوس نظر اہل ہنر کي تعمير
فاش ہے چشم تماشا پہ نہاں خانہ ذات
نہ خودي ہے ، نہ جہان سحر و شام کے دور
زندگاني کي حريفانہ کشاکش سے نجات
آہ ، وہ کافر بيچارہ کہ ہيں اس کے صنم
!عصر رفتہ کے وہي ٹوٹے ہوئے لات و منات
تو ہے ميت ، يہ ہنر تيرے جنازے کا امام
!نظر آئي جسے مرقد کے شبستاں ميں حيات
فردوس ميں رومي سے يہ کہتا تھا سنائي
مشرق ميں ابھي تک ہے وہي کاسہ، وہي آش
حلاج کي ليکن يہ روايت ہے کہ آخر
!اک مرد قلندر نے کيا راز خودي فاش
اے اہل نظر ذوق نظر خوب ہے ليکن
جو شے کي حقيقت کو نہ ديکھے ، وہ نظر کيا
مقصود ہنر سوز حيات ابدي ہے
يہ ايک نفس يا دو نفس مثل شرر کيا
جس سے دل دريا متلاطم نہيں ہوتا
اے قطرئہ نيساں وہ صدف کيا ، وہ گہر کيا
شاعر کي نوا ہو کہ مغني کا نفس ہو
جس سے چمن افسردہ ہو وہ باد سحر کيا
بے معجزہ دنيا ميں ابھرتي نہيں قوميں
!جو ضرب کليمي نہيں رکھتا وہ ہنر کيا
پھول
شايد تو سمجھتي تھي وطن دور ہے ميرا
اے قاصد افلاک! نہيں ، دور نہيں ہے
شبنم
ہوتا ہے مگر محنت پرواز سے روشن
يہ نکتہ کہ گردوں سے زميں دور نہيں ہے
صبح
مانند سحر صحن گلستاں ميں قدم رکھ
آئے تہ پا گوہر شبنم تو نہ ٹوٹے
ہو کوہ و بياباں سے ہم آغوش ، و ليکن
!ہاتھوں سے ترے دامن افلاک نہ چھوٹے
'وہ صاحب 'تحفہ العراقين
ارباب نظر کا قرہ العين
ہے پردہ شگاف اس کا ادراک
پردے ہيں تمام چاک در چاک
خاموش ہے عالم معاني
!کہتا نہيں حرف 'لن تراني'
پوچھ اس سے يہ خاک داں ہے کيا چيز
ہنگامہ اين و آں ہے کيا چيز
وہ محرم عالم مکافات
اک بات ميں کہہ گيا ہے سو بات
خود بوے چنيں جہاں تواں برد ''
''!کابليس بماند و بوالبشر مرد
غلط نگر ہے تري چشم نيم باز اب تک
ترا وجود ترے واسطے ہے راز اب تک
ترا نياز نہيں آشنائے ناز اب تک
کہ ہے قيام سے خالي تري نماز اب تک
گسستہ تار ہے تيري خودي کا ساز اب تک
!کہ تو ہے نغمہ رومي سے بے نياز اب تک
ديکھے تو زمانے کو اگر اپني نظر سے
افلاک منور ہوں ترے نور سحر سے
خورشيد کرے کسب ضيا تيرے شرر سے
ظاہر تري تقدير ہو سيمائے قمر سے
دريا متلاطم ہوں تري موج گہر سے
شرمندہ ہو فطرت ترے اعجاز ہنر سے
اغيار کے افکار و تخيل کي گدائي
کيا تجھ کو نہيں اپني خودي تک بھي رسائي؟
ہے حقيقت يا مري چشم غلط بيں کا فساد
يہ زميں، يہ دشت ، يہ کہسار ، يہ چرخ کبود
کوئي کہتا ہے نہيں ہے ، کوئي کہتاہے کہ ہے
!کيا خبر ، ہے يا نہيں ہے تيري دنيا کا وجود
ميرزا بيدل نے کس خوبي سے کھولي يہ گرہ
!اہل حکمت پر بہت مشکل رہي جس کي کشود
دل اگر ميداشت وسعت بے نشاں بود ايں چمن ''
''رنگ مے بيروں نشست از بسکہ مينا تنگ بود
مرے ليے ہے فقط زور حيدري کافي
ترے نصيب فلاطوں کي تيزي ادراک
مري نظر ميں يہي ہے جمال و زيبائي
کہ سر بسجدہ ہيں قوت کے سامنے افلاک
نہ ہو جلال تو حسن و جمال بے تاثير
نرا نفس ہے اگر نغمہ ہو نہ آتش ناک
مجھے سزا کے ليے بھي نہيں قبول وہ آگ
!کہ جس کا شعلہ نہ ہو تند و سرکش و بے باک
کس درجہ يہاں عام ہوئي مرگ تخيل
!ہندي بھي فرنگي کا مقلد ، عجمي بھي
مجھ کو تو يہي غم ہے کہ اس دور کے بہزاد
کھو بيٹھے ہيں مشرق کا سرور ازلي بھي
معلوم ہيں اے مرد ہنر تيرے کمالات
صنعت تجھے آتي ہے پراني بھي ، نئي بھي
فطرت کو دکھايا بھي ہے ، ديکھا بھي ہے تو نے
!آئينہ فطرت ميں دکھا اپني خودي بھي
کھل تو جاتا ہے مغني کے بم و زير سے دل
!نہ رہا زندہ و پائندہ تو کيا دل کي کشود
ہے ابھي سينہ افلاک ميں پنہاں وہ نوا
جس کي گرمي سے پگھل جائے ستاروں کا وجود
جس کي تاثير سے آدم ہو غم و خوف سے پاک
اور پيدا ہو ايازي سے مقام محمود
مہ و انجم کا يہ حيرت کدہ باقي نہ رہے
تو رہے اور ترا زمزمہ لا موجود
جس کو مشروع سمجھتے ہيں فقيہان خودي
!منتظر ہے کسي مطرب کا ابھي تک وہ سرود
نہ ميرے ذکر ميں ہے صوفيوں کا سوز و سرور
نہ ميرا فکر ہے پيمانہ ثواب و عذاب
خدا کرے کہ اسے اتفاق ہو مجھ سے
فقيہ شہر کہ ہے محرم حديث و کتاب
اگر نوا ميں ہے پوشيدہ موت کا پيغام
!حرام ميري نگاہوں ميں ناے و چنگ و رباب
يہ آبجو کي رواني ، يہ ہمکناري خاک
مري نگاہ ميں ناخوب ہے يہ نظارہ
ادھر نہ ديکھ ، ادھر ديکھ اے جوان عزيز
بلند زور دروں سے ہوا ہے فوارہ
مشرق کے نيستاں ميں ہے محتاج نفس نے
شاعر ! ترے سينے ميں نفس ہے کہ نہيں ہے
تاثير غلامي سے خودي جس کي ہوئي نرم
اچھي نہيں اس قوم کے حق ميں عجمي لے
شيشے کي صراحي ہو کہ مٹي کا سبو ہو
شمشير کي مانند ہو تيزي ميں تري مے
ايسي کوئي دنيا نہيں افلاک کے نيچے
بے معرکہ ہاتھ آئے جہاں تخت جم و کے
ہر لحظہ نيا طور ، نئي برق تجلي
!اللہ کرے مرحلہ شوق نہ ہو طے
ہے شعر عجم گرچہ طرب ناک و دل آويز
اس شعر سے ہوتي نہيں شمشير خودي تيز
افسردہ اگر اس کي نوا سے ہو گلستاں
بہتر ہے کہ خاموش رہے مرغ سحر خيز
وہ ضرب اگر کوہ شکن بھي ہو تو کيا ہے
جس سے متزلزل نہ ہوئي دولت پرويز
اقبال يہ ہے خارہ تراشي کا زمانہ
'از ہر چہ بآئينہ نمايند بہ پرہيز'
عشق و مستي کا جنازہ ہے تخيل ان کا
ان کے انديشہ تاريک ميں قوموں کے مزار
موت کي نقش گري ان کے صنم خانوں ميں
زندگي سے ہنر ان برہمنوں کا بيزار
چشم آدم سے چھپاتے ہيں مقامات بلند
کرتے ہيں روح کو خوابيدہ ، بدن کو بيدار
ہند کے شاعر و صورت گر و افسانہ نويس
!آہ ! بيچاروں کے اعصاب پہ عورت ہے سوار
اس کي نفرت بھي عميق ، اس کي محبت بھي عميق
قہر بھي اس کا ہے اللہ کے بندوں پہ شفيق
پرورش پاتا ہے تقليد کي تاريکي ميں
ہے مگر اس کي طبيعت کا تقاضا تخليق
انجمن ميں بھي ميسر رہي خلوت اس کو
شمع محفل کي طرح سب سے جدا ، سب کا رفيق
مثل خورشيد سحر فکر کي تاباني ميں
بات ميں سادہ و آزادہ، معاني ميں دقيق
اس کا انداز نظر اپنے زمانے سے جدا
اس کے احوال سے محرم نہيں پيران طريق
زندہ دل سے نہيں پوشيدہ ضمير تقدير
خواب ميں ديکھتا ہے عالم نو کي تصوير
اور جب بانگ اذاں کرتي ہے بيدار اسے
کرتا ہے خواب ميں ديکھي ہوئي دنيا تعمير
بدن اس تازہ جہاں کا ہے اسي کي کف خاک
روح اس تازہ جہاں کي ہے اسي کي تکبير
ہر چند کہ ايجاد معاني ہے خدا داد
!کوشش سے کہاں مرد ہنر مند ہے آزاد
خون رگ معمار کي گرمي سے ہے تعمير
ميخانہ حافظ ہو کہ بتخانہ بہزاد
بے محنت پيہم کوئي جوہر نہيں کھلتا
!روشن شرر تيشہ سے ہے خانہ فرہاد
وہ نغمہ سردي خون غزل سرا کي دليل
کہ جس کو سن کے ترا چہرہ تاب ناک نہيں
نوا کو کرتا ہے موج نفس سے زہر آلود
وہ نے نواز کہ جس کا ضمير پاک نہيں
پھرا ميں مشرق و مغرب کے لالہ زاروں ميں
کسي چمن ميں گريبان لالہ چاک نہيں
خودي بلند تھي اس خوں گرفتہ چيني کي
کہا غريب نے جلاد سے دم تعزير
ٹھہر ٹھہر کہ بہت دل کشا ہے يہ منظر
!ذرا ميں ديکھ تو لوں تاب ناکي شمشير
ميں شعر کے اسرار سے محرم نہيں ليکن
يہ نکتہ ہے ، تاريخ امم جس کي ہے تفصيل
وہ شعر کہ پيغام حيات ابدي ہے
يا نغمہ جبريل ہے يا بانگ سرافيل
شعر سے روشن ہے جان جبرئيل و اہرمن
رقص و موسيقي سے ہے سوز و سرور انجمن
فاش يوں کرتا ہے اک چيني حکيم اسرار فن
شعر گويا روح موسيقي ہے ، رقص اس کا بدن
طريق اہل دنيا ہے گلہ شکوہ زمانے کا
نہيں ہے زخم کھا کر آہ کرنا شان درويشي
يہ نکتہ پير دانا نے مجھے خلوت ميں سمجھايا
!کہ ہے ضبط فغاں شيري ، فغاں روباہي و ميشي
چھوڑ يورپ کے ليے رقص بدن کے خم و پيچ
!روح کے رقص ميں ہے ضرب کليم اللہي
صلہ اس رقص کا ہے تشنگي کام و دہن
صلہ اس رقص کا درويشي و شاہنشاہي
قوموں کي روش سے مجھے ہوتا ہے يہ معلوم
بے سود نہيں روس کي يہ گرمي رفتار
انديشہ ہوا شوخي افکار پہ مجبور
فرسودہ طريقوں سے زمانہ ہوا بيزار
انساں کي ہوس نے جنھيں رکھا تھا چھپا کر
کھلتے نظر آتے ہيں بتدريج وہ اسرار
قرآن ميں ہو غوطہ زن اے مرد مسلماں
اللہ کرے تجھ کو عطا جدت کردار
جو حرف 'قل العفو' ميں پوشيدہ ہے اب تک
!اس دور ميں شايد وہ حقيقت ہو نمودار
يہ علم و حکمت کي مہرہ بازي ، يہ بحث و تکرار کي نمائش
نہيں ہے دنيا کو اب گوارا پرانے افکار کي نمائش
تري کتابوں ميں اے حکيم معاش رکھا ہي کيا ہے آخر
خطوط خم دار کي نمائش ، مريز و کج دار کي نمائش
جہان مغرب کے بت کدوں ميں ، کليسياؤں ميں ، مدرسوں ميں
ہوس کي خون ريزياں چھپاتي ہے عقل عيار کي نمائش
نہ ايشيا ميں نہ يورپ ميں سوز و ساز حيات
خودي کي موت ہے يہ ، اور وہ ضمير کي موت
دلوں ميں ولولہ انقلاب ہے پيدا
!قريب آگئي شايد جہان پير کي موت
ميں کار جہاں سے نہيں آگاہ ، وليکن
ارباب نظر سے نہيں پوشيدہ کوئي راز
کر تو بھي حکومت کے وزيروں کي خوشامد
دستور نيا ، اور نئے دور کا آغاز
معلوم نہيں ، ہے يہ خوشامد کہ حقيقت
کہہ دے کوئي الو کو اگر 'رات کا شہباز
ہوا ہے بندئہ مومن فسوني افرنگ
اسي سبب سے قلندر کي آنکھ ہے نم ناک
ترے بلند مناصب کي خير ہو يارب
کہ ان کے واسطے تو نے کيا خودي کو ہلاک
مگر يہ بات چھپائے سے چھپ نہيں سکتي
سمجھ گئي ہے اسے ہر طبيعت چالاک
شريک حکم غلاموں کو کر نہيں سکتے
!خريدتے ہيں فقط ان کا جوہر ادراک
يہ عيش فراواں ، يہ حکومت ، يہ تجارت
دل سينہ بے نور ميں محروم تسلي
تاريک ہے افرنگ مشينوں کے دھويں سے
يہ وادي ايمن نہيں شايان تجلي
ہے نزع کي حالت ميں يہ تہذيب جواں مرگ
!شايد ہوں کليسا کے يہودي متولي
شاعر بھي ہيں پيدا ، علما بھي ، حکما بھي
خالي نہيں قوموں کي غلامي کا زمانہ
مقصد ہے ان اللہ کے بندوں کا مگر ايک
ہر ايک ہے گو شرح معاني ميں يگانہ
بہتر ہے کہ شيروں کو سکھا ديں رم آہو
،باقي نہ رہے شير کي شيري کا فسانہ
کرتے ہيں غلاموں کو غلامي پہ رضامند
تاويل مسائل کو بناتے ہيں بہانہ
روش قضائے الہي کي ہے عجيب و غريب
خبر نہيں کہ ضمير جہاں ميں ہے کيا بات
ہوئے ہيں کسر چليپا کے واسطے مامور
وہي کہ حفظ چليپا کو جانتے تھے نجات
يہ وحي دہريت روس پر ہوئي نازل
!کہ توڑ ڈال کليسائيوں کے لات و منات
وہ کل کے غم و عيش پہ کچھ حق نہيں رکھتا
جو آج خود افروز و جگر سوز نہيں ہے
وہ قوم نہيں لائق ہنگامہ فردا
!جس قوم کي تقدير ميں امروز نہيں ہے
مري نوا سے گريبان لالہ چاک ہوا
نسيم صبح ، چمن کي تلاش ميں ہے ابھي
نہ مصطفي نہ رضا شاہ ميں نمود اس کي
کہ روح شرق بدن کي تلاش ميں ہے ابھي
مري خودي بھي سزا کي ہے مستحق ليکن
زمانہ دارو رسن کي تلاش ميں ہے ابھي
تري حريف ہے يارب سياست افرنگ
مگر ہيں اس کے پجاري فقط امير و رئيس
بنايا ايک ہي ابليس آگ سے تو نے
!بنائے خاک سے اس نے دو صد ہزار ابليس
دور حاضر ہے حقيقت ميں وہي عہد قديم
اہل سجادہ ہيں يا اہل سياست ہيں امام
اس ميں پيري کي کرامت ہے نہ ميري کا ہے زور
سينکڑوں صديوں سے خوگر ہيں غلامي کے عوام
خواجگي ميں کوئي مشکل نہيں رہتي باقي
!پختہ ہو جاتے ہيں جب خوئے غلامي ميں غلام
حکمت مشرق و مغرب نے سکھايا ہے مجھے
ايک نکتہ کہ غلاموں کے ليے ہے اکسير
دين ہو ، فلسفہ ہو ، فقر ہو ، سلطاني ہو
ہوتے ہيں پختہ عقائد کي بنا پر تعمير
حرف اس قوم کا بے سوز ، عمل زار و زبوں
!ہو گيا پختہ عقائد سے تہي جس کا ضمير
خود ابوالہول نے يہ نکتہ سکھايا مجھ کو
وہ ابوالہول کہ ہے صاحب اسرار قديم
دفعتہً جس سے بدل جاتي ہے تقدير امم
ہے وہ قوت کہ حريف اس کي نہيں عقل حکيم
ہر زمانے ميں دگر گوں ہے طبيعت اس کي
!کبھي شمشير محمد ہے ، کبھي چوب کليم
يورپ کے کرگسوں کو نہيں ہے ابھي خبر
ہے کتني زہر ناک ابي سينيا کي لاش
!ہونے کو ہے يہ مردہ ديرينہ قاش قاش
تہذيب کا کمال شرافت کا ہے زوال
غارت گري جہاں ميں ہے اقوام کي معاش
!ہر گرگ کو ہے برہ معصوم کي تلاش
اے وائے آبروئے کليسا کا آءنہ
روما نے کر ديا سر بازار پاش پاش
لا کر برہمنوں کو سياست کے پيچ ميں
زناريوں کو دير کہن سے نکال دو
وہ فاقہ کش کہ موت سے ڈرتا نہيں ذرا
روح محمد اس کے بدن سے نکال دو
فکر عرب کو دے کے فرنگي تخيلات
اسلام کو حجاز و يمن سے نکال دو
افغانيوں کي غيرت ديں کا ہے يہ علاج
ملا کو ان کے کوہ و دمن سے نکال دو
اہل حرم سے ان کي روايات چھين لو
آہو کو مرغزار ختن سے نکال دو
اقبال کے نفس سے ہے لالے کي آگ تيز
ايسے غزل سرا کو چمن سے نکال دو
پاني بھي مسخر ہے ، ہوا بھي ہے مسخر
کيا ہو جو نگاہ فلک پير بدل جائے
ديکھا ہے ملوکيت افرنگ نے جو خواب
ممکن ہے کہ اس خواب کي تعبير بدل جائے
طہران ہو گر عالم مشرق کا جينوا
شايد کرہ ارض کي تقدير بدل جائے
غواص تو فطرت نے بنايا ہے مجھے بھي
ليکن مجھے اعماق سياست سے ہے پرہيز
فطرت کو گوارا نہيں سلطاني جاويد
ہر چند کہ يہ شعبدہ بازي ہے دل آويز
فرہاد کي خارا شکني زندہ ہے اب تک
باقي نہيں دنيا ميں ملوکيت پرويز
اس راز کو اک مرد فرنگي نے کيا فاش
ہر چند کہ دانا اسے کھولا نہيں کرتے
جمہوريت اک طرز حکومت ہے کہ جس ميں
بندوں کو گنا کرتے ہيں ، تولا نہيں کرتے
فرنگيوں کو عطا خاک سوريا نے کيا
نبي عفت و غم خواري و کم آزاري
صلہ فرنگ سے آيا ہے سوريا کے ليے
مے و قمار و ہجوم زنان بازاري
!کيا زمانے سے نرالا ہے مسوليني کا جرم
بے محل بگڑا ہے معصومان يورپ کا مزاج
ميں پھٹکتا ہوں تو چھلني کو برا لگتا ہے کيوں
ہيں سبھي تہذيب کے اوزار ! تو چھلني ، ميں چھاج
ميرے سودائے ملوکيت کو ٹھکراتے ہو تم
تم نے کيا توڑے نہيں کمزور قوموں کے زجاج؟
يہ عجائب شعبدے کس کي ملوکيت کے ہيں
راجدھاني ہے ، مگر باقي نہ راجا ہے نہ راج
آل سيزر چوب نے کي آبياري ميں رہے
!اور تم دنيا کے بنجر بھي نہ چھوڑو بے خراج
تم نے لوٹے بے نوا صحرا نشينوں کے خيام
تم نے لوٹي کشت دہقاں ، تم نے لوٹے تخت و تاج
پردہ تہذيب ميں غارت گري ، آدم کشي
کل روا رکھي تھي تم نے ، ميں روا رکھتا ہوں آج
معلوم کسے ہند کي تقدير کہ اب تک
بيچارہ کسي تاج کا تابندہ نگيں ہے
دہقاں ہے کسي قبر کا اگلا ہوا مردہ
بوسيدہ کفن جس کا ابھي زير زميں ہے
جاں بھي گرو غير ، بدن بھي گرو غير
افسوس کہ باقي نہ مکاں ہے نہ مکيں ہے
يورپ کي غلامي پہ رضا مند ہوا تو
مجھ کو تو گلہ تجھ سے ہے ، يورپ سے نہيں ہے
کہاں فرشتہ تہذيب کي ضرورت ہے
نہيں زمانہ حاضر کو اس ميں دشواري
جہاں قمار نہيں ، زن تنک لباس نہيں
جہاں حرام بتاتے ہيں شغل مے خواري
بدن ميں گرچہ ہے اک روح ناشکيب و عميق
طريقہ اب و جد سے نہيں ہے بيزاري
جسور و زيرک و پردم ہے بچہ بدوي
نہيں ہے فيض مکاتب کا چشمہ جاري
نظروران فرنگي کا ہے يہي فتوي
وہ سرزميں مدنيت سے ہے ابھي عاري
جو بات حق ہو ، وہ مجھ سے چھپي نہيں رہتي
خدا نے مجھ کو ديا ہے دل خبير و بصير
مري نگاہ ميں ہے يہ سياست لا ديں
کنيز اہرمن و دوں نہاد و مردہ ضمير
ہوئي ہے ترک کليسا سے حاکمي آزاد
فرنگيوں کي سياست ہے ديو بے زنجير
متاع غير پہ ہوتي ہے جب نظر اس کي
تو ہيں ہراول لشکر کليسيا کے سفير
اقبال کو شک اس کي شرافت ميں نہيں ہے
ہر ملت مظلوم کا يورپ ہے خريدار
يہ پير کليسا کي کرامت ہے کہ اس نے
بجلي کے چراغوں سے منور کيے افکار
جلتا ہے مگر شام و فلسطيں پہ مرا دل
تدبير سے کھلتا نہيں يہ عقدہ دشوار
ترکان 'جفا پيشہ' کے پنجے سے نکل کر
بيچارے ہيں تہذيب کے پھندے ميں گرفتار
اک لرد فرنگي نے کہا اپنے پسر سے
منظر وہ طلب کر کہ تري آنکھ نہ ہو سير
بيچارے کے حق ميں ہے يہي سب سے بڑا ظلم
برے پہ اگر فاش کريں قاعدہ شير
سينے ميں رہے راز ملوکانہ تو بہتر
کرتے نہيں محکوم کو تيغوں سے کبھي زير
تعليم کے تيزاب ميں ڈال اس کي خودي کو
ہو جائے ملائم تو جدھر چاہے ، اسے پھير
تاثير ميں اکسير سے بڑھ کر ہے يہ تيزاب
سونے کا ہمالہ ہو تو مٹي کا ہے اک ڈھير
سکندر
صلہ تيرا تري زنجير يا شمشير ہے ميري
کہ تيري رہزني سے تنگ ہے دريا کي پہنائي
قزاق
سکندر ! حيف ، تو اس کو جواں مردي سمجھتا ہے
گوارا اس طرح کرتے ہيں ہم چشموں کي رسوائي؟
ترا پيشہ ہے سفاکي ، مرا پيشہ ہے سفاکي
کہ ہم قزاق ہيں دونوں ، تو ميداني ، ميں دريائي
بيچاري کئي روز سے دم توڑ رہي ہے
ڈر ہے خبر بد نہ مرے منہ سے نکل جائے
تقدير تو مبرم نظر آتي ہے وليکن
پيران کليسا کي دعا يہ ہے کہ ٹل جائے
ممکن ہے کہ يہ داشتہ پيرک افرنگ
ابليس کے تعويذ سے کچھ روز سنبھل جائے
رندان فرانسيس کا ميخانہ سلامت
پر ہے م ے گلرنگ سے ہر شيشہ حلب کا
ہے خاک فلسطيں پہ يہودي کا اگر حق
ہسپانيہ پر حق نہيں کيوں اہل عرب کا
مقصد ہے ملوکيت انگليس کا کچھ اور
قصہ نہيں نارنج کا يا شہد و رطب کا
اميد کيا ہے سياست کے پيشواؤں سے
يہ خاک باز ہيں ، رکھتے ہيں خاک سے پيوند
ہميشہ مور و مگس پر نگاہ ہے ان کي
جہاں ميں صفت عنکبوت ان کي کمند
خوشا وہ قافلہ ، جس کے امير کي ہے متاع
تخيل ملکوتي و جذبہ ہائے بلند
سخت باريک ہيں امراض امم کے اسباب
کھول کر کہيے تو کرتا ہے بياں کوتاہي
دين شيري ميں غلاموں کے امام اور شيوخ
ديکھتے ہيں فقط اک فلسفہ روباہي
ہو اگر قوت فرعون کي در پردہ مريد
قوم کے حق ميں ہے لعنت وہ کليم اللہي
کہا مجاہد ترکي نے مجھ سے بعد نماز
طويل سجدہ ہيں کيوں اس قدر تمھارے امام
وہ سادہ مرد مجاہد ، وہ مومن آزاد
خبر نہ تھي اسے کيا چيز ہے نماز غلام
ہزار کام ہيں مردان حر کو دنيا ميں
انھي کے ذوق عمل سے ہيں امتوں کے نظام
بدن غلام کا سوز عمل سے ہے محروم
کہ ہے مرور غلاموں کے روز و شب پہ حرام
طويل سجدہ اگر ہيں تو کيا تعجب ہے
ورائے سجدہ غريبوں کو اور کيا ہے کام
خدا نصيب کرے ہند کے اماموں کو
وہ سجدہ جس ميں ہے ملت کي زندگي کا پيام
زمانہ اب بھي نہيں جس کے سوز سے فارغ
ميں جانتا ہوں وہ آتش ترے وجود ميں ہے
تري دوا نہ جنيوا ميں ہے ، نہ لندن ميں
فرنگ کي رگ جاں پنجہ يہود ميں ہے
سنا ہے ميں نے ، غلامي سے امتوں کي نجات
خودي کي پرورش و لذت نمود ميں ہے
يہاں مرض کا سبب ہے غلامي و تقليد
وہاں مرض کا سبب ہے نظام جمہوري
نہ مشرق اس سے بري ہے ، نہ مغرب اس سے بري
جہاں ميں عام ہے قلب و نظر کي رنجوري
يہ مہر ہے بے مہري صياد کا پردہ
آئي نہ مرے کام مري تازہ صفيري
رکھنے لگا مرجھائے ہوئے پھول قفس ميں
شايد کہ اسيروں کو گوارا ہو اسيري
ميرے کہستاں! تجھے چھوڑ کے جاؤں کہاں
تيري چٹانوں ميں ہے ميرے اب و جد کي خاک
روز ازل سے ہے تو منزل شاہين و چرغ
لالہ و گل سے تہي ، نغمہ بلبل سے پاک
تيرے خم و پيچ ميں ميري بہشت بريں
خاک تري عنبريں ، آب ترا تاب ناک
باز نہ ہوگا کبھي بندہ کبک و حمام
!حفظ بدن کے ليے روح کو کردوں ہلاک
اے مرے فقر غيور ! فيصلہ تيرا ہے کيا
!خلعت انگريز يا پيرہن چاک چاک
حقيقت ازلي ہے رقابت اقوام
نگاہ پير فلک ميں نہ ميں عزيز ، نہ تو
خودي ميں ڈوب ، زمانے سے نا اميد نہ ہو
کہ اس کا زخم ہے درپردہ اہتمام رفو
رہے گا تو ہي جہاں ميں يگانہ و يکتا
'اتر گيا جو ترے دل ميں 'لاشريک لہ
تري دعا سے قضا تو بدل نہيں سکتي
مگر ہے اس سے يہ ممکن کہ تو بدل جائے
تري خودي ميں اگر انقلاب ہو پيدا
عجب نہيں ہے کہ يہ چار سو بدل جائے
وہي شراب ، وہي ہاے و ہو رہے باقي
طريق ساقي و رسم کدو بدل جائے
تري دعا ہے کہ ہو تيري آرزو پوري
!مري دعا ہے تري آرزو بدل جائے
کيا چرخ کج رو ، کيا مہر ، کيا ماہ
سب راہرو ہيں واماندہ راہ
کڑکا سکندر بجلي کي مانند
تجھ کو خبر ہے اے مرگ ناگاہ
نادر نے لوٹي دلي کي دولت
اک ضرب شمشير ، افسانہ کوتاہ
افغان باقي ، کہسار باقي
!الحکم للہ ! الملک للہ
حاجت سے مجبور مردان آزاد
کرتي ہے حاجت شيروں کو روباہ
محرم خودي سے جس دم ہوا فقر
!تو بھي شہنشاہ ، ميں بھي شہنشاہ
قوموں کي تقدير وہ مرد درويش
جس نے نہ ڈھونڈي سلطاں کي درگاہ
يہ مدرسہ يہ کھيل يہ غوغائے روارو
اس عيش فراواں ميں ہے ہر لحظہ غم نو
وہ علم نہيں ، زہر ہے احرار کے حق ميں
جس علم کا حاصل ہے جہاں ميں دو کف جو
ناداں ! ادب و فلسفہ کچھ چيز نہيں ہے
اسباب ہنر کے ليے لازم ہے تگ و دو
فطرت کے نواميس پہ غالب ہے ہنر مند
شام اس کي ہے مانند سحر صاحب پرتو
وہ صاحب فن چاہے تو فن کي برکت سے
!ٹپکے بدن مہر سے شبنم کي طرح ضو
جو عالم ايجاد ميں ہے صاحب ايجاد
ہر دور ميں کرتا ہے طواف اس کا زمانہ
تقليد سے ناکارہ نہ کر اپني خودي کو
کر اس کي حفاظت کہ يہ گوہر ہے يگانہ
!اس قوم کو تجديد کا پيغام مبارک
ہے جس کے تصور ميں فقط بزم شبانہ
ليکن مجھے ڈر ہے کہ يہ آوازہ تجديد
مشرق ميں ہے تقليد فرنگي کا بہانہ
رومي بدلے ، شامي بدلے، بدلا ہندستان
تو بھي اے فرزند کہستاں! اپني خودي پہچان
اپني خودي پہچان
!او غافل افغان
موسم اچھا ، پاني وافر ، مٹي بھي زرخيز
جس نے اپنا کھيت نہ سينچا ، وہ کيسا دہقان
اپني خودي پہچان
!او غافل افغان
اونچي جس کي لہر نہيں ہے ، وہ کيسا درياے
جس کي ہوائيں تند نہيں ہيں ، وہ کيسا طوفان
اپني خودي پہچان
!او غافل افغان
ڈھونڈ کے اپني خاک ميں جس نے پايا اپنا آپ
اس بندے کي دہقاني پر سلطاني قربان
اپني خودي پہچان
!او غافل افغان
تيري بے علمي نے رکھ لي بے علموں کي لاج
عالم فاضل بيچ رہے ہيں اپنا دين ايمان
اپني خودي پہچان
!او غافل افغان
زاغ کہتا ہے نہايت بدنما ہيں تيرے پر
شپرک کہتي ہے تجھ کو کور چشم و بے ہنر
ليکن اے شہباز! يہ مرغان صحرا کے اچھوت
ہيں فضائے نيلگوں کے پيچ و خم سے بے خبر
ان کو کيا معلوم اس طائر کے احوال و مقام
!روح ہے جس کي دم پرواز سر تا پا نظر
عشق طينت ميں فرومايہ نہيں مثل ہوس
پر شہباز سے ممکن نہيں پرواز مگس
يوں بھي دستور گلستاں کو بدل سکتے ہيں
کہ نشيمن ہو عنادل پہ گراں مثل قفس
سفر آمادہ نہيں منتظر بانگ رحيل
!ہے کہاں قافلہ موج کو پروائے جرس
گرچہ مکتب کا جواں زندہ نظر آتا ہے
مردہ ہے ، مانگ کے لايا ہے فرنگي سے نفس
پرورش دل کي اگر مد نظر ہے تجھ کو
!مرد مومن کي نگاہ غلط انداز ہے بس
وہي جواں ہے قبيلے کي آنکھ کا تارا
شباب جس کا ہے بے داغ ، ضرب ہے کاري
اگر ہو جنگ تو شيران غاب سے بڑھ کر
اگر ہو صلح تو رعنا غزال تاتاري
عجب نہيں ہے اگر اس کا سوز ہے ہمہ سوز
کہ نيستاں کے ليے بس ہے ايک چنگاري
خدا نے اس کو ديا ہے شکوہ سلطاني
کہ اس کے فقر ميں ہے حيدري و کراري
نگاہ کم سے نہ ديکھ اس کي بے کلاہي کو
يہ بے کلاہ ہے سرمايہ کلہ داري
جس کے پرتو سے منور رہي تيري شب دوش
پھر بھي ہو سکتا ہے روشن وہ چراغ خاموش
مرد بے حوصلہ کرتا ہے زمانے کا گلہ
بندئہ حر کے ليے نشتر تقدير ہے نوش
نہيں ہنگامہ پيکار کے لائق وہ جواں
جو ہوا نالہ مرغان سحر سے مدہوش
مجھ کو ڈر ہے کہ ہے طفلانہ طبيعت تيري
!اور عيار ہيں يورپ کے شکر پارہ فروش
لا ديني و لاطيني ، کس پيچ ميں الجھا تو
'دارو ہے ضعيفوں کا 'لاغالب الا ھو
صياد معاني کو يورپ سے ہے نوميدي
دلکش ہے فضا ، ليکن بے نافہ تمام آہو
بے اشک سحر گاہي تقويم خودي مشکل
يہ لالہ پيکاني خوشتر ہے کنار جو
صياد ہے کافر کا ، نخچير ہے مومن کا
يہ دير کہن يعني بتخانہ رنگ و بو
اے شيخ ، اميروں کو مسجد سے نکلوا دے
ہے ان کي نمازوں سے محراب ترش ابرو
مجھ کو تو يہ دنيا نظر آتي ہے دگرگوں
معلوم نہيں ديکھتي ہے تيري نظر کيا
ہر سينے ميں اک صبح قيامت ہے نمودار
افکار جوانوں کے ہوئے زير و زبر کيا
کر سکتي ہے بے معرکہ جينے کي تلافي
اے پير حرم تيري مناجات سحر کيا
ممکن نہيں تخليق خودي خانقہوں سے
!اس شعلہ نم خوردہ سے ٹوٹے گا شرر کيا
بے جرات رندانہ ہر عشق ہے روباہي
بازو ہے قوي جس کا ، وہ عشق يداللہي
جو سختي منزل کو سامان سفر سمجھے
اے وائے تن آساني ! ناپيد ہے وہ راہي
!وحشت نہ سمجھ اس کو اے مردک ميداني
کہسار کي خلوت ہے تعليم خود آگاہي
دنيا ہے رواياتي ، عقبي ہے مناجاتي
!در باز دو عالم را ، اين است شہنشاہي
آدم کا ضمير اس کي حقيقت پہ ہے شاہد
مشکل نہيں اے سالک رہ ! علم فقيري
فولاد کہاں رہتا ہے شمشير کے لائق
پيدا ہو اگر اس کي طبيعت ميں حريري
خود دار نہ ہو فقر تو ہے قہر الہي
ہو صاحب غيرت تو ہے تمہيد اميري
افرنگ ز خود بے خبرت کرد وگرنہ
!اے بندئہ مومن ! تو بشيري ، تو نذيري
قوموں کے ليے موت ہے مرکز سے جدائي
!ہو صاحب مرکز تو خودي کيا ہے ، خدائي
جو فقر ہوا تلخي دوراں کا گلہ مند
اس فقر ميں باقي ہے ابھي بوئے گدائي
اس دور ميں بھي مرد خدا کو ہے ميسر
جو معجزہ پربت کو بنا سکتا ہے رائي
در معرکہ بے سوز تو ذوقے نتواں يافت
اے بندئہ مومن تو کجائي ، تو کجائي
خورشيد ! سرا پردئہ مشرق سے نکل کر
پہنا مرے کہسار کو ملبوس حنائي
آگ اس کي پھونک ديتي ہے برنا و پير کو
لاکھوں ميں ايک بھي ہو اگر صاحب يقيں
ہوتا ہے کوہ و دشت ميں پيدا کبھي کبھي
وہ مرد جس کا فقر خزف کو کرے نگيں
تو اپني سرنوشت اب اپنے قلم سے لکھ
خالي رکھي ہے خامہ حق نے تري جبيں
يہ نيلگوں فضا جسے کہتے ہيں آسماں
ہمت ہو پرکشا تو حقيقت ميں کچھ نہيں
بالائے سر رہا تو ہے نام اس کا آسماں
!زير پر آگيا تو يہي آسماں ، زميں
يہ نکتہ خوب کہا شير شاہ سوري نے
کہ امتياز قبائل تمام تر خواري
عزيز ہے انھيں نام وزيري و محسود
ابھي يہ خلعت افغانيت سے ہيں عاري
ہزار پارہ ہے کہسار کي مسلماني
کہ ہر قبيلہ ہے اپنے بتوں کا زناري
وہي حرم ہے ، وہي اعتبار لات و منات
!خدا نصيب کرے تجھ کو ضربت کاري
نگاہ وہ نہيں جو سرخ و زرد پہچانے
نگاہ وہ ہے کہ محتاج مہر و ماہ نہيں
فرنگ سے بہت آگے ہے منزل مومن
قدم اٹھا! يہ مقام انتہائے راہ نہيں
کھلے ہيں سب کے ليے غربيوں کے ميخانے
علوم تازہ کي سرمستياں گناہ نہيں
اسي سرور ميں پوشيدہ موت بھي ہے تري
ترے بدن ميں اگر سوز 'لاالہ' نہيں
سنيں گے ميري صداخانزاد گان کبير؟
!گليم پوش ہوں ميں صاحب کلاہ نہيں
فطرت کے مقاصد کي کرتا ہے نگہباني
يا بندہ صحرائي يا مرد کہستاني
دنيا ميں محاسب ہے تہذيب فسوں گر کا
ہے اس کي فقيري ميں سرمايہ سلطاني
يہ حسن و لطافت کيوں ؟ وہ قوت و شوکت کيوں
!بلبل چمنستاني ، شہباز بياباني
اے شيخ ! بہت اچھي مکتب کي فضا ، ليکن
بنتي ہے بياباں ميں فاروقي و سلماني
صديوں ميں کہيں پيدا ہوتا ہے حريف اس کا
تلوار ہے تيزي ميں صہبائے مسلماني
ابليس
يہ عناصر کا پرانا کھيل، يہ دنيائے دوں
!ساکنان عرش اعظم کي تمناؤں کا خوں
اس کي بربادي پہ آج آمادہ ہے وہ کارساز
جس نے اس کا نام رکھا تھا جہان کاف و نوں
ميں نے دکھلايا فرنگي کو ملوکيت کا خواب
ميں نے توڑا مسجد و دير و کليسا کا فسوں
ميں نے ناداروں کو سکھلايا سبق تقدير کا
ميں نے منعم کو ديا سرمايہ داري کا جنوں
کون کر سکتا ہے اس کي آتش سوزاں کو سرد
جس کے ہنگاموں ميں ہو ابليس کا سوز دروں
جس کي شاخيں ہوں ہماري آبياري سے بلند
!کون کر سکتا ہے اس نخل کہن کو سرنگوں
پہلا مشير
اس ميں کيا شک ہے کہ محکم ہے يہ ابليسي نظام
پختہ تر اس سے ہوئے خوئے غلامي ميں عوام
ہے ازل سے ان غريبوں کے مقدر ميں سجود
ان کي فطرت کا تقاضا ہے نماز بے قيام
آرزو اول تو پيدا ہو نہيں سکتي کہيں
ہو کہيں پيدا تو مر جاتي ہے يا رہتي ہے خام
يہ ہماري سعي پيہم کي کرامت ہے کہ آج
صوفي و ملا ملوکيت کے بندے ہيں تمام
طبع مشرق کے ليے موزوں يہي افيون تھي
!'ورنہ 'قوالي' سے کچھ کم تر نہيں 'علم کلام
ہے طواف و حج کا ہنگامہ اگر باقي تو کيا
کند ہو کر رہ گئي مومن کي تيغ بے نيام
کس کي نوميدي پہ حجت ہے يہ فرمان جديد؟
!ہے جہاد اس دور ميں مرد مسلماں پر حرام
دوسرا مشير
خير ہے سلطاني جمہور کا غوغا کہ شر
!تو جہاں کے تازہ فتنوں سے نہيں ہے با خبر
پہلا مشير
ہوں، مگر ميري جہاں بيني بتاتي ہے مجھے
!جو ملوکيت کا اک پردہ ہو، کيا اس سے خطر
ہم نے خود شاہي کو پہنايا ہے جمہوري لباس
جب ذرا آدم ہوا ہے خود شناس و خود نگر
کاروبار شہرياري کي حقيقت اور ہے
يہ وجود مير و سلطاں پر نہيں ہے منحصر
مجلس ملت ہو يا پرويز کا دربار ہو
ہے وہ سلطاں، غير کي کھيتي پہ ہو جس کي نظر
تو نے کيا ديکھا نہيں مغرب کا جمہوري نظام
!چہرہ روشن، اندروں چنگيز سے تاريک تر
تيسرا مشير
روح سلطاني رہے باقي تو پھر کيا اضطراب
ہے مگر کيا اس يہودي کي شرارت کا جواب؟
وہ کليم بے تجلي، وہ مسيح بے صليب
نيست پيغمبر و ليکن در بغل دارد کتاب
کيا بتاؤں کيا ہے کافر کي نگاہ پردہ سوز
!مشرق و مغرب کي قوموں کے ليے روز حساب
اس سے بڑھ کر اور کيا ہوگا طبيعت کا فساد
!توڑ دي بندوں نے آقاؤں کے خيموں کي طناب
چوتھا مشير
توڑ اس کا رومہ الکبرے کے ايوانوں ميں ديکھ
آل سيزر کو دکھايا ہم نے پھر سيزر کا خواب
کون بحر روم کي موجوں سے ہے لپٹا ہوا
'گاہ بالد چوں صنوبر، گاہ نالد چوں رباب'
تيسرا مشير
ميں تو اس کي عاقبت بيني کا کچھ قائل نہيں
جس نے افرنگي سياست کو کيا يوں بے حجاب
پانچواں مشير (ابليس کو مخاطب کرکے)
!اے ترے سوز نفس سے کار عالم استوار
تو نے جب چاہا، کيا ہر پردگي کو آشکار
آب و گل تيري حرارت سے جہان سوز و ساز
ابلہ جنت تري تعليم سے دانائے کار
تجھ سے بڑھ کر فطرت آدم کا وہ محرم نہيں
سادہ دل بندوں ميں جو مشہور ہے پروردگار
کام تھا جن کا فقط تقديس و تسبيح و طواف
تيري غيرت سے ابد تک سرنگون و شرمسار
گرچہ ہيں تيرے مريد افرنگ کے ساحر تمام
اب مجھے ان کي فراست پر نہيں ہے اعتبار
وہ يہودي فتنہ گر، وہ روح مزدک کا بروز
ہر قبا ہونے کو ہے اس کے جنوں سے تار تار
زاغ دشتي ہو رہا ہے ہمسر شاہين و چرغ
کتني سرعت سے بدلتا ہے مزاج روزگار
چھا گئي آشفتہ ہو کر وسعت افلاک پر
جس کو ناداني سے ہم سمجھے تھے اک مشت غبار
فتنہء فردا کي ہيبت کا يہ عالم ہے کہ آج
کانپتے ہيں کوہسار و مرغزار و جوئبار
ميرے آقا! وہ جہاں زير و زبر ہونے کو ہے
جس جہاں کا ہے فقط تيري سيادت پر مدار
ابليس (اپنے مشيروں سے)
ہے مرے دست تصرف ميں جہان رنگ و بو
کيا زميں، کيا مہر و مہ، کيا آسمان تو بتو
ديکھ ليں گے اپني آنکھوں سے تماشا غرب و شرق
ميں نے جب گرما ديا اقوام يورپ کا لہو
کيا امامان سياست، کيا کليسا کے شيوخ
سب کو ديوانہ بنا سکتي ہے ميري ايک ہو
کارگاہ شيشہ جو ناداں سمجھتا ہے اسے
!توڑ کر ديکھے تو اس تہذيب کے جام و سبو
دست فطرت نے کيا ہے جن گريبانوں کو چاک
مزدکي منطق کي سوزن سے نہيں ہوتے رفو
کب ڈرا سکتے ہيں مجھ کو اشتراکي کوچہ گرد
يہ پريشاں روزگار، آشفتہ مغز، آشفتہ مو
ہے اگر مجھ کو خطر کوئي تو اس امت سے ہے
جس کي خاکستر ميں ہے اب تک شرار آرزو
خال خال اس قوم ميں اب تک نظر آتے ہيں وہ
کرتے ہيں اشک سحر گاہي سے جو ظالم وضو
جانتا ہے، جس پہ روشن باطن ايام ہے
!مزدکيت فتنہ فردا نہيں، اسلام ہے
(2)
جانتا ہوں ميں يہ امت حامل قرآں نہيں
ہے وہي سرمايہ داري بندہ مومن کا ديں
جانتا ہوں ميں کہ مشرق کي اندھيري رات ميں
بے يد بيضا ہے پيران حرم کي آستيں
عصر حاضر کے تقاضاؤں سے ہے ليکن يہ خوف
ہو نہ جائے آشکارا شرع پيغمبر کہيں
الحذر! آئين پيغمبر سے سو بار الحذر
حافظ ناموس زن، مرد آزما، مرد آفريں
موت کا پيغام ہر نوع غلامي کے ليے
نے کوئي فغفور و خاقاں، نے فقير رہ نشيں
کرتا ہے دولت کو ہر آلودگي سے پاک صاف
منعموں کو مال و دولت کا بناتا ہے اميں
اس سے بڑھ کر اور کيا فکر و عمل کا انقلاب
!پادشاہوں کي نہيں، اللہ کي ہے يہ زميں
چشم عالم سے رہے پوشيدہ يہ آئيں تو خوب
يہ غنيمت ہے کہ خود مومن ہے محروم يقيں
ہے يہي بہتر الہيات ميں الجھا رہے
يہ کتاب اللہ کي تاويلات ميں الجھا رہے
(3)
توڑ ڈاليں جس کي تکبيريں طلسم شش جہات
ہو نہ روشن اس خدا انديش کي تاريک رات
ابن مريم مر گيا يا زندہ جاويد ہے
ہيں صفات ذات حق، حق سے جدا يا عين ذات؟
آنے والے سے مسيح ناصري مقصود ہے
يا مجدد، جس ميں ہوں فرزند مريم کے صفات؟
ہيں کلام اللہ کے الفاظ حادث يا قديم
امت مرحوم کي ہے کس عقيدے ميں نجات؟
کيا مسلماں کے ليے کافي نہيں اس دور ميں
يہ الہيات کے ترشے ہوئے لات و منات؟
تم اسے بيگانہ رکھو عالم کردار سے
تا بساط زندگي ميں اس کے سب مہرے ہوں مات
خير اسي ميں ہے، قيامت تک رہے مومن غلام
چھوڑ کر اوروں کي خاطر يہ جہان بے ثبات
ہے وہي شعر و تصوف اس کے حق ميں خوب تر
جو چھپا دے اس کي آنکھوں سے تماشائے حيات
ہر نفس ڈرتا ہوں اس امت کي بيداري سے ميں
ہے حقيقت جس کے ديں کي احتساب کائنات
مست رکھو ذکر و فکر صبحگاہي ميں اسے
پختہ تر کر دو مزاج خانقاہي ميں اسے
ہو تيرے بياباں کي ہوا تجھ کو گوارا
اس دشت سے بہتر ہے نہ دلي نہ بخارا
جس سمت ميں چاہے صفت سيل رواں چل
وادي يہ ہماري ہے، وہ صحرا بھي ہمارا
غيرت ہے بڑي چيز جہان تگ و دو ميں
پہناتي ہے درويش کو تاج سر دارا
حاصل کسي کامل سے يہ پوشيدہ ہنر کر
کہتے ہيں کہ شيشے کو بنا سکتے ہيں خارا
افراد کے ہاتھوں ميں ہے اقوام کي تقدير
ہر فرد ہے ملت کے مقدر کا ستارا
محروم رہا دولت دريا سے وہ غواص
کرتا نہيں جو صحبت ساحل سے کنارا
ديں ہاتھ سے دے کر اگر آزاد ہو ملت
ہے ايسي تجارت ميں مسلماں کا خسارا
دنيا کو ہے پھر معرکہء روح و بدن پيش
تہذيب نے پھر اپنے درندوں کو ابھارا
اللہ کو پامردي مومن پہ بھروسا
ابليس کو يورپ کي مشينوں کا سہارا
تقدير امم کيا ہے، کوئي کہہ نہيں سکتا
مومن کي فراست ہو تو کافي ہے اشارا
اخلاص عمل مانگ نيا گان کہن سے
'!شاہاں چہ عجب گر بنوازند گدا را'
تصوير
کہا تصوير نے تصوير گر سے
نمائش ہے مري تيرے ہنر سے
وليکن کس قدر نا منصفي ہے
!کہ تو پوشيدہ ہو ميري نظر سے
مصور
گراں ہے چشم بينا ديدہ ور پر
!جہاں بيني سے کيا گزري شرر پر
نظر ، درد و غم و سوز و تب و تاب
تو اے ناداں، قناعت کر خبر پر
تصوير
خبر، عقل و خرد کي ناتواني
نظر، دل کي حيات جاوداني
نہيں ہے اس زمانے کي تگ و تاز
'سزاوار حديث 'لن تراني
مصور
تو ہے ميرے کمالات ہنر سے
نہ ہو نوميد اپنے نقش گر سے
مرے ديدار کي ہے اک يہي شرط
کہ تو پنہاں نہ ہو اپني نظر سے
مردہ اپني قبر سے
کيا شے ہے، کس امروز کا فردا ہے قيامت
اے ميرے شبستاں کہن! کيا ہے قيامت؟
قبر
اے مردئہ صد سالہ! تجھے کيا نہيں معلوم؟
!ہر موت کا پوشيدہ تقاضا ہے قيامت
مردہ
جس موت کا پوشيدہ تقاضا ہے قيامت
اس موت کے پھندے ميں گرفتار نہيں ميں
ہر چند کہ ہوں مردئہ صد سالہ وليکن
ظلمت کدہ خاک سے بيزار نہيں ميں
ہو روح پھر اک بار سوار بدن زار
ايسي ہے قيامت تو خريدار نہيں ميں
صدائے غيب
نے نصيب مار و کژدم، نے نصيب دام و دد
ہے فقط محکوم قوموں کے ليے مرگ ابد
بانگ اسرافيل ان کو زندہ کر سکتي نہيں
روح سے تھا زندگي ميں بھي تہي جن کا جسد
مر کے جي اٹھنا فقط آزاد مردوں کا ہے کام
گرچہ ہر ذي روح کي منزل ہے آغوش لحد
(قبر( اپنے مردہ سے
آہ ، ظالم! تو جہاں ميں بندہ محکوم تھا
ميں نہ سمجھي تھي کہ ہے کيوں خاک ميري سوز
ناک
تيري ميت سے مري تاريکياں تاريک تر
تيري ميت سے زميں کا پردئہ ناموس چاک
الحذر، محکوم کي ميت سے سو بار الحذر
!اے سرافيل! اے خدائے کائنات! اے جان پاک
صدائے غيب
گرچہ برہم ہے قيامت سے نظام ہست و بود
ہيں اسي آشوب سے بے پردہ اسرار وجود
زلزلے سے کوہ و در اڑتے ہيں مانند سحاب
زلزلے سے واديوں ميں تازہ چشموں کي نمود
ہر نئي تعمير کو لازم ہے تخريب تمام
ہے اسي ميں مشکلات زندگاني کي کشود
زمين
آہ يہ مرگ دوام، آہ يہ رزم حيات
ختم بھي ہوگي کبھي کشمکش کائنات
عقل کو ملتي نہيں اپنے بتوں سے نجات
عارف و عامي تمام بندئہ لات و منات
خوار ہوا کس قدر آدم يزداں صفات
قلب و نظر پر گراں ايسے جہاں کا ثبات
ہو مبارک اس شہنشاہ نکو فرجام کو
جس کي قرباني سے اسرار ملوکيت ہيں فاش
'شاہ' ہے برطانوي مندر ميں اک مٹي کا بت
جس کو کر سکتے ہيں، جب چاہيں پجاري پاش پاش
ہے يہ مشک آميز افيوں ہم غلاموں کے ليے
ساحر انگليس! مارا خواجہ ديگر تراش
اس دير کہن ميں ہيں غرض مند پجاري
رنجيدہ بتوں سے ہوں تو کرتے ہيں خدا ياد
پوجا بھي ہے بے سود، نمازيں بھي ہيں بے سود
قسمت ہے غريبوں کي وہي نالہ و فرياد
ہيں گرچہ بلندي ميں عمارات فلک بوس
ہر شہر حقيقت ميں ہے ويرانہء آباد
تيشے کي کوئي گردش تقدير تو ديکھے
سيراب ہے پرويز، جگر تشنہ ہے فرہاد
يہ علم، يہ حکمت، يہ سياست، يہ تجارت
جو کچھ ہے، وہ ہے فکر ملوکانہ کي ايجاد
اللہ! ترا شکر کہ يہ خطہ پر سوز
!سوداگر يورپ کي غلامي سے ہے آزاد
يہ مہر و مہ، يہ ستارے يہ آسمان کبود
کسے خبر کہ يہ عالم عدم ہے يا کہ وجود
خيال جادہ و منزل فسانہ و افسوں
کہ زندگي ہے سراپا رحيل بے مقصود
رہي نہ آہ ، زمانے کے ہاتھ سے باقي
وہ يادگار کمالات احمد و محمود
زوال علم و ہنر مرگ ناگہاں اس کي
!وہ کارواں کا متاع گراں بہا مسعود
مجھے رلاتي ہے اہل جہاں کي بيدردي
فغان مرغ سحر خواں کو جانتے ہيں سرود
نہ کہہ کہ صبر ميں پنہاں ہے چارئہ غم دوست
نہ کہہ کہ صبر معمائے موت کي ہے کشود
دلے کہ عاشق و صابر بود مگر سنگ است ''
''ز عشق تا بہ صبوري ہزار فرسنگ است
(سعدي)
نہ مجھ سے پوچھ کہ عمر گريز پا کيا ہے
کسے خبر کہ يہ نيرنگ و سيميا کيا ہے
ہوا جو خاک سے پيدا، وہ خاک ميں مستور
!مگر يہ غيبت صغري ہے يا فنا، کيا ہے
غبار راہ کو بخشا گيا ہے ذوق جمال
خرد بتا نہيں سکتي کہ مدعا کيا ہے
دل و نظر بھي اسي آب و گل کے ہيں اعجاز
نہيں تو حضرت انساں کي انتہا کيا ہے؟
،'جہاں کي روح رواں 'لا الہ الا ھو
!مسيح و ميخ و چليپا ، يہ ماجرا کيا ہے
قصاص خون تمنا کا مانگيے کس سے
گناہ گار ہے کون، اور خوں بہا کيا ہے
غميں مشو کہ بہ بند جہاں گرفتاريم
طلسم ہا شکند آں دلے کہ ما داريم
خودي ہے زندہ تو ہے موت اک مقام حيات
کہ عشق موت سے کرتا ہے امتحان ثبات
خودي ہے زندہ تو دريا ہے بے کرانہ ترا
ترے فراق ميں مضطر ہے موج نيل و فرات
خودي ہے مردہ تو مانند کاہ پيش نسيم
خودي ہے زندہ تو سلطان جملہ موجودات
نگاہ ايک تجلي سے ہے اگر محروم
دو صد ہزار تجلي تلافي مافات
مقام بندئہ مومن کا ہے ورائے سپہر
زميں سے تا بہ ثريا تمام لات و منات
حريم ذات ہے اس کا نشيمن ابدي
نہ تيرہ خاک لحد ہے، نہ جلوہ گاہ صفات
خود آگہاں کہ ازيں خاک داں بروں جستند
طلسم مہر و سپہر و ستارہ بشکستند
آتي ہے دم صبح صدا عرش بريں سے
!کھويا گيا کس طرح ترا جوہر ادراک
کس طرح ہوا کند ترا نشتر تحقيق
ہوتے نہيں کيوں تجھ سے ستاروں کے جگر چاک
تو ظاہر و باطن کي خلافت کا سزاوار
کيا شعلہ بھي ہوتا ہے غلام خس و خاشاک
مہر و مہ و انجم نہيں محکوم ترے کيوں
کيوں تري نگاہوں سے لرزتے نہيں افلاک
اب تک ہے رواں گرچہ لہو تيري رگوں ميں
نے گرمي افکار، نہ انديشہ بے باک
روشن تو وہ ہوتي ہے، جہاں بيں نہيں ہوتي
جس آنکھ کے پردوں ميں نہيں ہے نگہ پاک
باقي نہ رہي تيري وہ آئينہ ضميري
!اے کشتہء سلطاني و ملائي و پيري
مري شاخ امل کا ہے ثمر کيا
تري تقدير کي مجھ کو خبر کيا
کلي گل کي ہے محتاج کشود آج
!نسيم صبح فردا پر نظر کيا
فراغت دے اسے کار جہاں سے
کہ چھوٹے ہر نفس کے امتحاں سے
ہوا پيري سے شيطاں کہنہ انديش
!گناہ تازہ تر لائے کہاں سے
دگرگوں عالم شام و سحر کر
جہان خشک و تر زير و زبر کر
رہے تيري خدائي داغ سے پاک
مرے بے ذوق سجدوں سے حذر کر
غريبي ميں ہوں محسود اميري
کہ غيرت مند ہے ميري فقيري
حذر اس فقر و درويشي سے، جس نے
مسلماں کو سکھا دي سر بزيري
خرد کي تنگ داماني سے فرياد
تجلي کي فراواني سے فرياد
گوارا ہے اسے نظارئہ غير
نگہ کي نا مسلماني سے فرياد
کہا اقبال نے شيخ حرم سے
تہ محراب مسجد سو گيا کون
ندا مسجد کي ديواروں سے آئي
فرنگي بت کدے ميں کھو گيا کون؟
کہن ہنگامہ ہائے آرزو سرد
کہ ہے مرد مسلماں کا لہو سرد
بتوں کو ميري لاديني مبارک
کہ ہے آج آتش 'اللہ ھو، سرد
حديث بندئہ مومن دل آويز
جگر پر خوں، نفس روشن، نگہ تيز
ميسر ہو کسے ديدار اس کا
کہ ہے وہ رونق محفل کم آميز
تميز خار و گل سے آشکارا
نسيم صبح کي روشن ضميري
حفاظت پھول کي ممکن نہيں ہے
اگر کانٹے ميں ہو خوئے حريري
نہ کر ذکر فراق و آشنائي
کہ اصل زندگي ہے خود نمائي
نہ دريا کا زياں ہے، نے گہر کا
دل دريا سے گوہر کي جدائي
ترے دريا ميں طوفاں کيوں نہيں ہے
خودي تيري مسلماں کيوں نہيں ہے
عبث ہے شکوئہ تقدير يزداں
تو خود تقدير يزداں کيوں نہيں ہے؟
خرد ديکھے اگر دل کي نگہ سے
جہاں روشن ہے نور 'لا الہ' سے
فقط اک گردش شام و سحر ہے
اگر ديکھيں فروغ مہر و مہ سے
کبھي دريا سے مثل موج ابھر کر
کبھي دريا کے سينے ميں اتر کر
کبھي دريا کے ساحل سے گزر کر
مقام اپني خودي کا فاش تر کر
پاني ترے چشموں کا تڑپتا ہوا سيماب
مرغان سحر تيري فضاؤں ميں ہيں بيتاب
اے وادي لولاب
گر صاحب ہنگامہ نہ ہو منبر و محراب
ديں بندئہ مومن کے ليے موت ہے يا خواب
اے وادي لولاب
ہيں ساز پہ موقوف نوا ہائے جگر سوز
ڈھيلے ہوں اگر تار تو بے کار ہے مضراب
اے وادي لولاب
ملا کي نظر نور فراست سے ہے خالي
بے سوز ہے ميخانہء صوفي کي مے ناب
اے وادي لولاب
بيدار ہوں دل جس کي فغان سحري سے
اس قوم ميں مدت سے وہ درويش ہے ناياب
موت ہے اک سخت تر جس کا غلامي ہے نام
!مکر و فن خواجگي کاش سمجھتا غلام
شرع ملوکانہ ميں جدت احکام ديکھ
!صور کا غوغا حلال، حشر کي لذت حرام
اے کہ غلامي سے ہے روح تري مضمحل
!سينہء بے سوز ميں ڈھونڈ خودي کا مقام
آج وہ کشمير ہے محکوم و مجبور و فقير
کل جسے اہل نظر کہتے تھے ايران صغير
سينہء افلاک سے اٹھتي ہے آہ سوز ناک
مرد حق ہوتا ہے جب مرعوب سلطان و امير
کہہ رہا ہے داستاں بيدردي ايام کي
کوہ کے دامن ميں وہ غم خانہء دہقان پير
آہ! يہ قوم نجيب و چرب دست و تر دماغ
ہے کہاں روز مکافات اے خدائے دير گير؟
گرم ہو جاتا ہے جب محکوم قوموں کا لہو
تھرتھراتا ہے جہان چار سوے و رنگ و بو
پاک ہوتا ہے ظن و تخميں سے انساں کا ضمير
کرتا ہے ہر راہ کو روشن چراغ آرزو
وہ پرانے چاک جن کو عقل سي سکتي نہيں
عشق سيتا ہے انھيں بے سوزن و تار رفو
ضربت پيہم سے ہو جاتا ہے آخر پاش پاش
حاکميت کا بت سنگيں دل و آئينہ رو
دراج کي پرواز ميں ہے شوکت شاہيں
!حيرت ميں ہے صياد، يہ شاہيں ہے کہ دراج
ہر قوم کے افکار ميں پيدا ہے تلاطم
مشرق ميں ہے فردائے قيامت کي نمود آج
فطرت کے تقاضوں سے ہوا حشر پہ مجبور
وہ مردہ کہ تھا بانگ سرافيل کا محتاج
رندوں کو بھي معلوم ہيں صوفي کے کمالات
ہر چند کہ مشہور نہيں ان کے کرامات
'خود گيري و خودداري و گلبانگ 'انا الحق
آزاد ہو سالک تو ہيں يہ اس کے مقامات
'محکوم ہو سالک تو يہي اس کا 'ہمہ اوست
!خود مردہ و خود مرقد و خود مرگ مفاجات
نکل کر خانقاہوں سے ادا کر رسم شبيري
کہ فقر خانقاہي ہے فقط اندوہ و دلگيري
ترے دين و ادب سے آ رہي ہے بوئے رہباني
يہي ہے مرنے والي امتوں کا عالم پيري
شياطين ملوکيت کي آنکھوں ميں ہے وہ جادو
کہ خود نخچير کے دل ميں ہو پيدا ذوق نخچيري
چہ بے پروا گذشتند از نواے صبحگاہ من
!کہ برد آں شور و مستي از سيہ چشمان کشميري
سمجھا لہو کي بوند اگر تو اسے تو خير
دل آدمي کا ہے فقط اک جذبہء بلند
گردش مہ و ستارہ کي ہے ناگوار اسے
دل آپ اپنے شام و سحر کا ہے نقش بند
جس خاک کے ضمير ميں ہے آتش چنار
ممکن نہيں کہ سرد ہو وہ خاک ارجمند
کھلا جب چمن ميں کتب خانہء گل
نہ کام آيا ملا کو علم کتابي
متانت شکن تھي ہوائے بہاراں
غزل خواں ہوا پيرک اندرابي
کہا لالہ آتشيں پيرہن نے
کہ اسرار جاں کي ہوں ميں بے حجابي
سمجھتا ہے جو موت خواب لحد کو
نہاں اس کي تعمير ميں ہے خرابي
نہيں زندگي سلسلہ روز و شب کا
نہيں زندگي مستي و نيم خوابي
حيات است در آتش خود تپيدن
خوش آں دم کہ ايں نکتہ را بازيابي
اگر ز آتش دل شرارے بگيري
تواں کرد زير فلک آفتابي
آزاد کي رگ سخت ہے مانند رگ سنگ
محکوم کي رگ نرم ہے مانند رگ تاک
محکوم کا دل مردہ و افسردہ و نوميد
آزاد کا دل زندہ و پرسوز و طرب ناک
آزاد کي دولت دل روشن، نفس گرم
محکوم کا سرمايہ فقط ديدئہ نم ناک
محکوم ہے بيگانہء اخلاص و مروت
ہر چند کہ منطق کي دليلوں ميں ہے چالاک
ممکن نہيں محکوم ہو آزاد کا ہمدوش
وہ بندئہ افلاک ہے، يہ خواجہ افلاک
تمام عارف و عامي خودي سے بيگانہ
کوئي بتائے يہ مسجد ہے يا کہ ميخانہ
يہ راز ہم سے چھپايا ہے مير واعظ نے
کہ خود حرم ہے چراغ حرم کا پروانہ
طلسم بے خبري، کافري و ديں داري
حديث شيخ و برہمن فسون و افسانہ
نصيب خطہ ہو يا رب وہ بندئہ درويش
کہ جس کے فقر ميں انداز ہوں کليمانہ
چھپے رہيں گے زمانے کي آنکھ سے کب تک
گہر ہيں آب ولر کے تمام يک دانہ
دگرگوں جہاں ان کے زور عمل سے
بڑے معرکے زندہ قوموں نے مارے
منجم کي تقويم فردا ہے باطل
گرے آسماں سے پرانے ستارے
ضمير جہاں اس قدر آتشيں ہے
کہ دريا کي موجوں سے ٹوٹے ستارے
زميں کو فراغت نہيں زلزلوں سے
نماياں ہيں فطرت کے باريک اشارے
ہمالہ کے چشمے ابلتے ہيں کب تک
!خضر سوچتا ہے ولر کے کنارے
نشاں يہي ہے زمانے ميں زندہ قوموں کا
کہ صبح و شام بدلتي ہيں ان کي تقديريں
کمال صدق و مروت ہے زندگي ان کي
معاف کرتي ہے فطرت بھي ان کي تقصيريں
قلندرانہ ادائيں، سکندرانہ جلال
يہ امتيں ہيں جہاں ميں برہنہ شمشيريں
خودي سے مرد خود آگاہ کا جمال و جلال
کہ يہ کتاب ہے، باقي تمام تفسيريں
شکوہ عيد کا منکر نہيں ہوں ميں، ليکن
قبول حق ہيں فقط مرد حر کي تکبيريں
حکيم ميري نواؤں کا راز کيا جانے
ورائے عقل ہيں اہل جنوں کي تدبيريں
چہ کافرانہ قمار حيات مي بازي
کہ با زمانہ بسازي بخود نمي سازي
دگر بمدرسہ ہائے حرم نمي بينم
دل جنيد و نگاہ غزالي و رازي
بحکم مفتي اعظم کہ فطرت ازليست
بدين صعوہ حرام است کار شہبازي
ہماں فقيہ ازل گفت جرہ شاہيں را
بآسماں گروي با زميں نہ پروازي
منم کہ توبہ نہ کردم ز فاش گوئي ہا
ز بيم ايں کہ بسلطاں کنند غمازي
بدست ما نہ سمرقند و نے بخارا ايست
دعا بگو ز فقيراں بہ ترک شيرازي
ضمير مغرب ہے تاجرانہ، ضمير مشرق ہے راہبانہ
وہاں دگرگوں ہے لحظہ لحظہ، يہاں بدلتا نہيں زمانہ
کنار دريا خضر نے مجھ سے کہا بہ انداز محرمانہ
سکندري ہو، قلندري ہو، يہ سب طريقے ہيں ساحرانہ
حريف اپنا سمجھ رہے ہيں مجھے خدايان خانقاہي
انھيں يہ ڈر ہے کہ ميرے نالوں سے شق نہ ہو سنگ آستانہ
غلام قوموں کے علم و عرفاں کي ہے يہي رمز آشکارا
زميں اگر تنگ ہے تو کيا ہے، فضائے گردوں ہے بے کرانہ
خبر نہيں کيا ہے نام اس کا، خدا فريبي کہ خود فريبي
عمل سے فارغ ہوا مسلماں بنا کے تقدير کا بہانہ
مري اسيري پہ شاخ گل نے يہ کہہ کے صياد کو رلايا
کہ ايسے پرسوز نغمہ خواں کا گراں نہ تھا مجھ پہ آشيانہ
حاجت نہيں اے خطہ گل شرح و بياں کي
تصوير ہمارے دل پر خوں کي ہے لالہ
تقدير ہے اک نام مکافات عمل کا
ديتے ہيں يہ پيغام خدايان ہمالہ
سرما کي ہواؤں ميں ہے عرياں بدن اس کا
ديتا ہے ہنر جس کا اميروں کو دوشالہ
اميد نہ رکھ دولت دنيا سے وفا کي
رم اس کي طبيعت ميں ہے مانند غزالہ
خود آگاہي نے سکھلا دي ہے جس کو تن فراموشي
حرام آئي ہے اس مرد مجاہد پر زرہ پوشي
آں عزم بلند آور آں سوز جگر آور
شمشير پدر خواہي بازوے پدر آور
غريب شہر ہوں ميں، سن تو لے مري فرياد
کہ تيرے سينے ميں بھي ہوں قيامتيں آباد
مري نوائے غم آلود ہے متاع عزيز
جہاں ميں عام نہيں دولت دل ناشاد
گلہ ہے مجھ کو زمانے کي کور ذوقي سے
سمجھتا ہے مري محنت کو محنت فرہاد
صدائے تيشہ کہ بر سنگ ميخورد دگر است ''
''خبر بگير کہ آواز تيشہ و جگر است
تھا يہ اللہ کا فرماں کہ شکوہ پرويز
دو قلندر کو کہ ہيں اس ميں ملوکانہ صفات
مجھ سے فرمايا کہ لے، اور شہنشاہي کر
حسن تدبير سے دے آني و فاني کو ثبات
ميں تو اس بار امانت کو اٹھاتا سر دوش
کام درويش ميں ہر تلخ ہے مانند نبات
غيرت فقر مگر کر نہ سکي اس کو قبول
!جب کہا اس نے يہ ہے ميري خدائي کي زکات
عجم ہنوز نداند رموز ديں، ورنہ
ز ديوبند حسين احمد! ايں چہ بوالعجبي است
سرود بر سر منبر کہ ملت از وطن است
چہ بے خبر ز مقام محمد عربي است
بمصطفي برساں خويش را کہ ديں ہمہ اوست
اگر بہ او نرسيدي ، تمام بولہبي است
جہاں ميں دانش و بينش کي ہے کس درجہ ارزاني
کوئي شے چھپ نہيں سکتي کہ يہ عالم ہے نوراني
کوئي ديکھے تو ہے باريک فطرت کا حجاب اتنا
نماياں ہيں فرشتوں کے تبسم ہائے پنہاني
يہ دنيا دعوت ديدار ہے فرزند آدم کو
کہ ہر مستور کو بخشا گيا ہے ذوق عرياني
يہي فرزند آدم ہے کہ جس کے اشک خونيں سے
کيا ہے حضرت يزداں نے درياؤں کو طوفاني
فلک کو کيا خبر يہ خاکداں کس کا نشيمن ہے
غرض انجم سے ہے کس کے شبستاں کي نگہباني
اگر مقصود کل ميں ہوں تو مجھ سے ماورا کيا ہے
مرے ہنگامہ ہائے نو بہ نو کي انتہا کيا ہے؟